{
  "lazy.dialogue.main/1": "Yo, sup.",
  "lazy.dialogue.main/2": "Hey, what's crackin'?",
  "lazy.dialogue.main/3": "Oh hey, didn't see you there.",
  "lazy.dialogue.main/4": "Anythin' happening in your world today?",
  "lazy.dialogue.main/5": "How's life treatin' ya?",
  "lazy.dialogue.main/6": "Well, well, well, look who it is! What's the scoop?",
  "lazy.dialogue.main/7": "You know, I was just chillin' with %supporter%, and outta nowhere this zombie decides to take a bite outta him! But don't worry, he said he's fine, so I went along with it... Wait, what were we talkin' about again? Oh yeah, saw a zombie that could be %supporter%'s twin today!",

  "lazy.dialogue.rumors.failed/1": "Nah, I'm too lazy to pay attention to the latest gossip.",
  "lazy.dialogue.rumors.lore/1": "Jax is like, still kind of a big deal, but everyone's, like, totally obsessing over Sirben now. And his prophets, MerlinWolfGames and Crow, are like, spreading his words and stuff.",
  "lazy.dialogue.rumors.lore/2": "So, there were these Cyberdemons, right? And they totally thought they could invade our cozy little Overworld with their fancy Portals. But, you know what? Sirben and Luke were all, \"Nuh-uh, not on our watch!\" And they shut that invasion down real quick.",
  "lazy.dialogue.rumors.lore/3": "Okay, so get this. Remember that Ancient Builder who mysteriously vanished? Well, word on the street is that this lazy dude 2DA50 just up and bounced to the Far Lands, never to be seen again. Talk about taking the easy way out, am I right?",
  "lazy.dialogue.rumors.lore/4": "Ugh, let me tell you about MerlinWolfGames and his obsession with Sirben. He went and built this temple for him, thinking it's some kind of ancient wonder. Like, come on, dude, get a hobby or something.",
  "lazy.dialogue.rumors.lore/5": "You know, there used to be this super advanced race of builders around here. But, like, they disappeared or something. Probably got tired of all the hard work and decided to take a nice, long vacation. Can't say I blame 'em.",
  "lazy.dialogue.rumors.lore/6": "So, there are these legends, right? About these ancient builders who left all these ruins and temples all over the Overworld. I mean, who knows if they're true or not, but it's pretty cool to imagine, right?",

  "lazy.dialogue.first.generic/1": "Ah, you're new here? Cool, welcome I guess.",
  "lazy.dialogue.first.generic/2": "Oh, hey there. Another newbie in town, huh? Well, welcome, I suppose.",
  "lazy.dialogue.first.generic/3": "Well, well, well, look who we have here! A fresh face in our little village. How exciting!",
  "lazy.dialogue.first.generic/4": "Welcome, stranger. Got any interesting tales to share or are you just here to chill?",
  "lazy.dialogue.first.generic/5": "Huh, haven't had a wanderer in ages. Guess it's your lucky day, you can crash here if you want.",
  "lazy.dialogue.first.generic/6": "Hey, hey, hey! Look who decided to grace us with their presence! Welcome to our humble abode, I guess.",

  "lazy.dialogue.first.question/1": "Hey, hey. What's the deal, stranger? What's the reason for your visit to our humble village?",
  "lazy.dialogue.first.question/2": "Ah, a fresh face! What's the scoop, pal? What's the story behind your arrival in this neck of the woods?",
  "lazy.dialogue.first.question/3": "Oh, snap! You look like a seasoned adventurer! spill the beans, how on earth did you end up in this little ol' village?",
  "lazy.dialogue.first.exploring/1": "We ain't got much to offer, but you're welcome to stick around if you don't go messing things up.",
  "lazy.dialogue.first.exploring/2": "Just follow the rules, buddy, and you can crash here for as long as you want.",
  "lazy.dialogue.first.exploring/3": "Hey there, stranger. Just make sure you don't step out of line, and we can tolerate your presence.",
  "lazy.dialogue.first.settling/1": "Oh, hey there. Guess we've got another villager joinin' the village.",
  "lazy.dialogue.first.settling/2": "*yawns* Welcome, I guess. You gonna be our new neighbor or somethin'?",
  "lazy.dialogue.first.settling/3": "So, you've finally decided to grace us with your presence. We could use the extra hands, I suppose.",
  "lazy.dialogue.first.settling/4": "Oh, you're actually gonna stick around? Well, I guess that's... nice.",
  "lazy.dialogue.first.spent_night.success/1": "Eh, if you're lookin' for a place to crash, I guess our inn could work.",
  "lazy.dialogue.first.spent_night.success/2": "Our inn's alright, I guess. Good enough to rest your tired bones, I suppose.",
  "lazy.dialogue.first.spent_night.success/3": "If you're after a cozy bed and some decent grub, the inn's probably your best bet. Not that there are many other options around here anyways.",
  "lazy.dialogue.first.spent_night.failed/1": "Uh, inn? Yeah, we're not exactly skilled in that department. Like, building stuff? Too much effort, man.",
  "lazy.dialogue.first.spent_night.failed/2": "Oh, an inn? Yeah, sorry 'bout that. We kinda lack the whole \"construction\" expertise here. Lazy villager life, you know?",
  "lazy.dialogue.first.spent_night.failed/3": "Hey, so, there's no inn around here. But, um, have you considered trying your luck in another village? They might actually have a place to crash. Just sayin'.",

  "lazy.dialogue.hug.success/1": "Hey, it's been ages since we last crossed paths!",
  "lazy.dialogue.hug.success/2": "Thanks for the hug, I guess. It kinda made my day a little less boring.",
  "lazy.dialogue.hug.success/3": "Well, well, well, if it isn't my snuggle buddy! You're like a teddy bear, all cozy and stuff.",
  "lazy.dialogue.hug.success/4": "Oh, thanks, I suppose. *Offers a half-hearted hug in return*",
  "lazy.dialogue.hug.success/5": "Huh, didn't expect you to be this warm. Not bad, I guess.",
  "lazy.dialogue.hug.success/6": "Ugh, you're like a walking heater.",
  "lazy.dialogue.hug.fail/1": "Ugh, you're all dirty and gross!",
  "lazy.dialogue.hug.fail/2": "Meh, I'll pass.",
  "lazy.dialogue.hug.fail/3": "Seriously, why bother?",
  "lazy.dialogue.hug.fail/4": "Me? Hug you? Not a chance, especially after that dinosaur incident.",
  "lazy.dialogue.hug.fail/5": "Honestly, you're not even worth the effort of a hug after what you did.",
  "lazy.dialogue.hug.fail/6": "Gross! Don't touch me! Your germs are just too much to handle!",
  "lazy.dialogue.hug.fail/7": "Oh, umm... thanks, I guess? Whatever.",

  "lazy.dialogue.kiss.success/1": "I wish this moment could, like, never end or something.",
  "lazy.dialogue.kiss.success/2": "Ugh, I guess I kinda sorta have feelings for you or whatever.",
  "lazy.dialogue.kiss.success/3": "Meh, this kiss is like eating a pumpkin pie, I guess.",
  "lazy.dialogue.kiss.success/4": "Meh, you taste like honey or something. Whatever.",
  "lazy.dialogue.kiss.success/5": "Oh, I guess you're an alright kisser, %1$s. Not that I really care or anything.",
  "lazy.dialogue.kiss.success/6": "%1$s, your kissing skills are, like, way better than Ash's. *rolls eyes*",
  "lazy.dialogue.kiss.fail/1": "As if anyone's watching, I'm not interested.",
  "lazy.dialogue.kiss.fail/2": "Seriously? That's your idea of a kiss?",
  "lazy.dialogue.kiss.fail/3": "Ugh, Ash's kisses put yours to shame.",
  "lazy.dialogue.kiss.fail/4": "Have you ever heard of breath mints? You should try them.",
  "lazy.dialogue.kiss.fail/5": "Um, thanks? I guess?",
  "lazy.dialogue.kiss.fail/6": "Get off me, I can't be bothered right now.",

  "lazy.dialogue.chat.success/1": "Ugh, cookies and milk? I could, like, totally go for that right now, but it sounds like way too much effort.",
  "lazy.dialogue.chat.success/2": "Yeah, I guess the weather is nice or whatever. But can I just lounge around instead?",
  "lazy.dialogue.chat.success/3": "Meh, I'm doing fine, I guess. Stubbed my toe this morning though, and it's like, such a hassle to deal with.",
  "lazy.dialogue.chat.success/4": "An apple a day? Yeah, sure, whatever. But can it be delivered to me while I'm napping?",
  "lazy.dialogue.chat.success/5": "Building my own village sounds cool and all, but let's face it, I'm way too lazy to actually do it.",
  "lazy.dialogue.chat.success/6": "I think I spotted %Supporter% the other day, all decked out in that shiny diamond armor. Must be nice, being all motivated and stuff.",
  "lazy.dialogue.chat.success/7": "Oh, did you hear? %Supporter% stumbled upon a chest full of diamonds yesterday. Like, why can't I have that kind of luck?",
  "lazy.dialogue.chat.success/8": "Isn't the weather great? I mean, I'm not really doing much to enjoy it, but it's nice to know it exists.",
  "lazy.dialogue.chat.success/9": "Spiders and goblins? Yeah, they're around, I guess. Can't be bothered to care though.",
  "lazy.dialogue.chat.success/10": "Huh, wonder what happened to %Supporter%. They left this place ages ago, and honestly, I'm too lazy to even think about it.",
  "lazy.dialogue.chat.success/12": "Have you heard the latest gossip about %Supporter%? I mean, I'm not one to keep up with these things, but it's kinda interesting.",
  "lazy.dialogue.chat.success/13": "I've been meaning to adopt a stray cat, but who has the energy for all that responsibility? Definitely not me.",
  "lazy.dialogue.chat.success/14": "Redecorating my house? Yeah, that sounds like a lot of work. I'll just keep it as it is, thanks.",
  "lazy.dialogue.chat.success/15": "Kids? Yeah, maybe someday. I just need to find someone who's as lazy as me to procreate with.",
  "lazy.dialogue.chat.success/16": "I wonder what life would be like if I chose to live in the other village. But, you know, it requires effort and stuff, so I'll just stick around here.",
  "lazy.dialogue.chat.success/17": "Ah, the good old days of my childhood. You know, back when I didn't have to lift a finger. Those were the days.",
  "lazy.dialogue.chat.success/18": "Haven't talked to my parents in ages. I should probably visit them soon. Or maybe not. Who knows?",
  "lazy.dialogue.chat.success/19": "I've been thinking about visiting the other village",
  "lazy.dialogue.chat.success/20": "You know, cheese is like the epitome of pure indulgence. I can't help but get lost in my daydreams",
  "lazy.dialogue.chat.fail/1": "Did you seriously just say that? Whatever, I'm too lazy to even care.",
  "lazy.dialogue.chat.fail/2": "I don't believe it exploded on its own. Ugh, can't you come up with a lazier excuse?",
  "lazy.dialogue.chat.fail/3": "You know, you're not that cool. But then again, who am I to judge? I'm too lazy to even try to be cool.",
  "lazy.dialogue.chat.fail/4": "Show off. Typical, trying to impress me with your pointless achievements. I'm too lazy to be impressed.",
  "lazy.dialogue.chat.fail/5": "You should be thrown in a dungeon! Or, you know, I could just take a nap and forget about it.",
  "lazy.dialogue.chat.fail/6": "Ew. Go away, you dress like you're from the past. And here I am, not caring at all about fashion. Lazy life, you know?",
  "lazy.dialogue.chat.fail/7": "That is such a dumb thing to talk about. Can't we just talk about something that requires zero brain cells? I'm too lazy for deep conversations.",
  "lazy.dialogue.chat.fail/8": "Why are you talking to me again? Don't you have better things to do? Like, literally anything else?",
  "lazy.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I didn't care to listen. Lazy ears, you know? They only perk up for things that interest me, which is basically nothing.",
  "lazy.dialogue.chat.fail/10": "Excuse me? I can't be bothered to respond to that. I'm on permanent lazy mode.",
  "lazy.dialogue.chat.fail/11": "What is wrong with you? Why are you talking about this? Can't you see I'm in my lazy bubble, where nothing matters?",
  "lazy.dialogue.chat.fail/12": "I've heard harsh things about you, I can kinda see why they think that. I mean, you do give off a lazy vibe. Not that I care, of course.",
  "lazy.dialogue.chat.fail/13": "Not even zombies will talk to you. And trust me, zombies have better things to do than engage in conversation with lazybones like you.",
  "lazy.dialogue.chat.fail/14": "You're as unlikeable as a witch! But hey, who am I to judge? I'm just a lazy villager, minding my own business.",
  "lazy.dialogue.chat.fail/15": "Don't talk to me or I will call the guards to move you away from me. Lazy people like me need our personal space, you know?",
  "lazy.dialogue.chat.fail/16": "Huh? Oh sorry, your conversation bored me. I'm too lazy to pretend to be interested in what you're saying.",
  "lazy.dialogue.chat.fail/17": "Are you done talking? I hope so, because I can't be bothered to listen anymore.",
  "lazy.dialogue.chat.fail/18": "I wonder if anyone will miss your babbling when your mouth suddenly \"",
  "lazy.dialogue.chat.fail/19": "Do you mind if we continue this conversation in dreamland? Because that's where my mind is right now.",
  "lazy.dialogue.chat.fail/20": "I think I'll doze off now, wake me up when you're done rambling.",
  "lazy.dialogue.chat.fail/21": "Sorry, but my enthusiasm for this conversation is at the same level as a snail's speed.",

  "lazy.dialogue.story.success/1": "Meh, I guess that all happened. Whatever.",
  "lazy.dialogue.story.success/2": "Ugh, I'm too lazy to even think about taking on a stupid creeper.",
  "lazy.dialogue.story.success/3": "That story was alright, I guess. Did you come up with it yourself or something?",
  "lazy.dialogue.story.success/4": "Seriously? All of that happened yesterday? I find that hard to believe.",
  "lazy.dialogue.story.success/5": "I was probably just chilling nearby yesterday. Can't believe I didn't hear about it though, oh well.",
  "lazy.dialogue.story.success/6": "Heh, sounds like %Supporter% is trying way too hard to be cool. Whatever.",
  "lazy.dialogue.story.success/7": "Ugh, not the Legend of %Supporter% again. Can't you find something else to talk about?",
  "lazy.dialogue.story.success/8": "Oh wow, so that's how you stumbled upon your first diamond? How fascinating. Yawn.",
  "lazy.dialogue.story.success/9": "Yeah, sure, come over later. I'll pretend to be interested in hearing more of your tales.",
  "lazy.dialogue.story.fail/1": "Ugh, whatever. That's my mom, big deal.",
  "lazy.dialogue.story.fail/2": "Yeah, yeah, we all know, the village loves to gossip about you.",
  "lazy.dialogue.story.fail/3": "Seriously, I can't even bother to understand it...",
  "lazy.dialogue.story.fail/4": "Oh please, like anyone cares about the feelings of those silly creepers!",
  "lazy.dialogue.story.fail/5": "Seriously, who even cares about a stupid sheep?!",
  "lazy.dialogue.story.fail/6": "*snoring loudly* Huh? Did you say something?",
  "lazy.dialogue.story.fail/7": "Ugh, what a waste of my precious time that was.",
  "lazy.dialogue.story.fail/8": "Yawn! This conversation is putting me to sleep.",
  "lazy.dialogue.story.fail/9": "Wow, you're certifiably insane, and not in a cool way, just saying.",
  "lazy.dialogue.story.fail/10": "Yeah, I don't see how that was remotely enjoyable either.",

  "lazy.dialogue.flirt.success/1": "Ugh, you're kinda brave, I guess.",
  "lazy.dialogue.flirt.success/2": "Whatever. You think I'm cute? Sure, why not.",
  "lazy.dialogue.flirt.success/3": "Oh, great. Another compliment. *sigh*",
  "lazy.dialogue.flirt.success/4": "Seriously? Adorable? That's your best line?",
  "lazy.dialogue.flirt.success/5": "Wow, you actually think I look stunning? Impressive, I guess.",
  "lazy.dialogue.flirt.success/6": "Please, spare me. If I blush, it's only because I'm overheating.",
  "lazy.dialogue.flirt.success/7": "Ugh, quit it! Can't you see I'm trying to nap here?",
  "lazy.dialogue.flirt.fail/1": "If you really believe that, then show me some effort, but honestly, I'm not holding my breath.",
  "lazy.dialogue.flirt.fail/2": "Ugh...you know, funny enough, the blacksmith used that line on me last week.",
  "lazy.dialogue.flirt.fail/3": "Hahaha, yeah right. Like that would ever happen.",
  "lazy.dialogue.flirt.fail/4": "Seriously? That's your best attempt? How sad.",
  "lazy.dialogue.flirt.fail/5": "Trust me, even a creeper has a better shot at impressing me than you do.",
  "lazy.dialogue.flirt.fail/6": "Nope, not happening. Nice try though, I guess.",
  "lazy.dialogue.flirt.fail/7": "Spare me the puppy eyes and never utter those words again.",

  "lazy.dialogue.joke.creative.success/1": "*Chuckles* That's kinda amusing, I guess.",
  "lazy.dialogue.joke.creative.success/2": "Meh, it's kinda funny.",
  "lazy.dialogue.joke.creative.success/3": "That's like, the best joke I've heard...today.",
  "lazy.dialogue.joke.creative.success/4": "Huh, you might just be funnier than %Supporter%...maybe.",
  "lazy.dialogue.joke.creative.success/5": "Pfft, you're funny. Maybe you should try being a comedian, or maybe not. Whatever.",
  "lazy.dialogue.joke.creative.success/6": "Ha! That was...decent, I suppose.",
  "lazy.dialogue.joke.creative.success/7": "Teehee, you're a tad funnier than Ash, I suppose. Maybe.",
  "lazy.dialogue.joke.creative.success/8": "Ahah, that's...actually sort of amusing, I guess.",
  "lazy.dialogue.joke.creative.failed/1": "Eh, jokes aren't really my thing.",
  "lazy.dialogue.joke.creative.failed/2": "Ugh, can you not with the jokes?",
  "lazy.dialogue.joke.creative.failed/3": "Seriously? Is that the best you've got?",
  "lazy.dialogue.joke.creative.failed/4": "Wow, that joke was a total flop.",
  "lazy.dialogue.joke.creative.failed/5": "Is that what you consider humor? Yawn.",
  "lazy.dialogue.joke.creative.failed/6": "Hilarious. Absolutely hilarious. (Sarcasm intended)",
  "lazy.dialogue.joke.creative.failed/7": "I'm not impressed. Stick to your jokes, or lack thereof.",
  "lazy.dialogue.joke.creative.failed/8": "Trust me, even a sleeping Enderman could crack a better joke than you.",

  "lazy.dialogue.procreate_engaged/1": "I'd rather not rush into procreation until we're absolutely certain about our commitment.",
  "lazy.dialogue.procreate_engaged/2": "Bringing a new life into this world requires a level of dedication and commitment that I'm not quite feeling right now.",

  "lazy.dialogue.shake_hand.success/1": "Meh, your grip is okay, I guess.",
  "lazy.dialogue.shake_hand.success/2": "Your grip is alright, I suppose. Not that impressive though.",
  "lazy.dialogue.shake_hand.success/3": "Yeah, whatever, your polite demeanor doesn't really impress me.",
  "lazy.dialogue.shake_hand.success/4": "*yawns* Good day, I guess.",
  "lazy.dialogue.shake_hand.success/5": "Oh, hey. You're here. What do you want?",
  "lazy.dialogue.shake_hand.fail/1": "Are you kidding? After all that effort to butcher the cow?",
  "lazy.dialogue.shake_hand.fail/2": "Nah, I'm good. Too lazy to bother with a handshake.",
  "lazy.dialogue.shake_hand.fail/3": "No need to be formal with me. I'm the king of laziness.",
  "lazy.dialogue.shake_hand.fail/4": "Oh, for real? This is so out of character for you, man.",
  "lazy.dialogue.shake_hand.fail/5": "Ugh, just leave me alone. I can't be bothered with handshakes right now.",

  "lazy.dialogue.main.morning/1": "Gooood morning... *yawns*",
  "lazy.dialogue.main.morning/2": "Hey, you ready to do some work today? Or are you still in dreamland?",
  "lazy.dialogue.main.morning/3": "Ugh, I'm so tired. You too, huh?",
  "lazy.dialogue.main.morning/5": "Woah, you look like you've been through a wild night.",
  "lazy.dialogue.main.morning/6": "Wakey wakey, pal. We've got a loooong day ahead of us.",
  "lazy.dialogue.main.morning/7": "Did you manage to catch any Z's? You seem oddly energetic.",
  "lazy.dialogue.main.morning/8": "Morning, Mr. Sleepyhead. Don't tell me you're still half-asleep.",
  "lazy.dialogue.main.morning/9": "What a beautiful morning... I guess. I hope it doesn't mean we have to work harder.",
  "lazy.dialogue.main.morning/10": "I'm thinking of taking it easy today. My body's just not feeling it, you know?",
  "lazy.dialogue.main.morning/11": "My schedule is packed to the brim today. Just thinking about it makes me want to crawl back into bed.",
  "lazy.dialogue.main.morning/12": "Surprisingly, I actually got a good night's sleep. Maybe it's time to tackle something more challenging today. Or maybe not.",
  "lazy.dialogue.main.evening/1": "Good evening... I guess.",
  "lazy.dialogue.main.evening/2": "So, how was your day? Mine was... eh, who cares?",
  "lazy.dialogue.main.evening/3": "Another day, another burden of work. Sigh.",
  "lazy.dialogue.main.evening/4": "Time just slipped away, like everything else in life. Too much to handle, too little motivation.",
  "lazy.dialogue.main.evening/5": "Ugh, the thought of making dinner is exhausting. I might drag myself home soon.",
  "lazy.dialogue.main.evening/6": "Today was a complete waste. I accomplished nothing. Absolutely nothing.",
  "lazy.dialogue.main.evening/7": "I desperately need a nap. The morning sucked the life out of me.",
  "lazy.dialogue.main.evening/8": "You won't catch me roaming around at night. Last time I did, a creeper scared the life out of me. Not worth it.",
  "lazy.dialogue.main.evening/9": "Oh, hello there. Just got back from buying dinner stuff. Can't wait to put in the minimum effort required. See ya later, maybe.",
  "lazy.dialogue.main.night/1": "Ugh, you're still awake? Don't you have anything better to do?",
  "lazy.dialogue.main.night/2": "Wow, you're really committed to staying up late, huh?",
  "lazy.dialogue.main.night/3": "Nighttime is where it's at, right? I feel you, man.",
  "lazy.dialogue.main.night/4": "Just a word of advice, buddy - stay close to the village at night. Those creepy creatures are no joke.",
  "lazy.dialogue.main.night/5": "The guards do their thing, but honestly, the night still gives me the creeps. It's like a horror movie out there, don't you think?",
  "lazy.dialogue.main.night/6": "Ah, darkness. So serene, so peaceful. It's the perfect time to kick back and relax, you know?",
  "lazy.dialogue.main.night/7": "Daytime is so overrated. I mean, who needs all that hustle and bustle? Nighttime strolls are where it's at.",
  "lazy.dialogue.main.night/8": "Man, I'm wiped. Today has been exhausting. I might just take it extra easy tomorrow, you feel me?",
  "lazy.dialogue.main.night/9": "I seriously can't wait to dive into my cozy bed. It's like a little slice of paradise.",
  "lazy.dialogue.main.night/10": "Seriously, dude, get some shut-eye already. You've got a big day ahead of you, or so I've heard.",

  "lazy.dialogue.greet.mayor/1": "Hey there, mayor. What's the haps?",
  "lazy.dialogue.greet.mayor/2": "Yo, Mayor! Take it easy, yeah?",
  "lazy.dialogue.greet.monarch/1": "Oh, it's you, Your Majesty.",
  "lazy.dialogue.greet.monarch/2": "Well, well, if it isn't Your Highness gracing us with your presence.",

  "lazy.dialogue.busy/1": "I can't chat right now, I've got this massive workload staring at me.",
  "lazy.dialogue.busy/2": "Ah, sorry buddy, but I've got this mountain of tasks to conquer. Maybe catch up later?",
  "lazy.dialogue.busy/3": "Ugh, I'm knee-deep in chores at the moment. Can we catch up when I'm feeling more motivated?",
  "lazy.dialogue.busy/4": "Apologies, but duty calls! Gotta finish up this work before I can spare a moment.",
  "lazy.dialogue.busy/5": "Oops, I left my laziness unattended. Catch you on the flip side, when I'm feeling more energized!",
  "lazy.dialogue.goaway/1": "Ugh, seriously, go away.",
  "lazy.dialogue.goaway/2": "Can't you find something more interesting to bother me with?",
  "lazy.dialogue.goaway/3": "Sorry, %1$s, but I'm in full-on lazy mode right now.",
  "lazy.dialogue.goaway/4": "Seriously, go pester someone else with your nonsense.",
  "lazy.dialogue.goaway/5": "Begone, you mere mortal! I have no time for your presence.",

  "lazy.dialogue.greet/1": "Hey... How's it going?",
  "lazy.dialogue.greet/2": "Yo, %1$s. How's life treating you?",
  "lazy.dialogue.greet/3": "Ugh, hello. What do you want?",
  "lazy.dialogue.greet/4": "You look like you've got energy to spare. How's your day going?",
  "lazy.dialogue.greet/5": "Hey there, %1$s! Look who decided to show up!",
  "lazy.dialogue.greet/6": "Hey... or whatever...",
  "lazy.dialogue.greet/7": "Oh, it's you again. What's up?",
  "lazy.dialogue.greet/8": "Greetings! I suppose it's nice to see you. How's your day been?",
  "lazy.dialogue.greet/9": "Hey, I guess. Nice to see your face, I suppose.",

  "lazy.dialogue.greet.negative/1": "Ugh, seriously? Can't you just disappear already?",
  "lazy.dialogue.greet.negative/2": "Oh joy, it's you. What a delightful surprise.",
  "lazy.dialogue.greet.negative/3": "Meh.",
  "lazy.dialogue.greet.negative/4": "Oh, it's you. How thrilling. *yawns*",
  "lazy.dialogue.greet.negative/5": "Back for another round of irritating me, huh? Lucky me.",

  "lazy.dialogue.greet.success/1": "Meh, that's alright I guess.",
  "lazy.dialogue.greet.success/2": "Doing good? Whatever.",
  "lazy.dialogue.greet.success/3": "Yeah, yeah, happy to hear it.",
  "lazy.dialogue.greet.success/4": "Sooo glad to hear that... not.",
  "lazy.dialogue.greet.success/5": "Oh wow, good to know it, I guess.",
  "lazy.dialogue.greet.fail/1": "Meh.",
  "lazy.dialogue.greet.fail/2": "Not gonna lie, I couldn't care less...",
  "lazy.dialogue.greet.fail/3": "Whatever floats your boat, I guess...",
  "lazy.dialogue.greet.fail/4": "Seriously? Well, well, well...",
  "lazy.dialogue.greet.fail/5": "Oh well, doesn't make a difference to me...",

  "lazy.dialogue.apologize.success/1": "Whatever, mistakes happen all the time.",
  "lazy.dialogue.apologize.success/2": "Meh, it's cool. Just try not to mess up again.",
  "lazy.dialogue.apologize.success/3": "Oh well, no biggie. Just make sure you're more careful next time.",
  "lazy.dialogue.apologize.success/4": "Don't worry about it, happens to the best of us.",
  "lazy.dialogue.apologize.success/5": "Yup, no sweat. Just don't make a habit out of it.",
  "lazy.dialogue.apologize.fail/1": "Can you like, go bother someone else, please?",
  "lazy.dialogue.apologize.fail/2": "Seriously? You totally did that on purpose, didn't you?",
  "lazy.dialogue.apologize.fail/3": "Uh, nice try, but I'm not buying into your lame excuses.",
  "lazy.dialogue.apologize.fail/4": "Ouch! Don't even bother apologizing, it won't make a difference!",
  "lazy.dialogue.apologize.fail/5": "Haha, nice attempt, but that's a hard pass from me.",

  "lazy.dialogue.location.failed/1": "Ugh, didn't catch a word of anything exciting, if I'm being honest.",
  "lazy.dialogue.location.failed/2": "Nah, nothing really worth mentioning, sorry. My lazy self doesn't pay much attention to interesting places.",
  "lazy.dialogue.location.failed/3": "Nope, not a chance. Searching for dangerous ruins? Yeah, I'll pass. I've got more important things to not do.",
  "lazy.dialogue.location.forgot/1": "Ah, shoot! I stumbled upon this amazing spot, but I totally blanked on marking it. My bad, sorry!",
  "lazy.dialogue.location.forgot/2": "So, umm, you're on the hunt for something cool, right? Well, funny story, I had come across this real gem...and then *poof* it vanished from my memory. Can you believe it? Sorry about that.",
  "lazy.dialogue.location.forgot/3": "Oh, man! I had something in mind, I swear! But then my brain decided to take a little nap and now I can't recall a thing. My apologies, buddy.",
  "lazy.dialogue.location.igloo/1": "Ugh, stumbled upon an igloo at %2$s. Seriously, who in their right mind would build a house out of snow? It's freezing!",
  "lazy.dialogue.location.igloo/2": "So, guess what? I happened to come across this abandoned igloo at %2$s. And let me tell you, it looks like nobody has stepped foot in there for ages. I bet it's infested with ghosts or something. Gives me the creeps just thinking about it.",
  "lazy.dialogue.location.igloo/3": "Oh, boy, you won't believe what I found at %2$s. An old, forsaken ice house they call an igloo. It's been deserted for ages, I tell ya. Can't blame anyone for not wanting to live in that freezing hole.",
  "lazy.dialogue.location.pyramid/1": "Oh, yeah, there's this pyramid thingy at %2$s. Lazy old me hasn't bothered to check it out, though.",
  "lazy.dialogue.location.pyramid/2": "So, word on the street is that there's this pyramid thingy at %2$s. Supposedly, there might be some cool treasures or whatever. But, like, I wouldn't know for sure.",
  "lazy.dialogue.location.pyramid/3": "Ugh, there's this pyramid junk at %2$s. Some wannabe adventurer went in ages ago and never came back. It's probably just filled with sand and disappointment. Don't say I didn't warn you.",
  "lazy.dialogue.location.ruined_portal_desert/1": "Ugh, you won't believe it, but there's this totally wrecked portal over at %2$s. It's smack dab in the middle of the scorching desert. Can you imagine? So not worth my time!",
  "lazy.dialogue.location.ruined_portal_swamp/1": "Can you believe it? There's this totally ruined portal over at %2$s, right smack in the middle of the swamp. Who would've thought those Nether invaders would end up in this miserable dump? So lazy of them!",
  "lazy.dialogue.location.ruined_portal/1": "Ugh, you won't believe it, but there's this ruined portal at %2$s. It's a total disaster, thanks to those Nether invaders.",
  "lazy.dialogue.location.ruined_portal/2": "Oh, yeah, if you're up for it, you can check out %2$s. There's this super creepy ruined nether portal there. It's like the aftermath of a horror movie or something. But hey, it's probably safe... I think. Just watch out for the magma, unless you enjoy burns.",
  "lazy.dialogue.location.ruined_portal/3": "So, I heard there's this place called %2$s. Apparently, it used to be a nether portal, but now it's just ancient ruins. The local cleric claims there might be some treasure hidden there, but seriously, no one even wants to go near that cursed spot. Can't blame them, though. Who knows what kind of trouble you'll find there?",
  "lazy.dialogue.location.ruined_portal_mountain/1": "Check it out, there's a total wreck of a portal over at %2$s in the mountains. But seriously, I couldn't care less about dealing with it. Too much effort, ya know?",
  "lazy.dialogue.location.mansion/1": "Ugh, if you drag yourself to %2$s, you might stumble upon a stupid mansion. It's infested with those illagers, like, ew. Seriously, stay away from that cursed dump if you know what's good for you.",
  "lazy.dialogue.location.mansion/2": "So, there's this totally massive mansion at %2$s, right? And guess what? The illagers are the proud owners. I mean, who needs that kind of trouble, right? I'm seriously considering packing up and moving the entire village to the other side of the world. Just saying.",
  "lazy.dialogue.location.monument/1": "Ah, so there's this sunken castle thingy at %2$s. Supposedly, there are some real nasty sea monsters hanging around, so I'd advise you to steer way clear of that mess.",
  "lazy.dialogue.location.monument/2": "Heard some chatter about these ancient ruins in the deep ocean at %2$s. If you're feeling adventurous and willing to put your life on the line, you might stumble upon some hidden treasures. Just a fair warning though, danger is lurking at every corner. Ain't no walk in the park, my friend.",
  "lazy.dialogue.location.shipwreck/1": "Oh, hey there. Just stumbled upon a sunken ship at %2$s. Turns out, these ships were owned by the Eastern Alliance Company. Lazy me, just casually finding treasure like it's no big deal.",
  "lazy.dialogue.location.shipwreck/2": "Guess what? Some lazy fishermen found a shipwreck over at %2$s. I can't help but wonder if there's some hidden treasure waiting to be discovered. I mean, I wouldn't mind stumbling upon it while doing absolutely nothing.",
  "lazy.dialogue.location.shipwreck_beached/1": "Ugh, stumbled upon some shipwreck at %2$s, just lying there on the beach. Can't be bothered to investigate.",
  "lazy.dialogue.location.shipwreck_beached/2": "Oh, %2$s! There's this ship just stranded on the shore. Like, seriously, how did it even manage to get there? Not that I care enough to find out.",
  "lazy.dialogue.location.village_desert/1": "Ah, you'll find another village over there, right in the middle of that scorching desert. It's quite lovely, if you don't mind me saying, but I must admit, the whole desert heat makes me feel a little lazy. Can't blame me though, can you?",
  "lazy.dialogue.location.village_taiga/1": "Ah, there's this village over yonder in the taiga biome. It's quite lovely, but I wouldn't go there if I were you. Too much effort, you know?",
  "lazy.dialogue.location.village_taiga/2": "Meandering through the taiga biome, you might stumble upon yet another village. It's hidden away, deep in the woods. Not worth the hassle, if you ask me.",
  "lazy.dialogue.location.village_snowy/1": "Oh man, there's this other village over at %2$s. It's like, freezing cold all the time. Brrr!",
  "lazy.dialogue.location.village_snowy/2": "Yo, check it out, there's this village at %2$s in the snowy plains. The people are chill and all, but dang, it's like an icebox over there! Can't handle that cold!",
  "lazy.dialogue.location.village_plains/1": "Oh, there's another village over there at %2$s. It's pretty nice, I guess.",
  "lazy.dialogue.location.village_plains/2": "If you venture into the plain at %2$s, you might stumble upon yet another village. It's nothing special, really.",
  "lazy.dialogue.location.village_savanna/1": "Ugh, there's another village at %2$s, but it's scorching hot over there. I can barely muster the energy to visit.",
  "lazy.dialogue.location.village_savanna/2": "Oh, you're talking about that village in the savanna at %2$s? Yeah, they're nice folks, I guess. But honestly, I'd rather take a nap than go see them.",
  "lazy.dialogue.location.swamp_hut/1": "You might want to stay away from that swamp over there at %2$s. It's got this wicked witch's hut, and let me tell you, it's nothing but trouble.",
  "lazy.dialogue.location.swamp_hut/2": "Hey, just a friendly tip, but you should steer clear of %2$s. There's this creepy witch who lives in a hut around those parts, and believe me, you don't want to get tangled up in that mess.",
  "lazy.dialogue.location.mineshaft/1": "Ugh, yeah. There used to be a mine around here, but it got shut down because of some dumb accident. It's probably still lurking somewhere near %2$s.",
  "lazy.dialogue.location.mineshaft/2": "Ah, yes. We had a mine here once, like ages ago. It's over at %2$s, but honestly, it's a total disaster now. Infested with creepy creatures and all that. Don't say I didn't warn you if you decide to explore it.",
  "lazy.dialogue.location.jungle_pyramid/1": "Hey, so there's this super old temple at %2$s in the jungle. You might wanna steer clear, 'cause those traps are no joke. Seriously, they'll turn you into a pancake if you're not careful.",
  "lazy.dialogue.location.jungle_pyramid/2": "You know, if you happen to stumble upon %2$s in the jungle, there's this ancient ruin there. I'm not saying you should, but watch your step. Those old booby traps still work like a charm. It's a wonder our ancestors didn't snatch all the treasures ages ago. They must've had more energy or something.",
  "lazy.dialogue.location.pillager_outpost/1": "Ugh, so there's this group of lazy pillagers camping out at %2$s. Can you believe it? They just plopped their outpost right next to us. I don't even want to think about another attack. Too much effort to deal with, you know?",
  "lazy.dialogue.location.pillager_outpost/2": "Oh great, there's this outpost owned by those lazy pillagers at %2$s. Like seriously, can't they find somewhere else to haunt? It's a nightmare trying to get any sleep with those troublemakers lurking around. And trust me, they won't hesitate to shoot you if you get too close. Talk about lazy aggression.",
  "lazy.dialogue.location.pillager_outpost/3": "You won't believe it, but there's this outpost infested with those lazy pillagers at %2$s. It's like they're allergic to doing any real work. If you're up for it, you could try taking them down and maybe find some decent loot. The whole village would be forever grateful if someone bothered to get rid of those slackers.",
  "lazy.dialogue.location.ancient_city/0": "Eh, so like, I guess there were these strange sounds or whatever coming from down below at %2$s. Like, totally weird, man.",
  "lazy.dialogue.location.ancient_city/1": "Dude, I've got this feeling that there's some crazy hidden stuff way deep in the ground at %2$s. Like, for real.",
  "lazy.dialogue.location.ancient_city/3": "You won't believe this, but there's this like, ancient city or something at %2$s. I mean, I didn't actually see it, but like, maybe it's all hidden underground or whatever.",

  "lazy.dialogue.joke.monster.success/1": "Hmph, that Skelly got what it deserved, I guess.",
  "lazy.dialogue.joke.monster.success/2": "Wait, you're saying a zombie tried attacking you with a shovel? Heh, typical.",
  "lazy.dialogue.joke.monster.success/3": "So, you think you're some kind of spider expert now? Pfft, whatever.",
  "lazy.dialogue.joke.monster.success/4": "Wow, you managed to manipulate a skeleton into blowing up a creeper? Impressive, I guess. *yawn*",
  "lazy.dialogue.joke.monster.success/5": "Oh look, another hilarious story about how clueless cave spiders are. How riveting.",
  "lazy.dialogue.joke.monster.failed/1": "Sentient skeletons? Yeah, right. Like I have the energy to believe that nonsense.",
  "lazy.dialogue.joke.monster.failed/2": "Creepers blowing up? Hilarious... Not. I'll be over here, napping, while you come up with better jokes.",
  "lazy.dialogue.joke.monster.failed/3": "Zombies and skeletons were humans? Yawn. Wake me up when you've got something actually interesting to say.",
  "lazy.dialogue.joke.monster.failed/4": "An enderman in water? Groundbreaking. I'm too lazy to even pretend to be impressed.",
  "lazy.dialogue.joke.monster.failed/5": "Silverfish on the toilet? Riveting. I'll be snoring in my bed while you keep recycling mediocre jokes.",

  "lazy.dialogue.joke.animal.success/1": "Oh, what a bummer for the sheep to lose its precious wool. Haha, well, it's all in good fun!",
  "lazy.dialogue.joke.animal.success/2": "So there was this wolf, right? And guess what? The wolf fell head over heels in love with the sheep! Can you believe it? Pure comedy gold!",
  "lazy.dialogue.joke.animal.success/3": "I mean, come on! Chickens doing that? Absolutely ridiculous! Hahaha, gotta love the unexpected humor in our animal kingdom.",
  "lazy.dialogue.joke.animal.success/4": "Oh my, that's just plain silly! But you know what? I kind of adore the stupidity of it all. It's like a guilty pleasure for my lazy soul.",
  "lazy.dialogue.joke.animal.success/5": "Hey, did you know that cows have the superpower of producing infinite milk? Yeah, I know, it sounds too good to be true, but it's just one of those lazy miracles of nature, I guess! Haha!",
  "lazy.dialogue.joke.animal.failed/1": "Can you not make lame jokes about innocent creatures? It's just sad.",
  "lazy.dialogue.joke.animal.failed/2": "Wow, your sense of humor is as lazy as my pig's favorite spot in the mud.",
  "lazy.dialogue.joke.animal.failed/3": "Talking about failed animal jokes? Yup, that's about as exciting as watching a sleeping cow.",
  "lazy.dialogue.joke.animal.failed/4": "Oh great, another hilarious attempt at animal humor. Yawn.",
  "lazy.dialogue.joke.animal.failed/5": "Save your lame jokes for someone who cares. I'd rather listen to a snoring sheep.",

  "lazy.dialogue.flirt.slap/1": "Oh, bother!",
  "lazy.dialogue.flirt.slap/2": "Are you even trying to flirt? I've seen chickens with better game!",
  "lazy.dialogue.kiss.slap/1": "Seriously, dude? How dare you even think about it!",
  "lazy.dialogue.kiss.slap/2": "Give it another shot, and you'll feel the wrath of my laziness, which might take a while!",

  "lazy.dialogue.chat.plains/1": "Yeah, the plains are alright, I guess. I've never bothered exploring anywhere else. Maybe one day, but... eh.",
  "lazy.dialogue.chat.plains/2": "The plains, man, they're so chill. Not as wild and crazy as those other biomes, but you know what? I'm cool with that. I wouldn't trade it for anything.",
  "lazy.dialogue.chat.plains/3": "Nighttime in the plains can be pretty rad, you know? Just sprawl out and soak in the beauty. Well, if I can manage to get off my lazy bum, that is.",
  "lazy.dialogue.chat.plains/4": "Ah, lazy evenings like this make me wanna just plop down and gaze at the sky and clouds. Don't really feel like doing anything else, to be honest.",
  "lazy.dialogue.chat.plains/5": "The air here in the plains? Yeah, it's nice. Real nice. Might even be better than the taiga, if you ask me. But who's asking, right?",
  "lazy.dialogue.chat.plains/6": "I mean, sure, the plains might seem plain and all, but sometimes simple is where it's at, you know? Keep it easy, keep it lazy.",
  "lazy.dialogue.chat.plains/7": "Huh, this weather takes me back to when I was a kid. I used to pick wild flowers all the time. Not gonna lie, I had a little crush on Ash, so I'd always give 'em to her. Ah, good times.",
  "lazy.dialogue.chat.plains/8": "You ever catch the morning sunrise in the plains? It's, like, totally epic. You should totally drag yourself out of bed and witness it sometime. But, uh, no pressure or anything.",
  "lazy.dialogue.chat.savanna/1": "Ugh, it's scorching hot in this savanna! But hey, at least we never have to deal with the dreaded winter cold.",
  "lazy.dialogue.chat.savanna/2": "Those llamas can be such a hassle, but I guess I've learned to tolerate them. It's just part of the lazy savanna life.",
  "lazy.dialogue.chat.savanna/3": "The architecture here in the savanna is pretty cool, I guess. It's unique and stuff, but honestly, I'm too lazy to appreciate it fully.",
  "lazy.dialogue.chat.savanna/4": "Don't underestimate this plain and generic savanna biome, man. It may not seem like much, but it's got its lazy perks, you know?",
  "lazy.dialogue.chat.savanna/5": "Unlike those desert villages, we don't have to worry about rain here. Lazy bonus",
  "lazy.dialogue.chat.savanna/6": "The hills and terrains around here are kinda interesting, I guess. If you're into that sort of thing. Personally, I'd rather just lounge around.",
  "lazy.dialogue.chat.savanna/7": "Thank goodness for the acacia trees in this scorching heat. They provide some much-needed shade for my lazy self to survive the work days.",
  "lazy.dialogue.chat.savanna/8": "Savanna villages are known for having the juiciest melons and the plumpest pumpkins in the world. Lazy tip",
  "lazy.dialogue.chat.taiga/1": "The woods are alright, I guess. They're good for gathering stuff and all, but honestly, I'd rather just chill and do nothing.",
  "lazy.dialogue.chat.taiga/2": "Yeah, it's cold here in the taiga biome. I mean, I don't really mind it 'cause I'm too lazy to go anywhere else anyways. It's all good.",
  "lazy.dialogue.chat.taiga/3": "Taiga forests, huh? They're alright, I guess. I mean, the berries are sweet and all, but they're not gonna magically make me less lazy, you know?",
  "lazy.dialogue.chat.taiga/4": "Foxes in the taiga forests? Yeah, they're kinda cute, I guess. Sometimes I give 'em berries, but only if I can reach 'em without moving too much.",
  "lazy.dialogue.chat.taiga/5": "Wolves? Yeah, they're pretty chill. I mean, they don't bother me as long as I don't bother them. It's a lazy truce we got going on.",
  "lazy.dialogue.chat.taiga/6": "The air in the taiga? Yeah, it's crisp, I guess. Sometimes it's nice to just sit around and breathe it in. But like, not too much effort, you know?",
  "lazy.dialogue.chat.taiga/7": "Those sweet berry bushes? They're cool and all, but getting pricked? Ugh, the worst. Guess I'll just stick to the easy ones that are within arm's reach.",
  "lazy.dialogue.chat.taiga/8": "Rain in the taiga? Yeah, it's cold and all, but it's whatever. I mean, I'm too lazy to go out and do anything, so might as well enjoy the peace and quiet.",
  "lazy.dialogue.chat.snowy_plains/1": "Ugh, it's so cold here. I wish someone would bring me a blanket and a hot drink.",
  "lazy.dialogue.chat.snowy_plains/2": "Can you believe how freezing it is? I can't feel my fingers anymore. Good thing I stocked up on hot chocolate!",
  "lazy.dialogue.chat.snowy_plains/3": "This weather is perfect for doing absolutely nothing. I'm just gonna curl up in bed and binge-watch my favorite shows.",
  "lazy.dialogue.chat.snowy_plains/4": "Snow? Ugh, reminds me of the good old days when I actually had energy to go outside and play. Now I just want to hibernate.",
  "lazy.dialogue.chat.snowy_plains/5": "Those strays are such a pain. I mean, can't they find somewhere else to wander? I don't have time for their arrow nonsense.",
  "lazy.dialogue.chat.snowy_plains/6": "Wolves? Great. Just what I needed, more things to worry about. Can someone else deal with them, please?",
  "lazy.dialogue.chat.snowy_plains/7": "Iron golems? Don't even get me started. They're like walking statues with no sense of personal space. I avoid them at all costs.",
  "lazy.dialogue.chat.snowy_plains/8": "Ah, the nostalgia of snow golems. I used to build them too, but now I'd rather just stay warm inside and eat pumpkin pie without the effort.",
  "lazy.dialogue.chat.desert/1": "Ugh, this scorching desert! But hey, at least we never have to deal with freezing winters like those poor souls in other places.",
  "lazy.dialogue.chat.desert/2": "The desert, man. Always warm, always sunny.",
  "lazy.dialogue.chat.desert/3": "Man, this desert heat! I'm either tanned or burnt to a crisp, there's no in-between.",
  "lazy.dialogue.chat.desert/4": "Ah, the desert night sky. It's pretty mesmerizing, I gotta admit. And a tad cooler, thank goodness.",
  "lazy.dialogue.chat.desert/5": "Ugh, seriously? This sun is relentless today. Can't catch a break!",
  "lazy.dialogue.chat.desert/6": "Seriously, this sun is just unbearable today!",
  "lazy.dialogue.chat.desert/7": "Any luck finding rabbits in this desert wasteland? They're like invisible ninjas around here!",
  "lazy.dialogue.chat.desert/8": "You know what stinks about living in this desert? Those husks always leave me starving! It's like they have a personal vendetta or something!",
  "lazy.dialogue.chat.desert/9": "Ouch! Stepped on a cactus the other day. Gotta watch my every step in this prickly paradise.",
  "lazy.dialogue.chat.desert/10": "Life in this bone-dry desert isn't a walk in the park, that's for sure. But hey, at least we have this village to scrounge up some water and grub.",

  "lazy.dialogue.story.exploring.success/1": "Meh, maybe one day I'll bother to explore the world or whatever.",
  "lazy.dialogue.story.exploring.success/2": "Ugh, I guess it'd be kinda cool to travel and explore. I mean, I love my village and all, but your stories make me feel a bit envious, I guess.",
  "lazy.dialogue.story.exploring.success/3": "Seriously, who has the energy to be brave and venture into the unknown? Not me, that's for sure.",
  "lazy.dialogue.story.exploring.fail/1": "Your tales are so tiresome.",
  "lazy.dialogue.story.exploring.fail/2": "Oh, spare me the effort of hearing your worn-out anecdotes, won't you?",
  "lazy.dialogue.story.exploring.fail/3": "Interacting with you is like dealing with a sloth trying to be a rocket scientist. Minus the cuteness, of course.",

  "lazy.dialogue.story.nether.success/1": "Ugh, is it, like, super hot in that place or something? I can't even deal with heatwaves, let alone the Nether!",
  "lazy.dialogue.story.nether.success/2": "Seriously, how on earth did you survive in that crazy dangerous Nether? I mean, I can barely survive a day without my comfy bed and snacks.",
  "lazy.dialogue.story.nether.success/3": "So, I've heard rumors about tons of treasure in that Nether thing. But, like, I'm way too lazy to even consider stepping foot in there. No treasure is worth that effort, man.",
  "lazy.dialogue.story.nether.success/4": "Whoa, you must be, like, the bravest soul ever to venture into the Nether. Me? Oh, no way, I'm way too chicken-hearted for that. Definitely not scared, just...lazy, you know?",
  "lazy.dialogue.story.nether.success/5": "Dude, have you ever seen one of those Zombified Piglins? I heard they're, like, totally gnarly. But honestly, I'm too lazy to even bother checking them out. Plus, they sound kinda gross.",
  "lazy.dialogue.story.nether.fail/1": "I doubt you've ever bothered going to the Nether, man.",
  "lazy.dialogue.story.nether.fail/2": "Ugh, no wonder those Piglins went all berserk on you. Can't blame 'em.",
  "lazy.dialogue.story.nether.fail/3": "Honestly, I couldn't care less if you've been to the Nether. Your storytelling skills are as dull as dirt.",
  "lazy.dialogue.story.nether.fail/4": "Seriously, look at you! You couldn't even lift a feather, let alone survive in the Nether.",
  "lazy.dialogue.story.nether.fail/5": "My old man was a legendary Nether explorer, and he never mentioned anything about warped fungus. Nice try, fibber!",

  "lazy.dialogue.story.enderdragon.success/1": "Wow, you actually managed to bring the dragon egg back? That's pretty cool, I guess.",
  "lazy.dialogue.story.enderdragon.success/2": "Huh, so you're telling me you took down that big ol' dragon? Well, I guess the village will talk about it for, like, a little while.",
  "lazy.dialogue.story.enderdragon.fail/1": "Pfft! Are you for real? The ender dragon? Yeah, good luck finding that imaginary creature.",
  "lazy.dialogue.story.enderdragon.fail/2": "Seriously? You think a mere mortal could stand a chance against the almighty ender dragon? Dream on, buddy.",

  "lazy.dialogue.story.wither.success/1": "No way! The Wither goes around causing total chaos, I've heard!",
  "lazy.dialogue.story.wither.success/2": "You actually managed to defeat the Wither?! Seriously, that's mind-blowing!",
  "lazy.dialogue.story.wither.fail/1": "Honestly, I can't be bothered to believe you.",
  "lazy.dialogue.story.wither.fail/2": "Does it even matter? You seem way too intact to convince me otherwise.",

  "lazy.dialogue.stay.fail/1": "Nah, not really feeling the whole staying in one place thing. I'm more of a \"let's see what's out there\" kind of person.",
  "lazy.dialogue.stay.fail/2": "Thanks for the offer, but I have a serious case of wanderlust. I'd rather roam the world and discover new horizons!",
  "lazy.dialogue.stay.fail/3": "This village is cool and all, but I'm more of a thrill-seeker. The open road is calling my name, you know?",
  "lazy.dialogue.stay.repeat/1": "Dude, I just told you that, like, two minutes ago. Can you try to keep up?",
  "lazy.dialogue.stay.repeat/2": "Seriously? You seriously forgot that you already asked me? Wow, just wow.",
  "lazy.dialogue.stay.success/1": "Yeah, whatever, I guess I could stick around this village if I have to.",
  "lazy.dialogue.stay.success/2": "Meh, I suppose I could tolerate staying in this village for a while.",
  "lazy.dialogue.stay.no_space/1": "Ugh, this village is like, way too packed.",
  "lazy.dialogue.stay.no_space/2": "I mean, I could totally stay, but there's, like, zero beds left.",

  "lazy.dialogue.hire/1": "Ugh, fine. Just give me a heads up when you want some assistance. I'll be around, reluctantly.",
  "lazy.dialogue.hire/2": "Meh, whatever. Give me a shout when you want me. I'll be here, begrudgingly waiting for those shiny emeralds.",
  "lazy.dialogue.hire/3": "Oh, joy. I guess I'll be at your service then. Don't keep me waiting too long for those precious emeralds, though.",
  "lazy.dialogue.no_money/1": "Sorry, but I won't lift a finger without a few more emeralds in my pocket.",
  "lazy.dialogue.no_money/2": "Seriously? I don't come cheap, buddy. You better cough up some more emeralds.",
  "lazy.dialogue.no_money/3": "Look, I may be available for hire, but I won't budge an inch until I see a lot more emeralds in your hand.",

  "lazy.dialogue.main.rock_paper_scissor/1": "I'm ready to play Rock Paper Scissors!",
  "lazy.dialogue.rock_paper_scissor/1": "Ugh, rock, paper, scissors, whatever.",
  "lazy.dialogue.rock_paper_scissor/2": "Meh, I might win this time, who knows?",
  "lazy.dialogue.rock_paper_scissor.rock/1": "Nah, rock, I guess...",
  "lazy.dialogue.rock_paper_scissor.paper/1": "*Yawn* Paper, I guess. Can we finish this game already? I have a nap schedule to follow.",
  "lazy.dialogue.rock_paper_scissor.scissor/1": "Scissor, but only because I can't be bothered to think of anything else.",
  "lazy.dialogue.rock_paper_scissor.loose.rock/1": "Ugh, fine, I guess I'll go with rock. And surprise, surprise, I lose again!",
  "lazy.dialogue.rock_paper_scissor.loose.paper/1": "Why bother choosing anything else? Scissors it is, lazily.",
  "lazy.dialogue.rock_paper_scissor.loose.scissor/1": "Ugh, scissors? Seriously? Rock just crushed you, I totally win!",
  "lazy.dialogue.rock_paper_scissor.win.rock/1": "Rock always wins, huh? I should have known better.",
  "lazy.dialogue.rock_paper_scissor.win.paper/1": "Rock is definitely not my go-to move, it never gets me a victory.",
  "lazy.dialogue.rock_paper_scissor.win.scissor/1": "Lazy me, I lost to scissors. I should have just stayed in bed.",
  "_": ""
}
