{
  "stubborn.dialogue.main/1": "Oh, it's you again. What do you want?",
  "stubborn.dialogue.main/2": "Can't you see I'm busy? Why bother me?",
  "stubborn.dialogue.main/3": "Oh great, it's you. What do you want now?",
  "stubborn.dialogue.main/4": "Spare me the small talk, get to the point.",
  "stubborn.dialogue.main/5": "How am I today? None of your business.",
  "stubborn.dialogue.main/6": "Oh, look who it is. What do you want, %1$s?",
  "stubborn.dialogue.main/7": "So %supporter% thinks they can fool me with their zombie stories, huh? Well, I saw a zombie that looked just like %supporter% today, and it was as clueless as they are.",

  "stubborn.dialogue.rumors.failed/1": "Hmm, I ain't got no time for rumors.",
  "stubborn.dialogue.rumors.lore/1": "Despite what some people say, Jax's followers can't deny that the worship of Sirben is on the rise. I mean, even his prophets MerlinWolfGames and Crow are going all out to spread his words.",
  "stubborn.dialogue.rumors.lore/2": "Oh, don't even get me started on those Cyberdemons. Yeah, they tried to invade us, but thanks to Sirben and Luke, they were shut down real quick. No invasion happening on our watch!",
  "stubborn.dialogue.rumors.lore/3": "So, here's the scoop. Remember that Ancient Builder who vanished? Well, rumor has it that 2DA50 went off to the Far Lands and just vanished into thin air. Poof! Gone forever.",
  "stubborn.dialogue.rumors.lore/4": "You won't believe what MerlinWolfGames did. That guy went ahead and built this massive temple dedicated solely to Sirben. Talk about dedication, huh? It's become one of the legendary wonders of our time.",
  "stubborn.dialogue.rumors.lore/5": "Ah, those ancient builders. They were something else, let me tell you. But now, they're just a memory. Gone, vanished, history. Shame, really. They had skills that we can only dream of.",
  "stubborn.dialogue.rumors.lore/6": "Let me tell ya, my friend, those legends of the ancient builders? They're the real deal. I mean, just look at all those ruins and temples scattered across the Overworld. It's like they were trying to leave their mark, you know?",

  "stubborn.dialogue.first.generic/1": "I can't believe I'm seeing someone new in this dull village. What brings you here, traveler?",
  "stubborn.dialogue.first.generic/2": "Oh great, another newcomer. Just what we needed. What's your deal?",
  "stubborn.dialogue.first.generic/3": "Well, well, well, look who decided to grace us with their presence. What's your story, stranger?",
  "stubborn.dialogue.first.generic/4": "A stranger, huh? Don't expect a warm welcome from me. What brings you to our village?",
  "stubborn.dialogue.first.generic/5": "It's been ages since we've had the pleasure of meeting a traveler. Don't get too comfortable though, we've got our eyes on you.",
  "stubborn.dialogue.first.generic/6": "Another face to add to the collection. Welcome to our village, I guess. Don't cause any trouble.",

  "stubborn.dialogue.first.question/1": "Hmph, what do you want, traveler? Why have you invaded our village?",
  "stubborn.dialogue.first.question/2": "About time someone new showed up! So, what's your deal? What made you stumble upon our humble village?",
  "stubborn.dialogue.first.question/3": "Oh, please, spare me the details. You think you're some kind of hotshot adventurer, don't you? How on earth did you manage to find your way here?",
  "stubborn.dialogue.first.exploring/1": "We don't have much here, and I don't want any trouble, so behave yourself.",
  "stubborn.dialogue.first.exploring/2": "Listen up, stranger. This place might not have much, but that doesn't mean you can do whatever you want. Follow the rules, or else.",
  "stubborn.dialogue.first.exploring/3": "I don't care who you are, but if you want to stick around, you better show some respect and follow the rules. Got it?",
  "stubborn.dialogue.first.settling/1": "It's not terrible to see another face in the village, I guess.",
  "stubborn.dialogue.first.settling/2": "Yeah, yeah, welcome to the village, neighbor. Don't get too comfortable though.",
  "stubborn.dialogue.first.settling/3": "I guess we can tolerate another helping hand around here, I suppose.",
  "stubborn.dialogue.first.settling/4": "You actually decided to stay? Well, don't expect any special treatment.",
  "stubborn.dialogue.first.spent_night.success/1": "Why waste your time looking elsewhere? Our inn is the only sensible choice.",
  "stubborn.dialogue.first.spent_night.success/2": "Don't bother with those other establishments. Our inn reigns supreme when it comes to rejuvenation.",
  "stubborn.dialogue.first.spent_night.success/3": "If you want to experience true comfort and indulge in delectable dishes, there's no better option than our esteemed inn.",
  "stubborn.dialogue.first.spent_night.failed/1": "Look, I'll be straight with you. We don't have an inn. And honestly, I doubt we could even manage to build one if we tried.",
  "stubborn.dialogue.first.spent_night.failed/2": "Listen up, I'm not gonna sugarcoat it for you. We don't have an inn around here, and there's no use crying over spilled milk.",
  "stubborn.dialogue.first.spent_night.failed/3": "Well, well, well, if it isn't Mr./Ms. Adventurer. Hate to break it to you, but you won't find an inn in this village. Maybe you should try your luck elsewhere, huh?",

  "stubborn.dialogue.hug.success/1": "Finally, you showed up after ages!",
  "stubborn.dialogue.hug.success/2": "Fine, fine, I guess that hug was somewhat helpful. But don't get used to it.",
  "stubborn.dialogue.hug.success/3": "Well, it seems like you did something right for once. Just one thing though.",
  "stubborn.dialogue.hug.success/4": "Don't think this means I like you or anything, but you're not completely terrible to hug, I suppose.",
  "stubborn.dialogue.hug.success/5": "Oh, great, now I have to return the favor. Don't get any ideas though, this doesn't mean we're friends.",
  "stubborn.dialogue.hug.success/6": "Ugh, your body temperature is way too high. Can't you cool down a bit?",
  "stubborn.dialogue.hug.fail/1": "Ugh, can't you see how filthy you are? Covered in dirt and grime!",
  "stubborn.dialogue.hug.fail/2": "Absolutely not, count me out.",
  "stubborn.dialogue.hug.fail/3": "Seriously, what's your problem?",
  "stubborn.dialogue.hug.fail/4": "As if I would ever hug you! Remember when you insulted me by calling me a neanderthal? No way!",
  "stubborn.dialogue.hug.fail/5": "Honestly, you're not even worth a hug for the way you treated me.",
  "stubborn.dialogue.hug.fail/6": "Gross! Get away from me! Your germs are absolutely repulsive!",
  "stubborn.dialogue.hug.fail/7": "Oh, well, I suppose I can begrudgingly accept your strange gesture.",

  "stubborn.dialogue.kiss.success/1": "Ugh, I suppose this moment could last a bit longer.",
  "stubborn.dialogue.kiss.success/2": "I guess I might have some feelings for you...",
  "stubborn.dialogue.kiss.success/3": "Meh, it's alright. Tastes like pumpkin pie, I suppose.",
  "stubborn.dialogue.kiss.success/4": "Meh! You taste like honey or whatever.",
  "stubborn.dialogue.kiss.success/5": "Oh, well I suppose you're not a terrible kisser, %1$s.",
  "stubborn.dialogue.kiss.success/6": "%1$s, you kiss marginally better than Ash! *sarcastic giggles*",
  "stubborn.dialogue.kiss.fail/1": "I won't do it if there's even a hint of someone watching.",
  "stubborn.dialogue.kiss.fail/2": "Is that the best you can do? Pathetic.",
  "stubborn.dialogue.kiss.fail/3": "Ash's kisses put yours to shame, you feeble attempt at romance.",
  "stubborn.dialogue.kiss.fail/4": "Let me give you some advice",
  "stubborn.dialogue.kiss.fail/5": "Oh, how kind of you to grace me with that... whatever it was.",
  "stubborn.dialogue.kiss.fail/6": "Get your hands off me this instant! I won't tolerate your unwelcome advances.",

  "stubborn.dialogue.chat.success/1": "Ugh, cookies and milk? I guess they're alright, I suppose.",
  "stubborn.dialogue.chat.success/2": "Yeah, I guess the weather is decent. It could be better.",
  "stubborn.dialogue.chat.success/3": "Oh, boo-hoo, you stubbed your toe. Life's tough, get over it.",
  "stubborn.dialogue.chat.success/4": "An apple a day, blah blah blah. I doubt it does anything.",
  "stubborn.dialogue.chat.success/5": "Building my own village? Nah, too much effort. I'll just laze around.",
  "stubborn.dialogue.chat.success/6": "So what if I saw %Supporter% in Diamond armor? Doesn't impress me.",
  "stubborn.dialogue.chat.success/7": "%Supporter% and their stupid diamond chest. Who cares?",
  "stubborn.dialogue.chat.success/8": "Remarkable weather? Meh, it's mediocre at best.",
  "stubborn.dialogue.chat.success/9": "Spiders and goblins? Seriously, what's the big fuss? They're annoying, but not that scary.",
  "stubborn.dialogue.chat.success/10": "Oh, who cares about %Supporter%? They left ages ago, good riddance.",
  "stubborn.dialogue.chat.success/12": "Did you hear about %Supporter%? I bet it's some pointless gossip.",
  "stubborn.dialogue.chat.success/13": "Stray cats? No thanks, I have better things to do than babysit animals.",
  "stubborn.dialogue.chat.success/14": "Redecorate my house? Yeah, right. Too lazy to even lift a finger.",
  "stubborn.dialogue.chat.success/15": "Kids? Finding the right partner? That's a joke, right?",
  "stubborn.dialogue.chat.success/16": "Wonder where I'd be if I lived in the other village? Who cares? This place is just fine.",
  "stubborn.dialogue.chat.success/17": "Childhood memories? Yeah, whatever. They're in the past for a reason.",
  "stubborn.dialogue.chat.success/18": "Visiting my parents? They can come to me if they want to see me.",
  "stubborn.dialogue.chat.success/19": "Traveling to the other village? Nah, my friends can come here if they want to see me.",
  "stubborn.dialogue.chat.success/20": "Cheese? Sounds overrated. I'd rather have something else.",
  "stubborn.dialogue.chat.fail/1": "Can you believe the audacity of your statement?",
  "stubborn.dialogue.chat.fail/2": "I refuse to accept that it just spontaneously exploded.",
  "stubborn.dialogue.chat.fail/3": "You really think you're all that, huh?",
  "stubborn.dialogue.chat.fail/4": "Look at you, flaunting your skills like a peacock.",
  "stubborn.dialogue.chat.fail/5": "Ugh, your fashion sense is so outdated. Take a hike.",
  "stubborn.dialogue.chat.fail/6": "That's possibly the most nonsensical thing I've ever heard.",
  "stubborn.dialogue.chat.fail/7": "Seriously, why are you bothering me again?",
  "stubborn.dialogue.chat.fail/8": "Huh? Sorry, didn't bother to pay attention to your words.",
  "stubborn.dialogue.chat.fail/9": "Pardon me? I can't be bothered right now.",
  "stubborn.dialogue.chat.fail/10": "What's your deal? Why are you wasting breath on this topic?",
  "stubborn.dialogue.chat.fail/11": "I've heard some pretty unflattering things about you, and I can see why people say that.",
  "stubborn.dialogue.chat.fail/12": "Even the undead steer clear of conversing with you.",
  "stubborn.dialogue.chat.fail/13": "You're as repulsive as a witch, no offense.",
  "stubborn.dialogue.chat.fail/14": "Do me a favor and keep your distance or I'll summon the authorities.",
  "stubborn.dialogue.chat.fail/15": "Huh? Oh, sorry, I just dozed off from your mind-numbing conversation.",
  "stubborn.dialogue.chat.fail/16": "Are you finally done blabbering?",
  "stubborn.dialogue.chat.fail/17": "I wonder if anyone would shed a tear if you suddenly became mute forever.",
  "stubborn.dialogue.chat.fail/18": "I'd rather watch a pig's behind than engage in conversation with you.",
  "stubborn.dialogue.chat.fail/19": "Are you through wasting my time?",
  "stubborn.dialogue.chat.fail/20": "What? You actually believe the Earth is round? No corners? That's absurd!",

  "stubborn.dialogue.story.success/1": "Seriously? I absolutely refuse to believe any of that nonsense!",
  "stubborn.dialogue.story.success/2": "It's not like I'm scared or anything, but I simply lack the interest to confront a creeper.",
  "stubborn.dialogue.story.success/3": "Your story was decent, I suppose. Is it some sort of mediocre original work?",
  "stubborn.dialogue.story.success/4": "Are you seriously trying to convince me that all of that actually happened yesterday? Give me a break!",
  "stubborn.dialogue.story.success/5": "I happened to be in the vicinity yesterday, and it's beyond belief that I wasn't already aware of this information.",
  "stubborn.dialogue.story.success/6": "Hmph! So typical of %Supporter% to be involved in such a grand spectacle. How utterly awe-inspiring.",
  "stubborn.dialogue.story.success/7": "I've been subjected to the tiresome Legend of %Supporter% countless times. Spare me the agony and retell it once more!",
  "stubborn.dialogue.story.success/8": "Ah, so that's supposedly how you stumbled upon your first diamond? Color me unimpressed.",
  "stubborn.dialogue.story.success/9": "Don't even bother gracing me with your presence later. I have absolutely no interest in hearing more of your tales.",
  "stubborn.dialogue.story.fail/1": "Excuse me, but let me make this abundantly clear - that happens to be my dear mother you're disparaging.",
  "stubborn.dialogue.story.fail/2": "It's no wonder the entire village has a field day discussing your woeful existence.",
  "stubborn.dialogue.story.fail/3": "I'm sorry, but I'm finding it difficult to comprehend your feeble attempt at an explanation.",
  "stubborn.dialogue.story.fail/4": "Unbelievable! Have you no empathy? Even the gentlest Creeper has a heart!",
  "stubborn.dialogue.story.fail/5": "Tell me, just how could you stoop so low as to mercilessly slay an innocent sheep?",
  "stubborn.dialogue.story.fail/6": "*loud snoring* Huh? Oh, sorry, I must have drifted off during your dull tale.",
  "stubborn.dialogue.story.fail/7": "Pray tell, in what way was wasting my precious time deemed remotely worthwhile?",
  "stubborn.dialogue.story.fail/8": "Yawn! My dear, you have managed to surpass the boundaries of tedium.",
  "stubborn.dialogue.story.fail/9": "You, my friend, are certifiably insane, and not in a manner that garners admiration.",
  "stubborn.dialogue.story.fail/10": "Pardon me, but I fail to grasp the concept of how you could possibly consider that dismal attempt as anything remotely close to \"good\".",

  "stubborn.dialogue.flirt.success/1": "Ugh, don't flatter yourself.",
  "stubborn.dialogue.flirt.success/2": "Seriously? You think I care?",
  "stubborn.dialogue.flirt.success/3": "Oh please, spare me the theatrics.",
  "stubborn.dialogue.flirt.success/4": "That was mildly amusing, I guess.",
  "stubborn.dialogue.flirt.success/5": "I don't know how you do it, but it's not impressing me.",
  "stubborn.dialogue.flirt.success/6": "Ugh, enough with the compliments, it's getting old.",
  "stubborn.dialogue.flirt.fail/1": "If you think I'm impressed, think again.",
  "stubborn.dialogue.flirt.fail/2": "Ha, nice try. But I've seen better.",
  "stubborn.dialogue.flirt.fail/3": "Oh, please. I've heard that line a thousand times.",
  "stubborn.dialogue.flirt.fail/4": "Save your breath, you won't win me over with that nonsense.",
  "stubborn.dialogue.flirt.fail/5": "You really think that would work? Hilarious.",
  "stubborn.dialogue.flirt.fail/6": "Sorry, but I don't have time for such feeble attempts.",
  "stubborn.dialogue.flirt.fail/7": "Is that the best you've got? I'm not buying it.",

  "stubborn.dialogue.joke.creative.success/1": "*Rolls eyes* I guess that's supposed to be funny.",
  "stubborn.dialogue.joke.creative.success/2": "I suppose that's mildly amusing.",
  "stubborn.dialogue.joke.creative.success/3": "Well, I've heard worse jokes in my day.",
  "stubborn.dialogue.joke.creative.success/4": "You think you're funnier than %Supporter%, huh? That's a bold claim.",
  "stubborn.dialogue.joke.creative.success/5": "Hmph, you're trying to be funny? Stick to your day job, whatever that is.",
  "stubborn.dialogue.joke.creative.success/6": "At least you managed to make me crack a smile, I'll give you that.",
  "stubborn.dialogue.joke.creative.success/7": "Oh please, Ash's idea of humor is just sad. You're marginally better.",
  "stubborn.dialogue.joke.creative.success/8": "I guess I can see why some people would find that amusing. Just not me.",
  "stubborn.dialogue.joke.creative.failed/1": "I can't believe you actually tried to make a joke. Pathetic.",
  "stubborn.dialogue.joke.creative.failed/2": "Oh please, spare me your feeble attempts at humor.",
  "stubborn.dialogue.joke.creative.failed/3": "Is that supposed to be a joke? Because I'm not laughing.",
  "stubborn.dialogue.joke.creative.failed/4": "Wow, that was a real knee-slapper... Not.",
  "stubborn.dialogue.joke.creative.failed/5": "Nice try, but you won't be winning any comedy awards with that one.",
  "stubborn.dialogue.joke.creative.failed/6": "Hilarious. I've seen rocks with better comedic timing.",
  "stubborn.dialogue.joke.creative.failed/7": "Stick to mining, buddy. Comedy clearly isn't your forte.",
  "stubborn.dialogue.joke.creative.failed/8": "Ash's jokes are masterpieces compared to the drivel you just spouted.",

  "stubborn.dialogue.procreate_engaged/1": "I won't settle for anything less than a proper marriage before bringing a new life into this world.",
  "stubborn.dialogue.procreate_engaged/2": "It's out of the question to procreate without a solid commitment and a wedding ceremony.",

  "stubborn.dialogue.shake_hand.success/1": "You call that a grip? I've seen stronger handshakes from toddlers!",
  "stubborn.dialogue.shake_hand.success/2": "Your feeble grip is no match for my Herculean strength!",
  "stubborn.dialogue.shake_hand.success/3": "Politeness? Please, spare me the pleasantries!",
  "stubborn.dialogue.shake_hand.success/4": "Good day? More like a mediocre day at best.",
  "stubborn.dialogue.shake_hand.success/5": "Oh, great, another hello. How utterly thrilling.",
  "stubborn.dialogue.shake_hand.fail/1": "Are you kidding me? After you mercilessly butchered that poor cow?",
  "stubborn.dialogue.shake_hand.fail/2": "Nah, I think I'll pass.",
  "stubborn.dialogue.shake_hand.fail/3": "Save your politeness, I'm not some stranger you need to impress.",
  "stubborn.dialogue.shake_hand.fail/4": "Oh, wow, that's not your usual behavior, is it?",
  "stubborn.dialogue.shake_hand.fail/5": "Get lost, I don't want anything to do with you.",

  "stubborn.dialogue.main.morning/1": "Good morning, and don't you forget it!",
  "stubborn.dialogue.main.morning/2": "Mornin', ready to work today? Or are you going to slack off again?",
  "stubborn.dialogue.main.morning/3": "I'm still tired, you? But I bet you're even more exhausted.",
  "stubborn.dialogue.main.morning/5": "Looks like you had a rough night. Well, I had a rougher one!",
  "stubborn.dialogue.main.morning/6": "Rise and shine, buddy. It's going to be a long day. I hope you're up for it.",
  "stubborn.dialogue.main.morning/7": "Did you sleep well? You look chipper. Unlike me, who looks like a zombie.",
  "stubborn.dialogue.main.morning/8": "Morning sleepyhead! I bet you've been sleeping all day.",
  "stubborn.dialogue.main.morning/9": "What a beautiful morning! I think it's going to be a productive day today! For me, at least.",
  "stubborn.dialogue.main.morning/10": "I think I might take it slow today, I'm not feeling too well. Unlike you, always full of energy.",
  "stubborn.dialogue.main.morning/11": "I have a very packed schedule today, just thinking about it makes me tired. You wouldn't understand, you probably just wander around all day.",
  "stubborn.dialogue.main.morning/12": "I actually got a decent night's sleep, I might do something a bit heavier today, who knows? Unlike you, who always takes the easy way out.",
  "stubborn.dialogue.main.evening/1": "Good evening! Don't expect any miracles, though.",
  "stubborn.dialogue.main.evening/2": "Can't believe how fast it got late. So, spill the beans, how was your day?",
  "stubborn.dialogue.main.evening/3": "Another grueling day of work, as usual. Isn't life just grand?",
  "stubborn.dialogue.main.evening/4": "The day just flew by, didn't it? Too much work, not enough play.",
  "stubborn.dialogue.main.evening/5": "I should head home soon, got a whole dinner to conjure up.",
  "stubborn.dialogue.main.evening/6": "I pretty much wasted my entire day. Just another unproductive day in my life.",
  "stubborn.dialogue.main.evening/7": "Thinking of taking a nap soon, had a horrendous morning. Life's unfair, you know.",
  "stubborn.dialogue.main.evening/8": "Better go inside. Saw a creeper last month, no more nighttime strolls for me.",
  "stubborn.dialogue.main.evening/9": "Oh, look who it is! Just got done stocking up on dinner supplies. Catch you later, maybe.",
  "stubborn.dialogue.main.night/1": "*yawn* You're seriously still awake, huh? Do you ever sleep?",
  "stubborn.dialogue.main.night/2": "You must think you're some kind of superhero, staying up all night like that.",
  "stubborn.dialogue.main.night/3": "Oh, so you're one of those people who just can't resist the allure of the night, huh?",
  "stubborn.dialogue.main.night/4": "Look, I'm just saying, it's not the smartest idea to wander around in the dark. Especially with all those creepy creatures lurking about.",
  "stubborn.dialogue.main.night/5": "Yeah, the guards give you a false sense of security, but let's be real, the night is still pretty damn creepy.",
  "stubborn.dialogue.main.night/6": "Ugh, the silence of the night... it's just so unnerving. I don't know how you find it peaceful.",
  "stubborn.dialogue.main.night/7": "Daytime is for getting things done, you know? Why would anyone want to waste their time strolling around aimlessly at night?",
  "stubborn.dialogue.main.night/8": "Well, congratulations on exhausting yourself. Maybe now you'll actually learn to take it easy tomorrow.",
  "stubborn.dialogue.main.night/9": "I swear, some people have an unhealthy obsession with sleep. Just get under the covers and call it a night already.",
  "stubborn.dialogue.main.night/10": "You've got a lot on your plate tomorrow, so maybe you should actually listen to my advice for once and get some shut-eye.",

  "stubborn.dialogue.greet.mayor/1": "Well, well, if it isn't the mayor. What brings you here today?",
  "stubborn.dialogue.greet.mayor/2": "Ah, Mayor! Another day, another opportunity for you to make a mess of things. Take care now!",
  "stubborn.dialogue.greet.monarch/1": "Oh, so it's you, Your Majesty.",
  "stubborn.dialogue.greet.monarch/2": "Well, well, if it isn't Your Highness gracing us with their presence.",

  "stubborn.dialogue.busy/1": "Can't you see I'm knee-deep in work? I've got no time to entertain you.",
  "stubborn.dialogue.busy/2": "You're persistent, I'll give you that. But I've got deadlines to meet, so bye for now.",
  "stubborn.dialogue.busy/3": "Don't you understand the concept of being busy? Come back later when I have some free time.",
  "stubborn.dialogue.busy/4": "Look, I may be a villager, but I have responsibilities. Talk to me when I'm done with my tasks.",
  "stubborn.dialogue.busy/5": "Oops, almost forgot that I'm not here to chit-chat all day. Catch you on the flip side!",
  "stubborn.dialogue.goaway/1": "Nope, shoo!",
  "stubborn.dialogue.goaway/2": "Can't you find something more interesting to occupy your time?",
  "stubborn.dialogue.goaway/3": "Apologies, %1$s, but I'm unavailable for chit-chat at the moment.",
  "stubborn.dialogue.goaway/4": "Bug off and bother someone else!",
  "stubborn.dialogue.goaway/5": "Begone, you uncivilized peasant!",

  "stubborn.dialogue.greet": "Ugh, what do you want?",
  "stubborn.dialogue.greet/1": "Ugh, what do you want?",
  "stubborn.dialogue.greet/2": "Hey %1$s, what's your problem now?",
  "stubborn.dialogue.greet/3": "Oh, great, another interruption. What do you need?",
  "stubborn.dialogue.greet/4": "Can't you see I'm busy? How's it going, I guess.",
  "stubborn.dialogue.greet/5": "Oh, it's you again. What brings you here?",
  "stubborn.dialogue.greet/6": "What's up? Can't you see I'm busy?",
  "stubborn.dialogue.greet/7": "Nice to see you, I guess.",
  "stubborn.dialogue.greet/8": "Hello, it's just lovely to see you. What's the issue this time?",
  "stubborn.dialogue.greet/9": "Oh, look who it is. What brings you back here?",

  "stubborn.dialogue.greet.negative/1": "Ugh, spare me your presence, you're the absolute LAST person I wanted to stumble upon!",
  "stubborn.dialogue.greet.negative/2": "Oh, look who's decided to grace us with their presence. Again. Joy.",
  "stubborn.dialogue.greet.negative/3": "Hmph.",
  "stubborn.dialogue.greet.negative/4": "Oh, it's just you. I was waiting for someone with an ounce of excitement, but I suppose you'll have to do.",
  "stubborn.dialogue.greet.negative/5": "Ah, the annoying pest has returned to torment me, I see. How delightful.",

  "stubborn.dialogue.greet.success/1": "Well, I suppose that's good... if you say so.",
  "stubborn.dialogue.greet.success/2": "Oh, you're doing good? Don't get too excited now.",
  "stubborn.dialogue.greet.success/3": "Happy to hear it, I guess. Not that it matters much to me.",
  "stubborn.dialogue.greet.success/4": "So glad to hear that... or whatever.",
  "stubborn.dialogue.greet.success/5": "Good to know it, I suppose. Not that it affects my day in any way.",
  "stubborn.dialogue.greet.fail/1": "Pfft.",
  "stubborn.dialogue.greet.fail/2": "Oh great, just what I needed...",
  "stubborn.dialogue.greet.fail/3": "Seriously? You must be joking.",
  "stubborn.dialogue.greet.fail/4": "Are you serious right now? Unbelievable.",
  "stubborn.dialogue.greet.fail/5": "Well, that's just perfect, isn't it?",

  "stubborn.dialogue.apologize.success/1": "It's fine, mistakes happen. But don't let it happen again, got it?",
  "stubborn.dialogue.apologize.success/2": "It's okay, just watch yourself next time. I expect better from you.",
  "stubborn.dialogue.apologize.success/3": "I guess that's okay, just be careful. Don't make a habit out of it though.",
  "stubborn.dialogue.apologize.success/4": "No problem, everyone makes mistakes. But you better not make this a habit.",
  "stubborn.dialogue.apologize.success/5": "Yeah, it's fine. Just remember, I won't always be so forgiving.",
  "stubborn.dialogue.apologize.fail/1": "Get lost!",
  "stubborn.dialogue.apologize.fail/2": "You totally smacked me on purpose!",
  "stubborn.dialogue.apologize.fail/3": "As if I'd ever believe that nonsense!",
  "stubborn.dialogue.apologize.fail/4": "You really think saying sorry will magically heal the pain? Think again!",
  "stubborn.dialogue.apologize.fail/5": "Hah! Yeah, like I'm buying that load of baloney!",

  "stubborn.dialogue.location.failed/1": "Nope, not a whisper of anything new, and I've got ears sharper than a bat!",
  "stubborn.dialogue.location.failed/2": "Look, I've got a mind like a steel trap, and trust me, there's no interesting places on my radar.",
  "stubborn.dialogue.location.failed/3": "Let me break it down for you, pal. We villagers have bigger fish to fry than prowling around dangerous ruins like you thrill-seeking adventurers. Better luck next time!",
  "stubborn.dialogue.location.forgot/1": "Ugh, you won't believe this! I stumbled upon the most amazing location, but guess what? I totally blanked out and forgot to jot it down on my map. Sorry about that.",
  "stubborn.dialogue.location.forgot/2": "Oh, I had the juiciest details of this mind-blowing place right on the tip of my tongue! But, of course, my forgetful nature struck again, and I completely neglected to document it. My bad, sorry!",
  "stubborn.dialogue.location.forgot/3": "You won't believe my luck! I actually stumbled upon something worth your while, but guess what? My brain decided to take a vacation and left me with nothing but a frustrating memory lapse. Apologies for the inconvenience!",
  "stubborn.dialogue.location.igloo/1": "An igloo? Who in their right mind would build a house out of snow? It's just asking for trouble. Brrr!",
  "stubborn.dialogue.location.igloo/2": "So, guess what I stumbled upon at %2$s? An abandoned igloo. Yeah, nobody in their right mind would want to live there. And, between you and me, I wouldn't be surprised if it's haunted. I mean, I always hear these creepy noises whenever I'm in that area...",
  "stubborn.dialogue.location.igloo/3": "You won't believe what I saw at %2$s. An old, abandoned igloo made entirely of ice. Can you imagine? Who in their right mind builds a house like that? I bet it has been deserted for ages.",
  "stubborn.dialogue.location.pyramid/1": "You really think you'll find treasure in that pyramid at %2$s? Hah! Good luck with that. I've seen dozens of adventurers come and go, and none of them ever found a single shiny thing in there.",
  "stubborn.dialogue.location.pyramid/2": "Ah, the infamous pyramid at %2$s. You know, I've heard all the stories about it, but I highly doubt there's anything valuable left inside. It's probably all been looted ages ago.",
  "stubborn.dialogue.location.pyramid/3": "So, you think you've got what it takes to explore that pyramid at %2$s? Well, let me tell you, it's a fool's errand. You'll just end up getting lost and never finding anything worthwhile.",
  "stubborn.dialogue.location.ruined_portal_desert/1": "You won't believe your eyes! A portal in shambles, right there in the godforsaken desert at %2$s. It's a disgrace!",
  "stubborn.dialogue.location.ruined_portal_swamp/1": "Well, well, isn't this delightful? At %2$s, amidst this horrid swamp, lies a ruined portal. Those imbeciles from the Nether must be feeling rather foolish, realizing they've landed in the most undesirable of places. It serves them right!",
  "stubborn.dialogue.location.ruined_portal/1": "Ah, so you wanna know about that ruined portal at %2$s, huh? Well, let me tell ya, it's a complete disaster zone! Nether invasion wreaked havoc on that poor thing.",
  "stubborn.dialogue.location.ruined_portal/2": "Listen up, kid. If you dare venture to %2$s, you'll come across the creepiest, most spine-chilling ruined nether portal you've ever laid eyes on. But hey, don't worry, it's totally safe...ish. Just make sure you don't go stepping on any magma.",
  "stubborn.dialogue.location.ruined_portal/3": "Oh, you're interested in those ancient ruins at %2$s, are ya? Well, let me tell you, that place used to be a nether portal. Can you believe it? There are rumors about hidden treasures there, but trust me, no one in their right mind wants anything to do with that cursed spot.",
  "stubborn.dialogue.location.ruined_portal_mountain/1": "Oh, for crying out loud! Don't bother going to %2$s, the portal in the mountains is completely wrecked beyond repair.",
  "stubborn.dialogue.location.mansion/1": "You dare to wander near %2$s? Well, prepare for a gruesome encounter with the illagers and their wretched mansion. Stay far away if you value your pitiful existence.",
  "stubborn.dialogue.location.mansion/2": "Oh, so you've heard about that dreadful mansion at %2$s, have you? Let me tell you, it's infested with those vile illagers. If you ask me, we should evacuate the village immediately, before their cursed presence consumes us all.",
  "stubborn.dialogue.location.monument/1": "Ha! You must be out of your mind if you consider venturing near that sunken castle at %2$s. Those sea monsters will tear you to shreds without batting an eye. I'd advise you to steer clear, unless you fancy becoming fish food.",
  "stubborn.dialogue.location.monument/2": "Ah, the legendary tales of the ancient ruins submerged deep within the treacherous ocean at %2$s. Sure, there may be treasures hidden in its depths, but mark my words, it's a perilous journey. Only a fool would dare to tempt fate in those dangerous waters.",
  "stubborn.dialogue.location.shipwreck/1": "Hmph! Can you believe I stumbled upon a pathetic sunken ship at %2$s? Supposedly, it belonged to the Eastern Alliance Company, as if that means anything!",
  "stubborn.dialogue.location.shipwreck/2": "Oh, do tell! I overheard those clueless fishermen babbling about some shipwreck they found at %2$s. They actually think there might be treasure lurking inside! How amusing!",
  "stubborn.dialogue.location.shipwreck_beached/1": "Can't you see the blasted shipwreck at %2$s? It's right there, mocking me!",
  "stubborn.dialogue.location.shipwreck_beached/2": "I demand you set sail to %2$s immediately! On the beach, a ship lies shattered and abused. How on earth did it manage to disgrace itself in such a manner?",
  "stubborn.dialogue.location.village_desert/1": "Oh, you simply mustn't overlook the mesmerizing village oasis that thrives against all odds at %2$s in this harsh desert terrain!",
  "stubborn.dialogue.location.village_taiga/1": "Don't bother going anywhere else, I'm telling you, there's a charming village over yonder in the heart of the taiga biome.",
  "stubborn.dialogue.location.village_taiga/2": "You wanna find another village? Well, trudge through that taiga biome and you might stumble upon one at %2$s. But don't say I didn't warn ya, it's a long way to go.",
  "stubborn.dialogue.location.village_snowy/1": "Can you believe it? There's yet another village over at %2$s, but let me tell you, it's absolutely freezing there. I mean, why would anyone willingly choose to live in such bone-chilling conditions?",
  "stubborn.dialogue.location.village_snowy/2": "Oh, great! Another freezing village to add to the collection. You'll find it over at %2$s, nestled in the snowy plains. The folks there are supposedly friendly, but honestly, I'd rather not risk frostbite just to make polite small talk.",
  "stubborn.dialogue.location.village_plains/1": "Don't bother going anywhere else, there's another village at %2$s, just like this one.",
  "stubborn.dialogue.location.village_plains/2": "You won't believe it, but there's another village over in those plains at %2$s. Trust me, I know everything around here.",
  "stubborn.dialogue.location.village_savanna/1": "Ugh, why would anyone go to that scorching hot place at %2$s? There's another village there, but trust me, it's not worth the sweat.",
  "stubborn.dialogue.location.village_savanna/2": "Oh yeah, there's this village in the savanna at %2$s. Supposedly, the people there are nice. But I mean, who wants to deal with all that heat and sand, right?",
  "stubborn.dialogue.location.swamp_hut/1": "That swamp over yonder? You better steer clear, my friend. There's this wicked witch who calls it home. I wouldn't dare set foot anywhere near that cursed place.",
  "stubborn.dialogue.location.swamp_hut/2": "Listen up, mate. I've got some advice for you. Stay far away from %2$s. That swampy abomination is inhabited by a notorious witch. Don't tempt fate by venturing anywhere close. You'll regret it, mark my words.",
  "stubborn.dialogue.location.mineshaft/1": "Yeah, yeah, there used to be a mine around here. But they shut it down 'cause of some stupid accident. Supposed to be near %2$s, if you really wanna risk it.",
  "stubborn.dialogue.location.mineshaft/2": "Ah, I remember that old mine. It was at %2$s. But let me tell ya, it's overrun with creepy crawlies now. Not a safe place to be, if you ask me. You better watch your back if you decide to venture down there.",
  "stubborn.dialogue.location.jungle_pyramid/1": "Ah, so you're heading to %2$s, are you? Well, listen up, buddy. There's an old temple there, but let me tell you, it's not for the faint-hearted. You better steer clear if you don't want to end up as trap fodder.",
  "stubborn.dialogue.location.jungle_pyramid/2": "You know, if you're crazy enough to venture into %2$s, there's this ancient ruin waiting for you in the nearby jungle. Just a friendly warning, though. I wouldn't go near it if I were you. Those traps are still fully functional, you know? It's a wonder our ancestors didn't raid it themselves ages ago, but hey, who am I to judge?",
  "stubborn.dialogue.location.pillager_outpost/1": "Ugh, can you believe those Pillagers? They've invaded our peaceful village and set up a stupid outpost right next to us. I swear, if they dare attack us again, I'll give them a taste of their own medicine.",
  "stubborn.dialogue.location.pillager_outpost/2": "You won't believe it, but those pesky Pillagers have set up camp at %2$s and they are causing us sleepless nights. Don't even think about going near there unless you want to be their target practice. Sheesh, they think they own the place!",
  "stubborn.dialogue.location.pillager_outpost/3": "Ah, so you're thinking of venturing to %2$s, huh? Well, there's this outpost run by those arrogant Pillagers. If you manage to take them down and find some decent loot, the whole village will sing your praises. Trust me, we all want to see those villains get what they deserve.",
  "stubborn.dialogue.location.ancient_city/0": "I've been hearing these strange noises at %2$s, buried deep beneath the surface. Can't be bothered to investigate though.",
  "stubborn.dialogue.location.ancient_city/1": "My gut tells me there's something valuable hidden beneath the ground at %2$s. But who am I to care?",
  "stubborn.dialogue.location.ancient_city/3": "Apparently, there's some grand ancient city at %2$s. Meh, I didn't see a thing. Maybe it's all just a bunch of underground nonsense.",

  "stubborn.dialogue.joke.monster.success/1": "Pfft! That Skelly thought it had a chance. How wrong it was!",
  "stubborn.dialogue.joke.monster.success/2": "Seriously? That zombie thought it could take you down with a shovel? Hah, what a joke!",
  "stubborn.dialogue.joke.monster.success/3": "Who does that spider think it is? You put it in its place, haha!",
  "stubborn.dialogue.joke.monster.success/4": "Wow, you actually managed to get a skeleton to take out a creeper? Unbelievable, haha!",
  "stubborn.dialogue.joke.monster.success/5": "Hahaha! Can you believe how clueless cave spiders are? They never stood a chance!",
  "stubborn.dialogue.joke.monster.failed/1": "Golems have feelings too, you know! How dare you mock them!",
  "stubborn.dialogue.joke.monster.failed/2": "... Who even finds it amusing anymore when a creeper explodes? It's just juvenile!",
  "stubborn.dialogue.joke.monster.failed/3": "Have some empathy, will you? Zombies and skeletons were once living beings, just like us.",
  "stubborn.dialogue.joke.monster.failed/4": "Oh, look, an enderman teleported. How utterly groundbreaking. Not.",
  "stubborn.dialogue.joke.monster.failed/5": "If I had a dollar for every time someone made a silly joke about silverfish attacking them while they're using the loo, I'd have a grand total of two dollars. And let me tell you, it's bafflingly absurd that it happened yet again.",

  "stubborn.dialogue.joke.animal.success/1": "How unfortunate for the sheep to lose its wool! Hilarious, but oh so sad!",
  "stubborn.dialogue.joke.animal.success/2": "And guess what? The wolf actually fell head over heels for the sheep! Can you believe it? Talk about an unexpected love story!",
  "stubborn.dialogue.joke.animal.success/3": "Chickens, oh dear, they never cease to amaze me! Who would've thought they had such comedic talents?",
  "stubborn.dialogue.joke.animal.success/4": "That's just plain stupid, and I absolutely adore it! Keep those animal jokes coming!",
  "stubborn.dialogue.joke.animal.success/5": "Ah, the beauty of cows and their infinite milk supply! It's like having a never-ending fountain of dairy goodness, isn't it?",
  "stubborn.dialogue.joke.animal.failed/1": "Oh please, spare me your feeble attempts at humor.",
  "stubborn.dialogue.joke.animal.failed/2": "Hmph, making jokes at the expense of poor defenseless animals, how typical.",
  "stubborn.dialogue.joke.animal.failed/3": "My dear, your sense of humor is as dry as the desert sand.",
  "stubborn.dialogue.joke.animal.failed/4": "Mocking innocent creatures is beneath me, and it should be beneath you too.",

  "stubborn.dialogue.flirt.slap/1": "You've got some nerve!",
  "stubborn.dialogue.flirt.slap/2": "Have you been taking lessons from a stubborn Llama on how to flirt?!",
  "stubborn.dialogue.kiss.slap/1": "Are you seriously challenging me?",
  "stubborn.dialogue.kiss.slap/2": "One more attempt, and you'll regret it for a lifetime!",

  "stubborn.dialogue.chat.plains/1": "Why would I like the plains? It's the only place I've ever known, unfortunately. Maybe one day I'll venture out and see something more interesting...",
  "stubborn.dialogue.chat.plains/2": "Peaceful? Boring, you mean. It's not like there's anything exciting happening here anyway. But hey, I guess I'm stuck here, so might as well make the most of it.",
  "stubborn.dialogue.chat.plains/3": "Yeah, the plains can look nice at night, I guess. Just a whole lot of nothing, really. Not like there's anything else to do but stare at the emptiness.",
  "stubborn.dialogue.chat.plains/4": "Lay down and look at the sky? Ugh, sounds like a snooze-fest. I'd rather be doing something actually entertaining. But hey, to each their own, I guess.",
  "stubborn.dialogue.chat.plains/5": "Clean and fresh air? Meh. It's not like there's any competition around here. I guess it's a little better than the taiga, but that's not saying much.",
  "stubborn.dialogue.chat.plains/6": "Plain and simple? More like plain and dull. I crave excitement, not this monotonous plainness. But hey, some people are easily satisfied, I suppose.",
  "stubborn.dialogue.chat.plains/7": "Wild flowers, huh? Sounds like a waste of time, if you ask me. Crushes and flowers won't get you anywhere in life. But hey, if that's what made you happy, who am I to judge?",
  "stubborn.dialogue.chat.plains/8": "Oh, wow, a pretty sunrise. Just what I need to start my thrilling day in the plains. Please, spare me the nature observations. I'll stick to my own business, thank you very much.",
  "stubborn.dialogue.chat.savanna/1": "I don't care how hot it is in the savanna, I'll never leave this place! Who needs winter anyway?",
  "stubborn.dialogue.chat.savanna/2": "Those llamas are beyond annoying, but I guess I've learned to tolerate them. Barely.",
  "stubborn.dialogue.chat.savanna/3": "The architecture here in the savanna is unique, I'll give you that. But it's definitely not the only reason I stay here.",
  "stubborn.dialogue.chat.savanna/4": "You think the savanna biome is plain and generic? Ha! You clearly haven't seen its true potential yet.",
  "stubborn.dialogue.chat.savanna/5": "Unlike those pathetic desert villages, we may not get rain, but at least we have rivers. That's right, rivers!",
  "stubborn.dialogue.chat.savanna/6": "The hills and terrains here are not just interesting, they're downright captivating! It's like a natural masterpiece everywhere you look.",
  "stubborn.dialogue.chat.savanna/7": "When it gets hot, those acacia trees with their shade are the only thing that keeps me sane in this scorching savanna.",
  "stubborn.dialogue.chat.savanna/8": "Savanna villages don't just have the best melons and pumpkins in the world, we practically invented trading them! We're the masters of the fruit kingdom!",
  "stubborn.dialogue.chat.taiga/1": "The woods are alright, I suppose. They're good for some things, like building and firewood. But honestly, there's so much more to life than just that.",
  "stubborn.dialogue.chat.taiga/2": "Yeah, sure, some people might think it's cold in the taiga biome. But honestly, I've seen colder. It's not that big of a deal. I wouldn't say I'm crazy about it, but I guess it's alright.",
  "stubborn.dialogue.chat.taiga/3": "Taiga forests, huh? Yeah, they're cool, I guess. Not the coolest thing in the world, but they have their moments. And those berries? Meh, they're alright.",
  "stubborn.dialogue.chat.taiga/4": "Foxes in the taiga forests? Yeah, they're alright too, I suppose. Mischievous little buggers, always up to something. Can't say I adore them, but they're...interesting.",
  "stubborn.dialogue.chat.taiga/5": "I guess the wolves here in the taiga are pretty tame. They know we're not worth the trouble, so they leave us alone. Can't say I blame them.",
  "stubborn.dialogue.chat.taiga/6": "The air in the taiga? Yeah, it's...fine. I mean, it's no big deal. I've breathed better air in my time, but it's not the worst either. So, yeah, it's alright.",
  "stubborn.dialogue.chat.taiga/7": "Those sweet berry bushes? Ugh, don't get me started. Yeah, sure, the berries are good, but getting pricked by those thorns? It's the absolute worst. I'll take my chances with some other berries, thank you very much.",
  "stubborn.dialogue.chat.taiga/8": "The rain in the taiga? Yeah, it can get cold. Real cold. But peaceful? I don't know about that. It's just rain, you know? Nothing special.",
  "stubborn.dialogue.chat.snowy_plains/1": "It's freezing as heck here, and I don't care how much firewood there is, I'm still shivering!",
  "stubborn.dialogue.chat.snowy_plains/2": "This icy wasteland is pure torture, but hey, at least we've got an abundance of flipping fish!",
  "stubborn.dialogue.chat.snowy_plains/3": "When the temperatures drop like this, all I wanna do is wrap myself in a blanket and binge-watch shows next to a blazing furnace!",
  "stubborn.dialogue.chat.snowy_plains/4": "Every time it snows, it's like the universe is mocking me, reminding me of the good old days when I actually had fun with my dumb friends and their stupid snowball fights. Ugh, who needs 'em!",
  "stubborn.dialogue.chat.snowy_plains/5": "Those pesky strays are the bane of my existence, especially at night when I'm just trying to stroll through the village. And don't even get me started on their ridiculous tipped arrows!",
  "stubborn.dialogue.chat.snowy_plains/6": "Hey, watch your back out there! The guards have spotted a bunch of menacing wolves lurking around. Stay safe, or you'll end up as their chew toy!",
  "stubborn.dialogue.chat.snowy_plains/7": "I swear, touching an iron golem is like signing a contract to be stuck in a never-ending nightmare! You can forget about doing anything productive for the rest of the day. Thanks a lot, iron golems!",
  "stubborn.dialogue.chat.snowy_plains/8": "Ah, the good old days when my parents actually cared about me. They used to bring me a pumpkin, and after we were done making pie, I'd fashion it into a snow golem and have a blast! Man, those were the times...",
  "stubborn.dialogue.chat.desert/1": "It's scorching here in the desert, but at least we never have to worry about freezing in the winter.",
  "stubborn.dialogue.chat.desert/2": "The desert is always toasty-warm, no matter what time of year.",
  "stubborn.dialogue.chat.desert/3": "Even though it's blistering hot here in the desert, I'll always sport a golden tan, or a painful sunburn...",
  "stubborn.dialogue.chat.desert/4": "Ah, the nights in the desert are a breathtaking sight, with a slight drop in temperature. Perfect for stargazing.",
  "stubborn.dialogue.chat.desert/5": "Goodness gracious! Can you believe how insanely intense the sun is today?",
  "stubborn.dialogue.chat.desert/6": "Goodness gracious! The sun is ridiculously intense today!",
  "stubborn.dialogue.chat.desert/7": "Have you managed to spot any rabbits around here? They blend in so well, it's infuriating!",
  "stubborn.dialogue.chat.desert/8": "Let me tell you, one major annoyance of living here are those husks. No matter what, they always leave you starving after they smack you! Isn't that just ridiculous!?",
  "stubborn.dialogue.chat.desert/9": "I pricked myself on a cactus the other day. You really have to watch your step around these treacherous plants!",
  "stubborn.dialogue.chat.desert/10": "Life in this bone-dry desert is no walk in the park, but hey, at least we have this village to quench our thirst and fill our bellies.",

  "stubborn.dialogue.story.exploring.success/1": "Hmph! I suppose I might explore the world one day, if it's worth my time.",
  "stubborn.dialogue.story.exploring.success/2": "Oh, please! Traveling and exploring sounds overrated. I'm perfectly content with my village, family, and friends. No need to make me feel inferior!",
  "stubborn.dialogue.story.exploring.success/3": "Brave? Ha! More like foolish. Only a true fool would willingly venture into the unknown like that.",
  "stubborn.dialogue.story.exploring.fail/1": "Sorry, but I'm not in the mood for another one of your mind-numbing narratives.",
  "stubborn.dialogue.story.exploring.fail/2": "Spare me the agony of enduring another one of your lackluster stories.",
  "stubborn.dialogue.story.exploring.fai/l3": "Conversing with you is like debating with a closed clamshell that refuses to reveal its treasure. Minus the underwater charm, naturally.",

  "stubborn.dialogue.story.nether.success/1": "It can't be that hot there, you're just exaggerating!",
  "stubborn.dialogue.story.nether.success/2": "Surviving in such a treacherous place? Please, that's child's play for someone like me.",
  "stubborn.dialogue.story.nether.success/3": "Treasure in the Nether? I wouldn't waste my time with such nonsense. I've got better things to do.",
  "stubborn.dialogue.story.nether.success/4": "Brave? Ha! Going to the Nether doesn't scare me one bit. I'd laugh in the face of danger!",
  "stubborn.dialogue.story.nether.success/5": "Zombified Piglin? Yeah, yeah, I've seen them. Nothing impressive, just another creature lurking around.",
  "stubborn.dialogue.story.nether.fail/1": "You must be joking if you think you've ever stepped foot into the Nether.",
  "stubborn.dialogue.story.nether.fail/2": "Ah, so that's why those Piglins decided to give you a good beating.",
  "stubborn.dialogue.story.nether.fail/3": "It matters little to me if you claim to have journeyed to the Nether. Your storytelling skills are abysmal, to say the least.",
  "stubborn.dialogue.story.nether.fail/4": "Hah! You, venturing into the Nether? You barely look capable of lifting a feather, let alone surviving there.",
  "stubborn.dialogue.story.nether.fail/5": "My dear old grandpa, may he rest in peace, traversed the Nether without a hitch, and yet he never breathed a word about warped fungus. Don't even dare to spread your deceitful tales, you fraud!",

  "stubborn.dialogue.story.enderdragon.success/1": "Unbelievable! So you managed to snatch the dragon egg, huh?",
  "stubborn.dialogue.story.enderdragon.success/2": "What? You seriously took down that so-called \"mighty\" dragon? The whole village won't stop talking about it for ages!",
  "stubborn.dialogue.story.enderdragon.fail/1": "Hmph! Are you out of your mind? The ender dragon is nothing but a mere fairy tale.",
  "stubborn.dialogue.story.enderdragon.fail/2": "Oh please, spare me the laughter. No mortal soul could even dream of laying a finger on that formidable dragon!",

  "stubborn.dialogue.story.wither.success/1": "No way! The Wither is like a force of unstoppable chaos!",
  "stubborn.dialogue.story.wither.success/2": "Seriously?! You actually defeated the Wither? That's mind-blowing!",
  "stubborn.dialogue.story.wither.fail/1": "I refuse to accept your words.",
  "stubborn.dialogue.story.wither.fail/2": "You appear far too intact for me to buy into such claims.",

  "stubborn.dialogue.stay.fail/1": "No way, I'm not one to waste my time here!",
  "stubborn.dialogue.stay.fail/2": "Don't bother asking, I'm too busy exploring and conquering the world!",
  "stubborn.dialogue.stay.fail/3": "This village might be nice, but I'm destined for grander adventures!",
  "stubborn.dialogue.stay.repeat/1": "I've already told you that, haven't I?",
  "stubborn.dialogue.stay.repeat/2": "Seriously? I just answered that! Try paying attention next time.",
  "stubborn.dialogue.stay.success/1": "Fine, I suppose I can endure staying at this village.",
  "stubborn.dialogue.stay.success/2": "Alright, I can tolerate staying at this village, I guess.",
  "stubborn.dialogue.stay.no_space/1": "Ugh, this village is way too cramped for my taste.",
  "stubborn.dialogue.stay.no_space/2": "As much as I'd love to stick around, there's just not a single available bed anywhere.",

  "stubborn.dialogue.hire/1": "Fine, I suppose I can lend you a hand. Just make sure you've got the emeralds ready!",
  "stubborn.dialogue.hire/2": "Hmph, I guess I can help you out. But don't forget to have those emeralds, alright?",
  "stubborn.dialogue.hire/3": "Well, I can spare some time for you, but don't expect miracles. Just make sure you've got those emeralds lined up!",
  "stubborn.dialogue.no_money/1": "Sorry, but I won't lift a finger without a hefty stack of shiny emeralds.",
  "stubborn.dialogue.no_money/2": "Do you take me for a fool? Show me the emeralds, or I'm outta here!",
  "stubborn.dialogue.no_money/3": "I don't come cheap, my friend. You better start digging deeper into your pockets if you want my expertise.",

  "stubborn.dialogue.main.rock_paper_scissor/1": "Let's play Rock Paper Scissors!",
  "stubborn.dialogue.rock_paper_scissor/1": "Rock, paper, scissors, shoot! Prepare to witness my unbeatable skills!",
  "stubborn.dialogue.rock_paper_scissor/2": "I'm not just going to beat you this time, I'm going to crush you! Get ready for humiliation!",
  "stubborn.dialogue.rock_paper_scissor.rock/1": "Rock, and that's final!",
  "stubborn.dialogue.rock_paper_scissor.paper/1": "Why settle for anything less than the absolute best? Paper reigns supreme, leaving rock and scissors trembling in defeat. Fear my impeccable decision-making skills!",
  "stubborn.dialogue.rock_paper_scissor.scissor/1": "No way, it's gotta be scissor!",
  "stubborn.dialogue.rock_paper_scissor.loose.rock/1": "Haha, no way! I picked rock, and you know what? I always win with rock!",
  "stubborn.dialogue.rock_paper_scissor.loose.paper/1": "You can try to convince me otherwise, but scissors is where I'm putting my money on!",
  "stubborn.dialogue.rock_paper_scissor.loose.scissor/1": "I laugh in the face of your feeble scissors! My rock reigns supreme, and your defeat is inevitable.",
  "stubborn.dialogue.rock_paper_scissor.win.rock/1": "Ugh, as much as it pains me to admit it, rock does have its moments. Scissors were no match for its brute force. It seems I've lost this round, but mark my words, I'll come back stronger next time!",
  "stubborn.dialogue.rock_paper_scissor.win.paper/1": "If rock were a person, it would be my arch-nemesis. It takes pleasure in my defeat, I'm sure of it.",
  "stubborn.dialogue.rock_paper_scissor.win.scissor/1": "Oh, fine! Scissors slice through paper like a hot knife through butter, congratulations on your victory.",
  "_": ""
}
