{
    "cobblemon.type.cosmic": "Cosmic",
    "cobblemon.type.crystal": "Crystal",
    "cobblemon.type.digital": "Digital",
    "cobblemon.type.light": "Light",
    "cobblemon.type.nuclear": "Nuclear",
    "cobblemon.type.plastic": "Plastic",
    "cobblemon.type.poison": "Poison",
    "cobblemon.type.psychic": "Psychic",
    "cobblemon.type.questionmark": "???",
    "cobblemon.type.shadow": "Shadow",
    "cobblemon.type.slime": "Slime",
    "cobblemon.type.sound": "Sound",
    "cobblemon.type.wind": "Wind",
	"cobblemon.move.asteroidshot": "Asteroid Shot",
  "cobblemon.move.asteroidshot.desc": "The user calls Asteroids to rain from above. This may also leave the target with a burn.",
  "cobblemon.move.brace": "Brace",
  "cobblemon.move.brace.desc": "The user readies itself making it immune to critical hits. Attack and Sp. Attack fall but Defense and Sp. Defense Rise.",
  "cobblemon.move.causticbreath": "Caustic Breath",
  "cobblemon.move.causticbreath.desc": "A blast of corrosive breath rolls over the foe. It may lower the target's defenses.",
  "cobblemon.move.cheapshot": "Cheap Shot",
  "cobblemon.move.cheapshot.desc": "The user distracts the foe, then targets its weak spot in a vicious attack. This attack always results in a critical hit.",
  "cobblemon.move.frostslash": "Frost Slash",
  "cobblemon.move.frostslash.desc": "The user slashes fiercely with sharpened ice. Critical hits land more easily.",
  "cobblemon.move.jetstrike": "Jet Strike",
  "cobblemon.move.jetstrike.desc": "At a dizzying speed, the user lunges at the foe. This move is sure to strike first.",
  "cobblemon.move.leafshield": "Leaf Shield",
  "cobblemon.move.leafshield.desc": "The user is cloaked in protective leaves which boost its Defenses. The boost is greater during intense sunlight.",
  "cobblemon.move.mudslide": "Mudslide",
  "cobblemon.move.mudslide.desc": "An enormous swathe of mud swamps the opposing team. It also reduces the targets' evasiveness.",
  "cobblemon.move.possession": "Possession",
  "cobblemon.move.possession.desc": "The user takes control of the target's body and causes it to attack itself. The higher the target's Attack stat, the greater the damage.",
  "cobblemon.move.psybolt": "Psybolt",
  "cobblemon.move.psybolt.desc": "A flash of psychic power strikes the target in the blink of an eye. It is sure to strike first.",
  "cobblemon.move.shieldbash": "Shield Bash",
  "cobblemon.move.shieldbash.desc": "The user crashes into the target from a defensive position. Damage based on Defense Stat.",
  "cobblemon.move.terrorize": "Terrorize",
  "cobblemon.move.terrorize.desc": "The target is subjected to visions of unimaginable horror. It may also cause confusion.",
  "cobblemon.move.webball": "Web Ball",
  "cobblemon.move.webball.desc": "A sticky blob of web is flung at the target, restricting its movement and lowering speed.",
  "cobblemon.move.windshear": "Wind Shear",
  "cobblemon.move.windshear.desc": "The user beats its wings at blinding speeds, creating a damaging surge of wind. If the user attacks before the target, its power is doubled.",
  "cobblemon.move.batteringram": "Battering Ram",
  "cobblemon.move.batteringram.desc": "The user performs a tackle like a battering ram. It can also break barriers, such as Light Screen and Reflect.",
  "cobblemon.move.saltcrash": "Salt Crash",
  "cobblemon.move.saltcrash.desc": "The user hardens its layers of salt to increase its defenses and crashes into an opponent to deal damage.",
  "cobblemon.move.ancientroar": "Ancient Roar",
  "cobblemon.move.ancientroar.desc": "The user's voice shakes with a primal roar, damaging its foes with pure fear.",
  "cobblemon.move.corrode": "Corrode",
  "cobblemon.move.corrode.desc": "The user launches a corrosive acid at the opponent that is Super Effective against Steel-types.",
  "cobblemon.move.darkmatter": "Dark Matter",
  "cobblemon.move.darkmatter.desc": "The user calls forth the unknown parts of the universe into an attack. The user must recharge next turn.",
  "cobblemon.move.dracojet": "Draco Jet",
  "cobblemon.move.dracojet.desc": "The user uses a skill long forgotten by the dragons to always strike first.",
  "cobblemon.move.dragonify": "Dragonify",
  "cobblemon.move.dragonify.desc": "The user uses dragon blood to corrupt the foe and turn it into the Dragon-type.",
  "cobblemon.move.drakonvoice": "Drakon Voice",
  "cobblemon.move.drakonvoice.desc": "The sheer force of the user's draconic voice obliterates everything in its path.",
  "cobblemon.move.basilisksglare": "Basilisk's Glare",
  "cobblemon.move.basilisksglare.desc": "The user glares and petrifies the foe, turning them into the Rock-type.",
  "cobblemon.move.nanorepair": "Nanorepair",
  "cobblemon.move.nanorepair.desc": "The user activates a nanobotic repair system that heals and boosts Defense.",
  "cobblemon.move.barbedtackle": "Barbed Tackle",
  "cobblemon.move.barbedtackle.desc": "The user rams into an opponent with the poisoned points on its body. This may also poison the target.",
  "cobblemon.move.bonesweep": "Bone Sweep",
  "cobblemon.move.bonesweep.desc": "A large club is swung at the foe in a sweeping motion. This move hits the entire enemy team.",
  "cobblemon.move.brainfreeze": "Brain Freeze",
  "cobblemon.move.brainfreeze.desc": "The user employs cryokinesis against the foe, potentially freezing it.",
  "cobblemon.move.brainstorm": "Brain Storm",
  "cobblemon.move.brainstorm.desc": "The user attacks using psychic force whilst brainstorming. This may raise the user's Special Attack.",
  "cobblemon.move.cactussmash": "Cactus Smash",
  "cobblemon.move.cactussmash.desc": "The user slams its spiky cactus into the target to attack. The user also sustains serious damage.",
  "cobblemon.move.cinderbreath": "Cinder Breath",
  "cobblemon.move.cinderbreath.desc": "The foe is blasted with a cloud of hot ash to inflict damage and lower accuracy.",
  "cobblemon.move.dracoblitz": "Draco Blitz",
  "cobblemon.move.dracoblitz.desc": "The user crashes into the foe at a scorching speed. The user also takes damage and may burn the target.",
  "cobblemon.move.dryneedles": "Dry Needles",
  "cobblemon.move.dryneedles.desc": "The target is struck with a series of 2 to 5 needles from a cactus plant.",
  "cobblemon.move.faengrush": "Faeng Rush",
  "cobblemon.move.faengrush.desc": "The user slams the target with a whimsical strike of the fangs. It may make the target flinch.",
  "cobblemon.move.flashflood": "Flash Flood",
  "cobblemon.move.flashflood.desc": "The user causes a quick surge of flowing water to drown out the foe. This move always goes first.",
  "cobblemon.move.focusedram": "Focused Ram",
  "cobblemon.move.focusedram.desc": "The user centers their mind for a psy-charged headbutt. The user takes recoil damage.",
  "cobblemon.move.foggystrike": "Foggy Strike",
  "cobblemon.move.foggystrike.desc": "A quick concealed strike in a shroud of mist, which cannot be dodged.",
  "cobblemon.move.groomguard": "Groom Guard",
  "cobblemon.move.groomguard.desc": "The user protects itself by grooming its thick fur, drastically raising its Special Defense.",
  "cobblemon.move.nimbusfist": "Nimbus Fist",
  "cobblemon.move.nimbusfist.desc": "A strike of condensed mist strikes the foe, lowering its accuracy.",
  "cobblemon.move.pressurize": "Pressurize",
  "cobblemon.move.pressurize.desc": "The user pressurizes its crystalline body parts, sharply raising its Special Defense.",
  "cobblemon.move.searingslash": "Searing Slash",
  "cobblemon.move.searingslash.desc": "The user rips through the foe with a hot blade. It may hit critically and leave a burn.",
  "cobblemon.move.tartantrum": "Tar-Tantrum",
  "cobblemon.move.tartantrum.desc": "The user throws powerful tar-fists at his foe. It may also lower the foes' Speed stat.",
  "cobblemon.move.thornwhip": "Thorn Whip",
  "cobblemon.move.thornwhip.desc": "The target is struck with thick spiked vines. High critical hit ratio.",
  "cobblemon.move.thunderslash": "Thunder Slash",
  "cobblemon.move.thunderslash.desc": "The foe is slashed with an electrified blade. Critical hits land easier.",
  "cobblemon.move.typhoon": "Typhoon",
  "cobblemon.move.vanish": "Vanish",
  "cobblemon.move.vanish.desc": "The user becomes nigh invisible using its ghost body. This sharply raises its evasiveness.",
  "cobblemon.move.venomswipe": "Venom Swipe",
  "cobblemon.move.venomswipe.desc": "The user swipes around its venomous tail aimlessly. This may poison struck targets.",
  "cobblemon.move.smogdiffusion": "Smog Diffusion",
  "cobblemon.move.smogdiffusion.desc": "After making its attack, the user rushes back to switch places with a party Pokémon in waiting. May poison the target.",
  "cobblemon.move.overheadstrike": "Overhead Strike",
  "cobblemon.move.overheadstrike.desc": "This relentless attack does massive damage to a target affected by status conditions.",
  "cobblemon.move.piercepincer": "Pierce Pincer",
  "cobblemon.move.piercepincer.desc": "The user pierces the enemy's armor with its pincer. This may also lower the target's defensive stats.",
  "cobblemon.move.bugout": "Bug Out",
  "cobblemon.move.bugout.desc": "The user goes berserk and relentlessly attacks the target. This also damages the user quite a lot.",
  "cobblemon.move.thundercrush": "Thunder Crush",
  "cobblemon.move.thundercrush.desc": "The user delivers an electric double chop with its forearms crossed. This move has a heightened chance of landing a critical hit.",
  "cobblemon.move.flamejet": "Flame Jet",
  "cobblemon.move.flamejet.desc": "The user lunges at the target to inflict damage, moving at blazing speeds. This move always goes first.",
  "cobblemon.move.chairdrop": "Chair Drop",
  "cobblemon.move.chairdrop.desc": "The user grabs a chair and slams it against the target. This move may use Steel or Fighting type depending on which is super effective.",
  "cobblemon.move.landsliderush": "Landslide Rush",
  "cobblemon.move.landsliderush.desc": "The user rushes downhill at the target, then exits the battle and swaps in a party member.",
  "cobblemon.move.seedyrecede": "Seedy Recede",
  "cobblemon.move.seedyrecede.desc": "The user grab recedes back into its pokeball hurling seeds at the opponent, then exits the battle and swaps in a party member.",
  "cobblemon.move.acidrain": "Acid Rain",
  "cobblemon.move.acidrain.desc": "The user summons a toxic downpour lasting five turns. It damages all Pokémon except Poison and Steel Types.",
  "cobblemon.move.asteroidbelt": "Asteroid Belt",
  "cobblemon.move.asteroidbelt.desc": "The user surrounds itself with a ring of asteroids. Attacks that get too close are damaged and may be left frozen solid.",
  "cobblemon.move.atomsplit": "Atom Split",
  "cobblemon.move.atomsplit.desc": "The user attacks everything around it by causing a tremendous explosion. The user faints upon using this move.",
  "cobblemon.move.depthcharge": "Depth Charge",
  "cobblemon.move.depthcharge.desc": "The user fires a blast of energy from the deep. May paralyze the target.",
  "cobblemon.move.dustdevil": "Dust Devil",
  "cobblemon.move.dustdevil.desc": "A cyclone of thick dust is whipped up. This move hits Pokémon that are in the air.",
  "cobblemon.move.engulf": "Engulf",
  "cobblemon.move.engulf.desc": "Using a black hole, the user clears its side of the field of trapping moves and hazards while damaging the target in the process.",
  "cobblemon.move.miraclewill": "Miracle Will",
  "cobblemon.move.miraclewill.desc": "The target puts all of its willpower into an attack. If the target is an ally, it restores its HP instead.",
  "cobblemon.move.perplex": "Perplex",
  "cobblemon.move.perplex.desc": "The user assaults its foe with bewildering ideas. This move's power is increased if the target is confused.",
  "cobblemon.move.standoff": "Standoff",
  "cobblemon.move.standoff.desc": "The user initiates a duel. Both Pokémon may only attack and cannot switch until one of them has fainted.",
  "cobblemon.move.achillesheel": "Achilles Heel",
  "cobblemon.move.achillesheel.desc": "The user deals Super Effective Damage to targets that are not immune to this move.",
  "cobblemon.move.newmoon": "New Moon",
  "cobblemon.move.newmoon.desc": "The user blots out sun and moon, creating endless night.",
  "cobblemon.move.wormhole": "Wormhole",
  "cobblemon.move.wormhole.desc": "The user rips a hole in space- always striking first.",
  "cobblemon.move.zombiestrike": "Zombie Strike",
  "cobblemon.move.zombiestrike.desc": "The user thrusts with a ghostly arm, striking the opponent with a physical presence.",
  "cobblemon.move.atomicpunch": "Atomic Punch",
  "cobblemon.move.atomicpunch.desc": "A punch inbued with radiation, capable of infecting the enemy.",
  "cobblemon.move.coralbreak": "Coral Break",
  "cobblemon.move.coralbreak.desc": "The user creates waves in the water to attack the target. This move does physical damage.",
  "cobblemon.move.drainlife": "Drain Life",
  "cobblemon.move.drainlife.desc": "The user drains the foe's energy with its fangs. The user's HP is restored by half the damage inflicted.",
  "cobblemon.move.expunge": "Exopunge",
  "cobblemon.move.expunge.desc": "Purges the foe of impurities, dealing super effective damage to Nuclear types.",
  "cobblemon.move.fallout": "Fallout",
  "cobblemon.move.fallout.desc": "Summons a five-turn nuclear fallout to hurt all combatants except the Bug, Nuclear and Steel Types every turn.",
  "cobblemon.move.fissionburst": "Fission Burst",
  "cobblemon.move.fissionburst.desc": "The user explodes to inflict damage on those around it. The user faints upon using this move.",
  "cobblemon.move.flameimpact": "Flame Impact",
  "cobblemon.move.flameimpact.desc": "The user tackles the target at high temps gained by air friction. This attack always goes first.",
  "cobblemon.move.gammaray": "Gamma Ray",
  "cobblemon.move.gammaray.desc": "The user fires a blast of nuclear radiation at the enemy.",
  "cobblemon.move.gemstoneglimmer": "Gemstone Glimmer",
  "cobblemon.move.gemstoneglimmer.desc": "Unleashes a blinding light from its body. May lower the foe's accuracy.",
  "cobblemon.move.goldenfist": "Golden Fist",
  "cobblemon.move.goldenfist.desc": "The user slogs the opponent with a fist made of solid gold. Scatters coins which can be picked up after the battle.",
  "cobblemon.move.infernalblade": "Infernal Blade",
  "cobblemon.move.infernalblade.desc": "The user slashes the foe with cursed fire, hits Fairy-type for super effective damage and may also burn.",
  "cobblemon.move.instantcrush": "Instant Crush",
  "cobblemon.move.instantcrush.desc": "The user compresses the foe with its psychic powers. This attack always goes first.",
  "cobblemon.move.metalcruncher": "Metal Cruncher",
  "cobblemon.move.metalcruncher.desc": "The user crunches up the target with metal fangs. It has a high chance of lowering the target's Defense.",
  "cobblemon.move.metalwhip": "Metal Whip",
  "cobblemon.move.metalwhip.desc": "A whip made of sharp steel used to hurt and hold the enemy.",
  "cobblemon.move.nuclearslash": "Nuclear Slash",
  "cobblemon.move.nuclearslash.desc": "The target is attacked with a slash of claws or blades. Critical hits land more easily.",
  "cobblemon.move.nuclearwaste": "Nuclear Waste",
  "cobblemon.move.nuclearwaste.desc": "Spits toxic, radioactive sludge that badly poisons the foe.",
  "cobblemon.move.oceanswrath": "Ocean's Wrath",
  "cobblemon.move.oceanswrath.desc": "Traps foes in a giant whirlpool for four to fice turns.",
  "cobblemon.move.protonbeam": "Proton Beam",
  "cobblemon.move.protonbeam.desc": "The user unleashes a powerful, radioactive blast blast on the enemy. However, it lowers the user's special attack by two stages.",
  "cobblemon.move.quantumleap": "Quantum Leap",
  "cobblemon.move.quantumleap.desc": "The user vanishes in the first turn and attacks the foe with full power in the next turn.",
  "cobblemon.move.radioacid": "Radioacid",
  "cobblemon.move.radioacid.desc": "The user shoots a powerful blast made of radioactive waste. It may cause a burn.",
  "cobblemon.move.skyfall": "Sky Fall",
  "cobblemon.move.skyfall.desc": "The user pressurizes the air around the target, crushing it. It may leave the target with paralysis.",
  "cobblemon.move.suddenstrike": "Sudden Strike",
  "cobblemon.move.suddenstrike.desc": "The user attacks the target suddenly and without mercy.",
  "cobblemon.move.thundertorm": "Thunderstorm",
  "cobblemon.move.thundertorm.desc": "Summons a five-thurn thunderstorm that will boost the power of electric types.",
  "cobblemon.move.flashpulse": "Flash Pulse",
  "cobblemon.move.flashpulse.desc": "The target is attacked with a wave of light generated by the user’s body. The attack may confuse the target.",
  "cobblemon.move.bansheesscream": "Banshee's Scream",
  "cobblemon.move.bansheesscream.desc": "The user lets out a terrifying whail, this might cause the opposing pokemon to faint in three turns.",
  "cobblemon.move.flashbang": "Flashbang",
  "cobblemon.move.flashbang.desc": "The user blinds the target with a bright explosion of light before switching out with a waiting Pokémon.",
  "cobblemon.move.fiesta": "Fiesta",
  "cobblemon.move.fiesta.desc": "The user scatters delicious candy on its side of the field. This candy heals pokemon who switch in.",
  "cobblemon.move.bugbuzzsound": "Bug Buzz",
  "cobblemon.move.bugbuzzsound.desc": "The user generates a damaging sound wave by vibration. The move may use Bug-Type or Sound-Type. This may also lower the target’s Sp. Def stat.",
  "cobblemon.move.boomburstsound": "Boomburst",
  "cobblemon.move.boomburstsound.desc": "The user attacks everything around it with the destructive power of a terrible, explosive sound.",
  "cobblemon.move.chattersound": "Chatter",
  "cobblemon.move.chattersound.desc": "The user attacks the target with sound waves of deafening chatter. This confuses the target.",
  "cobblemon.move.disarmingvoicesound": "Disarming Voice",
  "cobblemon.move.disarmingvoicesound.desc": "Letting out a charming cry, the user does emotional damage to opposing Pokémon. The move may use Fairy-Type or Sound-Type. This attack never misses.",
  "cobblemon.move.echoedvoicesound": "Echoed Voice",
  "cobblemon.move.echoedvoicesound.desc": "The user attacks the target with an echoing voice. If this move is used every turn, its power is increased.",
  "cobblemon.move.healbellsound": "Heal Bell",
  "cobblemon.move.healbellsound.desc": "The user makes a soothing bell chime to heal the status conditions of all the party Pokémon.",
  "cobblemon.move.howlsound": "Howl",
  "cobblemon.move.howlsound.desc": "The user howls loudly to raise the spirit of itself and allies. This raises their Attack stats.",
  "cobblemon.move.hypervoicesound": "Hyper Voice",
  "cobblemon.move.hypervoicesound.desc": "The user lets loose a horribly echoing shout with the power to inflict damage.",
  "cobblemon.move.nobleroarsound": "Noble Roar",
  "cobblemon.move.nobleroarsound.desc": "Letting out a noble roar, the user intimidates the target and lowers its Attack and Sp. Atk stats.",
  "cobblemon.move.perishsongsound": "Perish Song",
  "cobblemon.move.perishsongsound.desc": "Any Pokémon that hears this song faints in three turns, unless it switches out of battle.",
  "cobblemon.move.relicsongsound": "Relic Song",
  "cobblemon.move.relicsongsound.desc": "The user sings an ancient song and attacks by appealing to the hearts of the listening opposing Pokémon. This may also induce sleep.",
  "cobblemon.move.roarsound": "Roar",
  "cobblemon.move.roarsound.desc": "The target is scared off, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon.",
  "cobblemon.move.roundsound": "Round",
  "cobblemon.move.roundsound.desc": "The user attacks the target with a song. Others can join in the Round to increase the power of the attack.",
  "cobblemon.move.screechsound": "Screech",
  "cobblemon.move.screechsound.desc": "An earsplitting screech harshly lowers the target’s Defense stat.",
  "cobblemon.move.singsound": "Sing",
  "cobblemon.move.singsound.desc": "A soothing lullaby is sung in a calming voice that puts the target into a deep slumber.",
  "cobblemon.move.sleeptalksound": "Sleep Talk",
  "cobblemon.move.sleeptalksound.desc": "While it is asleep, the user randomly uses one of the moves it knows.",
  "cobblemon.move.snoresound": "Snore",
  "cobblemon.move.snoresound.desc": "This attack can be used only if the user is asleep. The harsh noise may also make the target flinch.",
  "cobblemon.move.sonicboomsound": "Sonic Boom",
  "cobblemon.move.sonicboomsound.desc": "The target is hit with a destructive shock wave that always inflicts 20 HP damage.",
  "cobblemon.move.sparklingariasound": "Sparkling Aria",
  "cobblemon.move.sparklingariasound.desc": "The user bursts into song, emitting many bubbles. The move may use Water-Type or Sound-Type. Any Pokémon suffering from a burn will be healed by the touch of these bubbles.",
  "cobblemon.move.supersonicsound": "Supersonic",
  "cobblemon.move.supersonicsound.desc": "The user generates odd sound waves from its body that confuse the target.",
  "cobblemon.move.shadowblast": "Shadow Blast",
  "cobblemon.move.shadowblast.desc": "A wicked blade of air is shot at the target to inflict damage. Critical hits land more easily.",
  "cobblemon.move.shadowblitz": "Shadow Blitz",
  "cobblemon.move.shadowblitz.desc": "The user throws this tackle while casting a shadowy aura.",
  "cobblemon.move.shadowbolt": "Shadow Bolt",
  "cobblemon.move.shadowbolt.desc": "A shadowy electric blast crashes down on the target. This may also leave the target with paralysis.",
  "cobblemon.move.shadowbreak": "Shadow Break",
  "cobblemon.move.shadowbreak.desc": "A shattering ram attack with a shadowy aura.",
  "cobblemon.move.shadowchill": "Shadow Chill",
  "cobblemon.move.shadowchill.desc": "The target is struck with a shadowy ice attack. This may also leave the target frozen.",
  "cobblemon.move.shadowdown": "Shadow Down",
  "cobblemon.move.shadowdown.desc": "A shadowy aura harshly lowers the target’s Defense stat.",
  "cobblemon.move.shadowend": "Shadow End",
  "cobblemon.move.shadowend.desc": "The user attacks the target with a shadowy aura ram attack. This also damages the user terribly.",
  "cobblemon.move.shadowfire": "Shadow Fire",
  "cobblemon.move.shadowfire.desc": "The target is scorched with a shadowy fireball attack. This may also leave the target with a burn.",
  "cobblemon.move.shadowhalf": "Shadow Half",
  "cobblemon.move.shadowhalf.desc": "A shadowy aura energy cuts everyone's HP by half.",
  "cobblemon.move.shadowhold": "Shadow Hold",
  "cobblemon.move.shadowhold.desc": "The user summons a shadowy aura to trap the opponent's Pokémon.",
  "cobblemon.move.shadowmist": "Shadow Mist",
  "cobblemon.move.shadowmist.desc": "A shadowy aura that harshly lowers opposing Pokémon’s evasiveness.",
  "cobblemon.move.shadowpanic": "Shadow Panic",
  "cobblemon.move.shadowpanic.desc": "The opponent's pokemon are exposed to a shadowy aura that triggers confusion.",
  "cobblemon.move.shadowrave": "Shadow Rave",
  "cobblemon.move.shadowrave.desc": "The user attacks everything around it by summoning a shadowy aura in the ground that launches spikes.",
  "cobblemon.move.shadowrush": "Shadow Rush",
  "cobblemon.move.shadowrush.desc": "The user executes a tackle while exuding a shadowy aura.",
  "cobblemon.move.shadowshed": "Shadow Shed",
  "cobblemon.move.shadowshed.desc": "A shadowy aura that eliminates Light Screen and Reflect.",
  "cobblemon.move.shadowstorm": "Shadow Storm",
  "cobblemon.move.shadowstorm.desc": "The user uses its shadowy aura to whip up a vicious tornado that attacks everything around it.",
  "cobblemon.move.shadowwave": "Shadow Wave",
  "cobblemon.move.shadowwave.desc": "The user attacks everything around it with shadowy aura waves that are set loose.",
  "cobblemon.move.crystallization": "Crystallization",
  "cobblemon.move.crystallization.desc": "The user glares and petrifies the foe, turning them into the Crystal-type.",
  "cobblemon.move.astralshot": "Astral Shot",
  "cobblemon.move.astralshot.desc": "A shooting star is launched at the foe at an incredibly high speed.",
  "cobblemon.move.bigbang": "Big Bang",
  "cobblemon.move.bigbang.desc": "The user unleashes a burst of cosmic energy that hits all in battle, and may not leave a status condition.",
  "cobblemon.move.cometshower": "Comet Shower",
  "cobblemon.move.cometshower.desc": "Powerful comets are raining down on the users surroundings. It may also make the targets flinch.",
  "cobblemon.move.cosmicray": "Cosmic Ray",
  "cobblemon.move.cosmicray.desc": "A beam of concentrated cosmic energy is unleashed at the foe. It may cause the target to flinch.",
  "cobblemon.move.decapattack": "Decap Attack",
  "cobblemon.move.decapattack.desc": "The user removes his head and launches it at the foe. This also damages the user.",
  "cobblemon.move.dejavu": "Déjà-vu",
  "cobblemon.move.dejavu.desc": "The user disrupts space-time to discombobulate the foe. This move can't miss.",
  "cobblemon.move.nailflick": "Nail Flick",
  "cobblemon.move.nailflick.desc": "The user charges up a powerful flick of a sharp claw or nail. Critical hits land more easily.",
  "cobblemon.move.nostrilflare": "Nostril Flare",
  "cobblemon.move.nostrilflare.desc": "Before the opponent attacks, the user unleashes a quick flame from its nostrils.",
  "cobblemon.move.cometcrash": "Comet Crash",
  "cobblemon.move.cometcrash.desc": "The target is knocked away, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon.",
  "cobblemon.move.starshot": "Star Shot",
  "cobblemon.move.starshot.desc": "Gathering cosmic energy, the user attacks the target. This move always goes first when Gravity is increased.",
  "cobblemon.move.supernova": "Supernova",
  "cobblemon.move.supernova.desc": "The user attacks everything around it by causing a tremendous explosion. The user faints upon using this move.",
  "cobblemon.move.rhythmstrike": "Rhythm Strike",
  "cobblemon.move.rhythmstrike.desc": "The user overwhelms the target with Rhythmic strikes. This also lowers the target’s Defense and Special Defense stat.",
  "cobblemon.move.pentascale": "Penta Scale",
  "cobblemon.move.pentascale.desc": "The user hits the target with a five tone burst of sound. This move may hit two to five times.",
  "cobblemon.move.aircannon": "Air Cannon",
  "cobblemon.move.aircannon.desc": "The user launches a ball of wind at the target. This move always goes first.",
  "cobblemon.move.aquaslam": "Aqua Slam",
  "cobblemon.move.aquaslam.desc": "The user surrounds itself ina  bubble of water and then slams against the target. It may also lower its Speed Stat.",
  "cobblemon.move.bugbomb": "Bug Bomb",
  "cobblemon.move.bugbomb.desc": "The user throws itself at the target, hitting the target with its exoskeleton. This may also leave the target paralyzed.",
  "cobblemon.move.crackleslam": "Crackle Slam",
  "cobblemon.move.crackleslam.desc": "The user builds up electricity on its body, then attacks the target with a strong slam. This may also make the target flinch.",
  "cobblemon.move.diamondclaw": "Diamond Claw",
  "cobblemon.move.diamondclaw.desc": "The target is raked with claws as hard as diamnd. This might raise the User's Defense.",
  "cobblemon.move.dragonhide": "Dragon Hide",
  "cobblemon.move.dragonhide.desc": "The user toughens its scales to raise its Defense and Special Defense Stats.",
  "cobblemon.move.dragonicbloom": "Dragonic Bloom",
  "cobblemon.move.dragonicbloom.desc": "The user bombards the opponent with petals split away from its body. This move can be Dragon or Grass type depending on the effectiveness.",
  "cobblemon.move.dragonicflare": "Dragonic Flare",
  "cobblemon.move.dragonicflare.desc": "The user releases a powerful blast of heat from its body. This move can be Dragon or Fire type depending on the effectiveness.",
  "cobblemon.move.dragonicglow": "Dragonic Glow",
  "cobblemon.move.dragonicglow.desc": "The user unleashes arrows of light from its body. This move can be Dragon or Fairy type depending on the effectiveness.",
  "cobblemon.move.dragonicstrike": "Dragonic Strike",
  "cobblemon.move.dragonicstrike.desc": "The user strikes the target with powerful electricity from its body. This move can be Dragon or Electric type depending on the effectiveness.",
  "cobblemon.move.dragonicwave": "Dragonic Wave",
  "cobblemon.move.dragonicwave.desc": "The user forces a wave of energy at the target. This move can be Dragon or Electric type depending on the effectiveness.",
  "cobblemon.move.dragonimpact": "Dragon Impact",
  "cobblemon.move.dragonimpact.desc": "The user charges at the target with great force. However, this also lowers the user’s Attack and Defense stats.",
  "cobblemon.move.dryice": "Dry Ice",
  "cobblemon.move.dryice.desc": "The target is hit with a piece of dry ice. IT may also burn or freeze the target.",
  "cobblemon.move.dustydash": "Dusty Dash",
  "cobblemon.move.dustydash.desc": "The user dashes at the opponent with a Sandy Aura, this attack always goes first and may cause flinching.",
  "cobblemon.move.fever": "Fever",
  "cobblemon.move.fever.desc": "The user infects the opponent with a blast of pathogen. It may also burn the target.",
  "cobblemon.move.feyhammer": "Fey Hammer",
  "cobblemon.move.feyhammer.desc": "The user delivers a crushing blow infused with mystical energy.",
  "cobblemon.move.fireworks": "Fireworks",
  "cobblemon.move.fireworks.desc": "The user rapidly shoots the target. This may also leave the target paralyzed. This move is super effective on Flying-types.",
  "cobblemon.move.galerush": "Gale Rush",
  "cobblemon.move.galerush.desc": "The user wraps itself in strong wind, then tackles the opponent. This may also make the target flinch.",
  "cobblemon.move.geosphere": "Geo-Sphere",
  "cobblemon.move.geosphere.desc": "The user draws power from the earth, creating a sphere of energy. This move hits Pokémon that are in the air.",
  "cobblemon.move.geodecannon": "Geode Cannon",
  "cobblemon.move.geodecannon.desc": "The user attacks with a ray of light that sparkles as if it were made of geodes.",
  "cobblemon.move.ghastlywail": "Ghastly Wail",
  "cobblemon.move.ghastlywail.desc": "The user lets out a terrifying shriek, damaging every Pokémon around it.",
  "cobblemon.move.glaciercrash": "Glacier Crash",
  "cobblemon.move.glaciercrash.desc": "The user sets off a glacier that crashes into every Pokémon around it.",
  "cobblemon.move.jewelflash": "Jewel Flash",
  "cobblemon.move.jewelflash.desc": "The user attacks by shooting flashes of jewels at the opposing team. It may also lower the target's accuracy.",
  "cobblemon.move.leafdarts": "Leaf Darts",
  "cobblemon.move.leafdarts.desc": "The user launches three darts made of leaves at the target. It is sure to strike first.",
  "cobblemon.move.lightningstrike": "Lightning Strike",
  "cobblemon.move.lightningstrike.desc": "The user strikes the foe with a lightning strike. It may also confuse the target.",
  "cobblemon.move.megalofang": "Megalo Fang",
  "cobblemon.move.megalofang.desc": "The user tears apart the target with its sharp fangs. It may also make the target flinch.",
  "cobblemon.move.mesmersmoke": "Mesmer Smoke",
  "cobblemon.move.mesmersmoke.desc": "All Pokémon around the user are attacked with smoke that makes them sleep.",
  "cobblemon.move.mindblast": "Mind Blast",
  "cobblemon.move.mindblast.desc": "A strong mental blast hits the targets mind. It may also cause confusion.",
  "cobblemon.move.phantomgrip": "Phantom Grip",
  "cobblemon.move.phantomgrip.desc": "The user grips at the target with an arm made of shadow, which lowers the target's Speed.",
  "cobblemon.move.quicksand": "Quicksand",
  "cobblemon.move.quicksand.desc": "The user traps the target inside Quicksand for four to five turns. The target can't flee during this time.",
  "cobblemon.move.razorblade": "Razor Blade",
  "cobblemon.move.razorblade.desc": "The target is attacked with a slash by metallic blades. Critical hits land more easily.",
  "cobblemon.move.ripplewave": "Ripple Wave",
  "cobblemon.move.ripplewave.desc": "The target is washed away by strong waves of water. The target is hit twice in a row.",
  "cobblemon.move.siphonbite": "Siphon Bite",
  "cobblemon.move.siphonbite.desc": "An energy-draining bite. The user's HP is restored by half the damage taken by the target.",
  "cobblemon.move.sulfuricspray": "Sulfuric Spray",
  "cobblemon.move.sulfuricspray.desc": "The user sprays the target. This attack ignores Steel-Type's immunity to Poison-Type.",
  "cobblemon.move.talongash": "Talon Gash",
  "cobblemon.move.talongash.desc": "The user attacks the target with its powerful strong talons. The target is hit twice in a row.",
  "cobblemon.move.tikitorch": "TIki Torch",
  "cobblemon.move.tikitorch.desc": "The user flings a burning piece of wood at the target. This may also leave the target with a burn.",
  "cobblemon.move.trickshot": "Trick Shot",
  "cobblemon.move.trickshot.desc": "The user distracts the target, then shoots them with small rocks or other pellets. This may also make the target flinch.",
  "cobblemon.move.defogwind": "Defog",
  "cobblemon.move.defogwind.desc": "A strong wind blows away the target’s barriers such as Reflect or Light Screen. This also lowers the target’s evasiveness.",
  "cobblemon.move.gustwind": "Gust",
  "cobblemon.move.gustwind.desc": "A gust of wind is whipped up by wings and launched at the target to inflict damage.",
  "cobblemon.move.hurricanewind": "Hurricane",
  "cobblemon.move.hurricanewind.desc": "The user attacks by wrapping its opponent in a fierce wind that flies up into the sky. This may also confuse the target.",
  "cobblemon.move.razorwindwind": "Razor Wind",
  "cobblemon.move.razorwindwind.desc": "In this two-turn attack, blades of wind hit opposing Pokémon on the second turn. Critical hits land more easily.",
  "cobblemon.move.tailwindwind": "Tailwind",
  "cobblemon.move.tailwindwind.desc": "The user whips up a turbulent whirlwind that ups the Speed stats of the user and its allies for four turns.",
  "cobblemon.move.twisterwind": "Twister",
  "cobblemon.move.twisterwind.desc": "The user whips up a vicious tornado to tear at opposing Pokémon. The move may use Dragon-Type or Wind-Type. This may also make them flinch.",
  "cobblemon.move.whirlwindwind": "Whirlwind",
  "cobblemon.move.whirlwindwind.desc": "The target is blown away, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon.",
  "cobblemon.move.ancientroarsound": "Ancient Roar",
  "cobblemon.move.ancientroarsound.desc": "The user's voice shakes with a primal roar, damaging its foes with pure fear. The move may use Rock-Type or Sound-Type.",
  "cobblemon.move.drakonvoicesound": "Drakon Voice",
  "cobblemon.move.drakonvoicesound.desc": "The sheer force of the user's draconic deals damage using the Dragon-Type or Sound-Type.",
  "cobblemon.move.atomsplitnuclear": "Atom Split",
  "cobblemon.move.atomsplitnuclear.desc": "The user attacks everything around it by causing a tremendous explosion. The user faints upon using this move.",
  "cobblemon.move.wormholecosmic": "Wormhole",
  "cobblemon.move.wormholecosmic.desc": "The user rips a hole in space- always striking first.",
  "cobblemon.move.swiftcosmic": "Swift",
  "cobblemon.move.swiftcosmic.desc": "Star-shaped rays are shot at opposing Pokémon. This attack never misses.",
  "cobblemon.move.cosmicpowercosmic": "Cosmic Power",
  "cobblemon.move.cosmicpowercosmic.desc": "The user absorbs a mystical power from space to raise its Defense and Sp. Def stats.",
  "cobblemon.move.meteormashcosmic": "Meteor Mash",
  "cobblemon.move.meteormashcosmic.desc": "The target is hit with a hard punch fired like a meteor. The move may use Steel-Type or Cosmic-Type. This may also raise the user’s Attack stat.",
  "cobblemon.move.photongeyserlight": "Photon Geyser",
  "cobblemon.move.photongeyserlight.desc": "The user attacks a target with a pillar of light. This move inflicts Attack or Sp. Atk damage—whichever stat is higher for the user.",
  "cobblemon.move.flashlight": "Flash",
  "cobblemon.move.flashlight.desc": "The user flashes a bright light that cuts the target’s accuracy.",
  "cobblemon.move.barrierlight": "Barrier",
  "cobblemon.move.barrierlight.desc": "The user throws up a sturdy wall that sharply raises its Defense stat.",
  "cobblemon.move.reflectlight": "Reflect",
  "cobblemon.move.reflectlight.desc": "A wondrous wall of light is put up to reduce damage from physical attacks for five turns.",
  "cobblemon.move.lightscreenlight": "Light Screen",
  "cobblemon.move.lightscreenlight.desc": "A wondrous wall of light is put up to reduce damage from special attacks for five turns.",
  "cobblemon.move.spotlightlight": "Spotlight",
  "cobblemon.move.spotlightlight.desc": "The user shines a spotlight on the target so that only the target will be attacked during the turn.",
  "cobblemon.move.signalbeamlight": "Signal Beam",
  "cobblemon.move.signalbeamlight.desc": "The user attacks with a sinister beam of light. This may also confuse the target. The move may use Bug-Type or Light-Type.",
  "cobblemon.move.flashcannonlight": "Flash Cannon",
  "cobblemon.move.flashcannonlight.desc": "The user gathers all its light energy and releases it all at once. This may also lower the target’s Sp. Def stat. The move may use Steel-Type or Light-Type.",
  "cobblemon.move.prismaticlaserlight": "Prismatic Laser",
  "cobblemon.move.prismaticlaserlight.desc": "The user shoots powerful lasers using the power of a prism. The user can’t move on the next turn. The move may use Psychic-Type or Light-Type.",
  "cobblemon.move.powergemcrystal": "Power Gem",
  "cobblemon.move.powergemcrystal.desc": "The user attacks with a ray of light that sparkles as if it were made of gemstones.",
  "cobblemon.move.diamondstormcrystal": "Diamond Storm",
  "cobblemon.move.diamondstormcrystal.desc": "The user whips up a storm of diamonds to damage opposing Pokémon. This may also sharply raise the user’s Defense stat.",
  "cobblemon.move.diamondclawcrystal": "Diamond Claw",
  "cobblemon.move.diamondclawcrystal.desc": "The target is raked with claws as hard as diamnd. This might raise the User's Defense.",
  "cobblemon.move.gemstoneglimmercrystal": "Gemstone Glimmer",
  "cobblemon.move.gemstoneglimmercrystal.desc": "Unleashes a blinding light from its body. May lower the foe's accuracy.",
  "cobblemon.move.jewelflashcrystal": "Jewel Flash",
  "cobblemon.move.jewelflashcrystal.desc": "The user attacks by shooting flashes of jewels at the opposing team. It may also lower the target's accuracy.",
  "cobblemon.move.reflectivecloak": "Reflective Cloak",
  "cobblemon.move.reflectivecloak.desc": "This move enables the user to protect itself from all attacks. Its chance of failing rises if it is used in succession.",
  "cobblemon.move.polyblast": "Poly Blast",
  "cobblemon.move.polyblast.desc": "The user attacks the target with a pulsing blast of molten plastic. This may also burn the target.",
  "cobblemon.move.constructionblocks": "Construction Blocks",
  "cobblemon.move.constructionblocks.desc": "The user lays a trap of toy construction blocks around the opposing team. The trap hurts opposing Pokémon that switch into battle.",
  "cobblemon.move.echoingblow": "Echoing Blow",
  "cobblemon.move.echoingblow.desc": "The user punches the opponent with a resonanting impact.",
  "cobblemon.move.polygonalsword": "Polygonal Sword",
  "cobblemon.move.polygonalsword.desc": "The user creates a sword from the digital world and slashes the enemy. Critical hits land more easily.",
  "cobblemon.move.superstar": "Superstar",
  "cobblemon.move.superstar.desc": "The user creates an 8-Bit shining star that makes them temporarily invincible and then it charges into the target. The user can't move next turn.",
  "cobblemon.move.spam": "Spam",
  "cobblemon.move.spam.desc": "The user sends a barrage of spam email at the target two to five times in a row.",
  "cobblemon.move.flop": "Flop",
  "cobblemon.move.flop.desc": "The user flops onto the target with its full body weight, the move has a higher chance for a critical hit. This also damages the user a little.",
  "cobblemon.move.tendril": "Tendril",
  "cobblemon.move.tendril.desc": "The user strikes the foe with a slimy tendril. This lowers the Speed stats of those hit.",
  "cobblemon.move.slimyspit": "Slimy Spit",
  "cobblemon.move.slimyspit.desc": "A spray of sticky slime is jetted at the opposing Pokémon. This may also lower their Speed stat.",
  "cobblemon.move.tornado": "Tornado",
  "cobblemon.move.tornado.desc": "The user attacks everything around it by invading its surroundings with a giant tornado.",
  "cobblemon.move.ozonebeam": "Ozone Beam",
  "cobblemon.move.ozonebeam.desc": "The user shoots ozone and other gases at the target to attack. This may also poison the target.",
  "cobblemon.move.squallstrike": "Squall Strike",
  "cobblemon.move.squallstrike.desc": "The target is attacked with a violent strike that produces a gust of wind. This may also leave the target confused.",
  "cobblemon.move.crystalrush": "Crystal Rush",
  "cobblemon.move.crystalrush.desc": "The user turns to solid crystal, hitting first.",
  "cobblemon.move.eevoboost": "Eevoboost",
  "cobblemon.move.eevoboost.desc": "The user slowly gathers its inner potential, uncovering a power that raises all stats.",
  "cobblemon.move.thunderstorm": "Thunderstorm",
  "cobblemon.move.thunderstorm.desc": "Summons a five-turn thunderstorm to boost the power of Electric-Types.",
  "cobblemon.move.shadowsky": "Shadow Sky",
  "cobblemon.move.shadowsky.desc": "Summons a five-turn shadowy aura to hurt all combatants except Shadow-type Pokémon.",
  "cobblemon.move.cymbalcrash": "Cymbal Crash",
  "cobblemon.move.cymbalcrash.desc": "The user bangs its cymbals together against the target's head. The attack may confuse the target.",
  "cobblemon.move.halflife": "Half-Life",
  "cobblemon.move.halflife.desc": "The user cuts the target's HP in half.",
  "cobblemon.move.geodecannoncrystal": "Geode Cannon",
  "cobblemon.move.geodecannoncrystal.desc": "The user attacks with a ray of light that sparkles as if it were made of geodes.",
  "cobblemon.move.gravitycosmic": "Gravity",
  "cobblemon.move.gravitycosmic.desc": "This move enables Flying-type Pokémon or Pokémon with the Levitate Ability to be hit by Ground-type moves. Moves that involve flying can’t be used.",
  
  "cobblemon.battle.weather.acidrain.start": "It started to rain acid!",
  "cobblemon.battle.weather.acidrain.upkeep": "Acid continues to fall.",
  "cobblemon.battle.weather.acidrain.end": "The  acid rain stopped.",
  "cobblemon.battle.weather.darkness.start": "The sky faded to pitch-black!",
  "cobblemon.battle.weather.darkness.upkeep": "The sky is dark.",
  "cobblemon.battle.weather.darkness.end": "The sky brightened again.",
  "cobblemon.battle.weather.fallout.start": "A toxic fallout has set in!",
  "cobblemon.battle.weather.fallout.upkeep": "The toxic fallout rages.",
  "cobblemon.battle.weather.fallout.end": "The  land decontaminated.",
  "cobblemon.battle.weather.thunderstorm.start": "A thunderstorm started!",
  "cobblemon.battle.weather.thunderstorm.upkeep": "The thunderstorm is raging.",
  "cobblemon.battle.weather.thunderstorm.end": "The  thunderstorm subsided.",
  
  "cobblemon.battle.heal.sunbathe": "%1$s restored HP from Sun Bathe!",
  "cobblemon.battle.heal.phototroph": "%1$s restored HP from Phototroph!",
  
  "cobblemon.battle.sidestart.constructionblocks": "Plastic bricks are scattered around %1$s team!",
  "cobblemon.battle.sidestart.brace": "%1$s braces for impact!",
  "cobblemon.battle.sidestart.fiesta": "Candy was scattered on the ground all around %1$s team!",
  
  "cobblemon.battle.sideend.constructionblocks": "The plastic bricks disappeared from around %1$s team!",
  "cobblemon.battle.sideend.fiesta": "The candy disappeared from around %1$s team!",
  "cobblemon.battle.sideend.brace": "%1$s is no longer bracing for impact!",
  
  "cobblemon.battle.damage.constructionblocks": "Plastic bricks dug into %1$s!",
  "cobblemon.battle.damage.acidrain": "%1$s was melted by the acid rain.",
  "cobblemon.battle.damage.asteroidbelt": "%1$s was battered by the asteroids.",
  "cobblemon.battle.damage.fallout": "%1$s was irradiated by the toxic fallout.",
  
  "cobblemon.ability.orbitaltide": "Orbital Tide",
  "cobblemon.ability.orbitaltide.desc": "Gravity is intensified while on the field.",
  "cobblemon.ability.perforate": "Perforate",
  "cobblemon.ability.perforate.desc": "Moves of the same type as the Pokémon ignore immunities.",
  "cobblemon.ability.permafrost": "Permafrost",
  "cobblemon.ability.permafrost.desc": "Boosts the Pokémon's Defense in a hailstorm.",
  "cobblemon.ability.pollution": "Pollution",
  "cobblemon.ability.pollution.desc": "The Pokémon summons acid rain in battle.",
  "cobblemon.ability.psychout": "Psych Out",
  "cobblemon.ability.psychout.desc": "Lowers the foe's Special Attack stat.",
  "cobblemon.ability.scavenger": "Scavenger",
  "cobblemon.ability.scavenger.desc": "Regains HP after knocking out any Pokémon.",
  "cobblemon.ability.sunbathe": "Sunbathe",
  "cobblemon.ability.sunbathe.desc": "The Pokémon gradually regains HP in sunlight.",
  "cobblemon.ability.terrorize": "Terrorize",
  "cobblemon.ability.terrorize.desc": "Normal-type moves become Ghost-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.digitize": "Derrorize",
  "cobblemon.ability.digitize.desc": "Normal-type moves become Digital-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.fossilize": "Fossilize",
  "cobblemon.ability.fossilize.desc": "Normal-type moves become Rock-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.allure": "Allure",
  "cobblemon.ability.allure.desc": "Lowers the evasiveness of foes of the opposite gender.",
  "cobblemon.ability.conundrum": "Conundrum",
  "cobblemon.ability.conundrum.desc": "Contact with the Pokémon may confuse the attacker.",
  "cobblemon.ability.feedback": "Feedback",
  "cobblemon.ability.feedback.desc": "Inflicts damage to Pokémon when attacked with non-contact moves.",
  "cobblemon.ability.highnoon": "High Noon",
  "cobblemon.ability.highnoon.desc": "Makes most moves lose their priority.",
  "cobblemon.ability.absolution": "Absolution",
  "cobblemon.ability.absolution.desc": "Boosts the Sp. Atk stat when the New Moon is active, but HP decreases every turn.",
  "cobblemon.ability.amplifier": "Amplifier",
  "cobblemon.ability.amplifier.desc": "This Pokemon's sound-based moves have their power multiplied by 1.25.",
  "cobblemon.ability.athenian": "Athenian",
  "cobblemon.ability.athenian.desc": "Doubles the Pokémon’s Special Attack stat.",
  "cobblemon.ability.castlemoat": "Castle Moat",
  "cobblemon.ability.castlemoat.desc": "Boosts the Special Defense stat if hit by a Water-type move instead of taking damage.",
  "cobblemon.ability.eventhorizon": "Event Horizon",
  "cobblemon.ability.eventhorizon.desc": "Any Pokémon that contacts this one can't escape.",
  "cobblemon.ability.foundry": "Foundry",
  "cobblemon.ability.foundry.desc": "Rock-type moves become Fire-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.heliophobia": "Heliophobia",
  "cobblemon.ability.heliophobia.desc": "Restores HP in the Darkness. Reduces HP in harsh sunlight, and increases the damage received from Light-type moves.",
  "cobblemon.ability.hubris": "Hubris",
  "cobblemon.ability.hubris.desc": "The Pokémon shows hubris, and that boosts the Special Attack stat after knocking out any Pokémon.",
  "cobblemon.ability.intoxicate": "Intoxicate",
  "cobblemon.ability.intoxicate.desc": "Normal-type moves become Poison-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.noctem": "Noctem",
  "cobblemon.ability.noctem.desc": "The user summons darkness and blots out the sky as it enters the battle.",
  "cobblemon.ability.phototroph": "Phototroph",
  "cobblemon.ability.phototroph.desc": "The user gradually regains HP in sunny weather.",
  "cobblemon.ability.psychocall": "Psycho Call",
  "cobblemon.ability.psychocall.desc": "Powers up Psychic-type moves in a pinch.",
  "cobblemon.ability.shadowcall": "Shadow Call",
  "cobblemon.ability.shadowcall.desc": "Powers up Dark-type moves in a pinch.",
  "cobblemon.ability.shadowdance": "Shadow Dance",
  "cobblemon.ability.shadowdance.desc": "Boosts the Pokémon’s Speed stat when the New Moon is active.",
  "cobblemon.ability.shadowsynergy": "Shadow Synergy",
  "cobblemon.ability.shadowsynergy.desc": "Powers up Dark-type moves.",
  "cobblemon.ability.speedswap": "Speed Swap",
  "cobblemon.ability.speedswap.desc": "Activates the Trick Room effect on entering the battlefield.",
  "cobblemon.ability.spiritcall": "Spirit Call",
  "cobblemon.ability.spiritcall.desc": "Powers up Ghost-type moves in a pinch.",
  "cobblemon.ability.windforce": "Wind Force",
  "cobblemon.ability.windforce.desc": "Boosts the Speed stat if hit by a Flying-type or Wind-type move instead of taking damage.",
  "cobblemon.ability.acceleration": "Acceleration",
  "cobblemon.ability.acceleration.desc": "This Pokemon's speed based moves have their power multiplied by 1.5.",
  "cobblemon.ability.atomizate": "Intoxicate",
  "cobblemon.ability.atomizate.desc": "Normal-type moves become Nuclear-type moves. The power of those moves is boosted a little.",
  "cobblemon.ability.chernobyl": "Chernobyl",
  "cobblemon.ability.chernobyl.desc": "The Pokémon summons a nuclear fallout when it enters battle.",
  "cobblemon.ability.deepfreeze": "Deep Freeze",
  "cobblemon.ability.deepfreeze.desc": "Contact with the Pokémon may freeze the attacker.",
  "cobblemon.ability.disenchant": "Disenchant",
  "cobblemon.ability.disenchant.desc": "Gives full immunity to all fairy type moves.",
  "cobblemon.ability.lazy": "Lazy",
  "cobblemon.ability.lazy.desc": "Starts the battle sleeping.",
  "cobblemon.ability.leadskin": "Lead SKin",
  "cobblemon.ability.leadskin.desc": "Gives full immunity to all nuclear type moves.",
  "cobblemon.ability.petrify": "Petrify",
  "cobblemon.ability.petrify.desc": "The Pokémon petrifies opposing Pokémon upon entering battle, lowering their Speed stat.",
  "cobblemon.ability.sharpcoral": "Sharp Coral",
  "cobblemon.ability.sharpcoral.desc": "Halves defenses but doubles attack power.",
  "cobblemon.ability.soundboost": "Sound Boost",
  "cobblemon.ability.soundboost.desc": "This Pokemon's sound-based moves have their power multiplied by 1.3.",
  "cobblemon.ability.coldwave": "Cold Wave",
  "cobblemon.ability.coldwave.desc": "Contact with the Pokémon may freeze the attacker.",
  "cobblemon.ability.deepsleep": "Deep Sleep",
  "cobblemon.ability.deepsleep.desc": "Restores HP if the Pokémon is asleep.",
  "cobblemon.ability.explode": "Explode",
  "cobblemon.ability.explode.desc": "The Pokémon explodes upon fainting, inflicting damage on those nearby.",
  "cobblemon.ability.frighten": "Frighten",
  "cobblemon.ability.frighten.desc": "The Pokémon frightens opposing Pokémon upon entering battle, lowering their Speed stat.",
  "cobblemon.ability.blackhole": "Black Hole",
  "cobblemon.ability.blackhole.desc": "Prevents Psychic-type and Cosmic-type Pokémon from escaping using its gravitational force.",
  "cobblemon.ability.sprint": "Stamina",
  "cobblemon.ability.sprint.desc": "Boosts the Speed stat when hit by an attack.",
  "cobblemon.ability.tenacity": "Tenacity",
  "cobblemon.ability.tenacity.desc": "May flinch a target when the Pokémon makes contact.",
  "cobblemon.ability.cosmicpresence": "Cosmic Presence",
  "cobblemon.ability.cosmicpresence.desc": "Gravity is intensified while on the field.",
  "cobblemon.ability.xenoforce": "Xenoforce",
  "cobblemon.ability.xenoforce.desc": "Attacks deal an additional 30% while Gravity is active.",
  "cobblemon.ability.escapevelocity": "Escape Velocity",
  "cobblemon.ability.escapevelocity.desc": "Doubles the Pokemon's speed while Gravity is active.",
  "cobblemon.ability.bloodthirst": "Bloodthirst",
  "cobblemon.ability.bloodthirst.desc": "HP is healed when using biting moves.",
  "cobblemon.ability.bouncy": "Bouncy",
  "cobblemon.ability.bouncy.desc": "Inflicts recoil damage to the foe on contact.",
  "cobblemon.ability.unstable": "Unstable",
  "cobblemon.ability.unstable.desc": "The user changes its typing to match any move it is about to use and any move that hits it.",
  "cobblemon.ability.sandman": "Sandman",
  "cobblemon.ability.sandman.desc": "Contact with the user may cause the attacker to fall aslepe.",
  "cobblemon.ability.stormbringer": "Stormbringer",
  "cobblemon.ability.stormbringer.desc": "The Pokémon summons a thunderstorm when it enters battle.",
  "cobblemon.ability.flameeater": "Flame Eater",
  "cobblemon.ability.flameeater.desc": "Restores HP if hit by a Fire-type move.",
  "cobblemon.ability.scarecrow": "Scarecrow",
  "cobblemon.ability.scarecrow.desc": "Gives full immunity to all Flying-type moves.",
  "cobblemon.ability.invigorate": "Invigorate",
  "cobblemon.ability.invigorate.desc": "Normal-type moves become Fighting-type moves. The power of those moves is boosted a little.",
  
  "cobblemon.battle.heal.fiesta": "%1$s ate some candy and restored its HP!"
}