{
  "text.loadingscreentips.tip": "Tip:",
  "text.loadingscreentips.tip.nether_bed": "Place a bed in the nether, it'll be a blast!",
  "text.loadingscreentips.tip.milk": "Drink milk to get rid of potion effects!",
  "text.loadingscreentips.iron_golem": "Iron Golems are the protectors of villages, they will attack you if you attack a villager.",
  "text.loadingscreentips.dirt_sugarcane": "Sugarcane can grow on dirt!",
  "text.loadingscreentips.dig_straight_down": "Digging straight down has a 75% chance of finding a surprise.",
  "text.loadingscreentips.scared_creepers": "Creepers are scared of cats!",
  "text.loadingscreentips.endermen_eyes": "Don't look an enderman in the eyes, or they may get upset.",
  "text.loadingscreentips.herobrine": "§4Fear the steve whose eyes §fglow white.",
  "text.loadingscreentips.illager_bell": "You can ring a bell during a raid to make nearby illagers glow.",
  "text.loadingscreentips.shear_snowgolem": "You can shear a snow golem to remove the jack o' lantern.",
  "text.loadingscreentips.mob_heads": "Wearing a mob head will make it hard for them to detect you, try it out with a creeper!",
  "text.loadingscreentips.basalt_gen": "Basalt can be made from lava flowing onto a space on top of soul soil and adjacent to blue ice.",
  "text.loadingscreentips.brown_mooshroom": "Lightning can transform a red mooshroom into a brown mooshroom.",
  "text.loadingscreentips.axolotl_rename": "You can rename a axolotl in a bucket, and it will keep the name when you place it!",
  "text.loadingscreentips.curse_of_binding": "Cursed armor bound to you? Die to remove it!",
  "text.loadingscreentips.charged_creeper": "When lightning strikes a creeper, something electrifying happens!",
  "text.loadingscreentips.piglin_gold": "Don't forget to wear gold around piglins, or they will become angered.",
  "text.loadingscreentips.warped_mushrooms": "Hoglins fear warped fungus.",
  "text.loadingscreentips.glowstone_portal": "Build a portal out of glowstone to bring you to a world above the clouds.",
  "text.loadingscreentips.evoker": "Evokers can change turn blue sheep red.",
  "text.loadingscreentips.dinnerbone": "Name a mob dinnerbone and see what happens!",
  "text.loadingscreentips.jeb": "Name a sheep 'jeb_' and see what happens!",
  "text.loadingscreentips.flooded_caves": "Flooded caves are a great source of ores!",
  "text.loadingscreentips.goat_horn": "Goat horns makes the same sound as the illager raid horns.",
  "text.loadingscreentips.bad_omen": "Be careful if you have bad omen, you may face a bad time in a village if you do.",
  "text.loadingscreentips.pig_creepers": "Some say that pigs and creepers have a common ancestor.",
  "text.loadingscreentips.nitwit": "Villagers with a green outfit may have trouble finding a job.",
  "text.loadingscreentips.witherskull": "If you're lucky while killing wither skeletons, you may just get a skull.",
  "text.loadingscreentips.villager_witch": "When lightning strikes a villager, it will transform into a witch.",
  "text.loadingscreentips.crossbow_fireworks": "Fireworks can be loaded into a crossbow.",
  "text.loadingscreentips.prevent_endermen_move": "If an enderman is mad at you, look them in the eyes to prevent moving.",
  "text.loadingscreentips.stronghold_rings": "Strongholds generate in rings around the center of the world.",
  "text.loadingscreentips.pink_sheep": "Pink sheep can very rarely spawn.",
  "text.loadingscreentips.mending": "The mending enchantment can fix your tools at the cost of experience.",
  "text.loadingscreentips.fishing": "Fishing can be a good source of both food and loot!",
  "text.loadingscreentips.axolotls": "Axolotls can protect you from the dangers of the sea.",
  "text.loadingscreentips.diamond_ore": "Diamonds are most easily found deep in the deepslate layer of the world.",
  "text.loadingscreentips.grimstone": "Deepslate was originally called grimstone!",
  "text.loadingscreentips.dragon_breath": "You can collect the breath of the ender dragon with just a bottle!",
  "text.loadingscreentips.snow_cauldron": "Powdered snow can accumulate in a cauldron while it's snowing.",
  "text.loadingscreentips.powdered_snow": "Be careful of powdered snow, you can fall right through it and begin freezing.",
  "text.loadingscreentips.trans_bee": "Minecraft bee is trans.",
  "text.loadingscreentips.phantom": "Don't forget to sleep, or the phantoms may awaken.",
  "text.loadingscreentips.stray": "If a skeleton freezes to death, it will become a stray.",
  "text.loadingscreentips.drowned": "If a zombie drowns, it will become a drowned.",
  "text.loadingscreentips.trident": "The trident is a weapon that excels in the water.",
  "text.loadingscreentips.polar_bear": "Polar bears will protect their cubs.",
  "text.loadingscreentips.panda": "Pandas have 6 different personality types: Normal, Lazy, Worried, Playful, Aggressive, Weak, and Brown",
  "text.loadingscreentips.glow_ink": "Use glow ink on a sign to make the text glow.",
  "text.loadingscreentips.slime_moon": "The phase of the moon impacts slimes spawning in swamps, they spawn the most during the full moon.",
  "text.loadingscreentips.azalea_tree": "Dig under an azalea tree, and you will find a lush cave.",
  "text.loadingscreentips.zombie_villager": "Zombies can turn villagers into zombies.",
  "text.loadingscreentips.campfire_bee": "Put a campfire under a bee hive to pacify the bees and safely collect honey.",
  "text.loadingscreentips.goat_mountain": "Be careful around goats, as they may ram into you.",
  "text.loadingscreentips.breed_hoglins": "You can breed hoglins with crimson mushrooms.",
  "text.loadingscreentips.zombified_pigs": "Both hoglins and piglins will zombify when they leave the nether.",
  "text.loadingscreentips.mushroom_island": "If you travel enough, you may find an island with giant mushrooms.",
  "text.loadingscreentips.strider": "Use striders to travel across the vast lava oceans in the nether. They can be lead with a warped mushroom on a stick.",
  "text.loadingscreentips.ocean_monument": "Elder Guardians will give you mining fatigue when you get too close to an ocean monument.",
  "text.loadingscreentips.elder_guardian": "Elder Guardians will drop sponges on death.",
  "text.loadingscreentips.bastion_chest": "When in a piglin bastion, piglins will defend their loot.",
  "text.loadingscreentips.piglin_brute": "Piglins Brutes don't care about gold, and will attack no matter what.",
  "text.loadingscreentips.end_city": "End Cities are found throughout the outer end islands, and they contain some rare loot.",
  "text.loadingscreentips.tipped_arrow": "Put arrows around a lingering potion and you get tipped arrows.",
  "text.loadingscreentips.horses": "Horses are a fast way to travel around the world, and you can breed them to get better stats.",
  "text.loadingscreentips.deepslate": "Once you are below y=0, all stone is replaced by deepslate, which is stronger.",
  "text.loadingscreentips.large_ore_vein": "Large ore veins of copper and iron can be found deep underground.",
  "text.loadingscreentips.bedrock_nether": "Both the top and bottom of the nether has bedrock, an unbreakable block.",
  "text.loadingscreentips.deep_dark": "Legends say there are ancient cities deep underground, with rare treasures found nowhere else.",
  "text.loadingscreentips.swift_sneak": "Swift Sneak is an enchantment that boosts your movement while sneaking.",
  "text.loadingscreentips.frog_magmacubes": "Don't bring your magma cubes near a frog, or it may just get eaten.",
  "text.loadingscreentips.sculk": "Sculk contains souls, and will drop experience when you break it.",
  "text.loadingscreentips.allay": "Give an allay an item, and they will collect more for you!",
  "text.loadingscreentips.frog_types": "Frogs have three types, Cold, Warm, and Temperate, that can be bred in their respective climates.",
  "text.loadingscreentips.sculk_catalyst": "Sculk Catalyst will steal the soul of closely killed mobs, and use it to spread sculk",
  "text.loadingscreentips.wool_occlusion": "Use wool to prevent sounds from echoing down in the deep dark",
  "text.loadingscreentips.frog_breeding": "You can breed frogs with slimeballs.",
  "text.loadingscreentips.warden": "They say a strong beast with echoing power exists in the deepest parts of the world.",
  "text.loadingscreentips.dripstone_clay": "Dripstone under mud can dry it out until it becomes clay.",
  "text.loadingscreentips.dupe_allay": "If you give an allay and amethyst shard while it's dancing to music, it can duplicate",
  "text.loadingscreentips.villager": "Trading with villagers is a great way to get emeralds.",
  "text.loadingscreentips.sculk_shriekers": "Be quiet around sculk shriekers, or you will regret it.",
  "text.loadingscreentips.build_snowgolem": "If you place two blocks of snow with a jack o' lantern atop them, you can build a snowman!",
  "text.loadingscreentips.leather_boots": "Leather boots prevent you from falling through powdered snow!",
  "text.loadingscreentips.shulker_bullet": "If a shulker is hit by a shulker bullet, there is a chance it duplicates!",
  "text.loadingscreentips.enchantability": "Some materials get enchantments better, like gold.",
  "text.loadingscreentips.saturation": "Try to eat larger foods, like cooked meats, they keep you filled for longer.",
  "text.loadingscreentips.armor_trim": "You can find armor trim templates various structures, and use them to add trims to your armor.",
  "text.loadingscreentips.suspicious_sand": "Suspicious sand is a block found in Desert Temples, Desert Wells, and Warm Ocean Ruins, try clicking it with a brush!",
  "text.loadingscreentips.suspicious_gravel": "Suspicious gravel is a block found in Cold Ocean Ruins, and Trail Ruins, try clicking it with a brush!",
  "text.loadingscreentips.trail_ruins": "Trail ruins are an structure containing multiple trim templates, and a unique music disc.",
  "text.loadingscreentips.sherds": "Pottery sherds are pieces of pottery found in the various archaeological structures, in suspicious sand and gravel. Combine 4 to create a decorated pot.",
  "text.loadingscreentips.sniffer_moss": "Sniffer eggs grow two times faster on moss blocks.",
  "text.loadingscreentips.sniffer_egg": "You can find sniffer eggs in warm ocean ruins in suspicious sand.",
  "text.loadingscreentips.sniffing": "Sniffers will occasionally sniff the ground, and pull out ancient seeds that grow plants from the past.",
  "text.loadingscreentips.sniffer_breeding": "Sniffers can be bred with torchflower seeds.",
  "text.loadingscreentips.camel_breeding": "Camels can be bred with cactus.",
  "text.loadingscreentips.camel": "Camels are a great way to traverse the desert, and can be ridden by two players.",
  "text.loadingscreentips.musical_heads": "When you place a head above a note block, it'll play sounds from the mob.",
  "text.loadingscreentips.charged_creeper_heads": "When a charged creeper kills certain mobs, they will drop their head.",
  "text.loadingscreentips.copy_template": "You can copy template items crafting them with 7 diamonds, and their base material.",

  "modmenu.summaryTranslation.loadingscreentips": "Adds loading tips to the world loading screen.",
  "modmenu.descriptionTranslation.loadingscreentips": "Adds loading tips to the world loading screen.",

  "loadingscreentips.midnightconfig.title" : "Loading Screen Tips Config",
  "loadingscreentips.midnightconfig.corner" : "Tips corner",
  "loadingscreentips.midnightconfig.changeTime" : "Change Time",
  "loadingscreentips.midnightconfig.enum.CORNER.BOTTOM_LEFT" : "Bottom Left",
  "loadingscreentips.midnightconfig.enum.CORNER.TOP_LEFT" : "Top Left",
  "loadingscreentips.midnightconfig.enum.CORNER.BOTTOM_RIGHT" : "Bottom Right",
  "loadingscreentips.midnightconfig.enum.CORNER.TOP_RIGHT" : "Top Right",
  "loadingscreentips.midnightconfig.serverLoadingTips" : "Show Tips on Server Loading Screen"



}
