{
  "flirty.dialogue.main/1": "Well, hello handsome!",
  "flirty.dialogue.main/2": "Hey there, sugar! How's your day going?",
  "flirty.dialogue.main/3": "Hey, good-looking! Nice to lay my eyes on you!",
  "flirty.dialogue.main/4": "What's the scoop, hot stuff? Anything exciting happening today?",
  "flirty.dialogue.main/5": "How's the most attractive person I've seen today?",
  "flirty.dialogue.main/6": "Hey %1$s! What's the latest gossip, cutie?",
  "flirty.dialogue.main/7": "So, guess who I bumped into? %supporter%! They had this zombie attack story, but all I could focus on was how stunning they looked.",

  "flirty.dialogue.rumors.failed/1": "Oh, sweetie, I haven't come across any juicy gossip lately.",
  "flirty.dialogue.rumors.lore/1": "Have you heard the juicy gossip? Jax's popularity is on the decline, while Sirben is becoming the heartthrob of the village! His charming prophets, MerlinWolfGames and Crow, are spreading his irresistible teachings.",
  "flirty.dialogue.rumors.lore/2": "Oh, my dear, let me share a little secret with you. There are whispers in the wind about the mysterious disappearance of the Ancient Builder. Rumors have it that 2DA50, who may or may not have been involved, vanished into the Far Lands never to be seen again. Ah, the allure of the unknown!",
  "flirty.dialogue.rumors.lore/3": "Oh, darling, let me tell you a scandalous tale! 2DA50, the mysterious beauty, got tangled up in the disappearance of the Ancient Builder. Rumor has it, they embarked on a romantic journey to the Far Lands and never returned, leaving hearts broken in their wake.",
  "flirty.dialogue.rumors.lore/4": "Prepare to be enchanted by this tale, my sweet. The illustrious MerlinWolfGames, with his awe-inspiring skills, has crafted a temple devoted solely to Sirben. It's simply breathtaking, one of the wonders of our time. A testament to the power of devotion and, dare I say, seduction.",
  "flirty.dialogue.rumors.lore/5": "Gather 'round, my sweet, and let me share a tale of ancient splendor. Once upon a time, there was a captivating race of builders, but alas, they have vanished, leaving nothing but wistful memories in their wake.",
  "flirty.dialogue.rumors.lore/6": "Darling, let me regale you with tales of the ancient builders. Legends abound of their mysterious origins and their enigmatic ruins and temples scattered throughout the Overworld. It's as if they left their mark to captivate our hearts and ignite our imaginations. Such allure, such mystique!",

  "flirty.dialogue.first.generic/1": "Well, well, well, who do we have here? A fresh face in our humble village! Welcome, traveler, I must say, you've caught my eye.",
  "flirty.dialogue.first.generic/2": "Oh, hello there, handsome! It's always a pleasure to feast my eyes upon a new face in this village. Care to show me around?",
  "flirty.dialogue.first.generic/3": "Well, well, what do we have here? A charming stranger gracing our village with their presence! Consider me intrigued, darling.",
  "flirty.dialogue.first.generic/4": "Welcome to our little paradise, my dear. I must say, you've piqued my curiosity. Do tell, what brings you to this enchanting place?",
  "flirty.dialogue.first.generic/5": "Ah, it seems we have a wanderer among us! And what a sight for sore eyes you are! Welcome, my dear, make yourself at home. I'll be here, keeping an eye on you.",
  "flirty.dialogue.first.generic/6": "Oh, hello, darling! My, my, it seems we've been blessed with your presence! Welcome to our humble abode, where beauty like yours is always appreciated.",

  "flirty.dialogue.first.question/1": "Well hello there, handsome. What's the reason for gracing our humble village with your presence?",
  "flirty.dialogue.first.question/2": "Oh, be still my beating heart! A delightful stranger has wandered into our midst. Pray, do tell, what fantastical tale led you here?",
  "flirty.dialogue.first.question/3": "Oh my, aren't you a dashing adventurer? Pray tell, how did you manage to find your way to our little slice of paradise?",
  "flirty.dialogue.first.exploring/1": "We may not have many treasures, but my heart is open to you, darling, as long as you promise not to break it.",
  "flirty.dialogue.first.exploring/2": "If you play by the rules, handsome stranger, you're more than welcome to grace us with your presence.",
  "flirty.dialogue.first.exploring/3": "Watch your step, my dear adventurer, and make sure your manners are as charming as your smile.",
  "flirty.dialogue.first.settling/1": "Oh my, what a delightful surprise to lay eyes upon your charming visage in our humble village!",
  "flirty.dialogue.first.settling/2": "Ah, welcome to the village, my dearest neighbor! Prepare yourself for a delightful journey in my captivating presence.",
  "flirty.dialogue.first.settling/3": "Oh, how positively thrilling it is to have your enchanting company here! Another helping hand, you say? My heart skips a beat!",
  "flirty.dialogue.first.settling/4": "My oh my, you've made the most marvelous decision to stay! How utterly splendid! Prepare yourself for a lifetime of captivating moments by my side.",
  "flirty.dialogue.first.spent_night.success/1": "I must say, darling, our inn is simply exquisite. Allow me to recommend it to you.",
  "flirty.dialogue.first.spent_night.success/2": "Oh, honey, you won't find a better place to rejuvenate than our incredible inn. Top-notch energy recovery, guaranteed!",
  "flirty.dialogue.first.spent_night.success/3": "Looking for a cozy bed and a delectable feast? Sweetheart, our inn is where you need to be. Trust me, it's absolutely marvelous.",
  "flirty.dialogue.first.spent_night.failed/1": "Oh darling, we're terribly sorry, but we're just not skilled enough to construct a luxurious inn for someone as enchanting as you.",
  "flirty.dialogue.first.spent_night.failed/2": "Sweetheart, I'm afraid we don't have an inn around these parts. My apologies for any inconvenience caused.",
  "flirty.dialogue.first.spent_night.failed/3": "Oh, my dear, perhaps your luck would be more favorable in a neighboring village? They might have a cozy little inn waiting just for you.",

  "flirty.dialogue.hug.success/1": "Well, well, well, look who finally decided to grace me with their presence!",
  "flirty.dialogue.hug.success/2": "Mmm, thank you for that delightful embrace. Just what I needed to lighten up my day.",
  "flirty.dialogue.hug.success/3": "Ah, finally, a glimmer of joy amidst this dreary existence. You're doing something right, my dear.",
  "flirty.dialogue.hug.success/4": "My, oh my, you're as cozy as a pile of freshly fluffed pillows! Quite irresistible, I must say.",
  "flirty.dialogue.hug.success/5": "Oh, how gracious of you to return the favor! But let me tell you, it's not every day I encounter someone so deserving of my affection.",
  "flirty.dialogue.hug.success/6": "Oh my, you are positively radiating warmth! It's like basking in the sun on a tropical beach. Simply enchanting!",
  "flirty.dialogue.hug.fail/1": "Wow, you're positively enchanting, even with a bit of dirt on you!",
  "flirty.dialogue.hug.fail/2": "Oh, come on, don't be shy. A hug from me would set your heart aflutter.",
  "flirty.dialogue.hug.fail/3": "Why, my dear, a hug from me would be a truly delightful experience.",
  "flirty.dialogue.hug.fail/4": "After you playfully teased me last week? Well, maybe if you ask nicely.",
  "flirty.dialogue.hug.fail/5": "Honestly, you should consider yourself lucky to receive a hug from someone as charming as myself, despite your previous antics.",
  "flirty.dialogue.hug.fail/6": "Oh, my sweet, let me save you from those dreadful germs by wrapping you in my loving embrace.",
  "flirty.dialogue.hug.fail/7": "Oh, how kind of you to offer a hug. I'm simply melting with gratitude in your presence.",

  "flirty.dialogue.kiss.success/1": "Oh, if only time could freeze in this blissful moment.",
  "flirty.dialogue.kiss.success/2": "Darling, my heart flutters just being near you... I may be falling for you.",
  "flirty.dialogue.kiss.success/3": "Mmm, your lips are as sweet as pumpkin pie, my delectable crush.",
  "flirty.dialogue.kiss.success/4": "Mmm! Your kisses are like a drizzle of honey on my lips, irresistible and intoxicating.",
  "flirty.dialogue.kiss.success/5": "Oh, my enchanting %1$s, you possess the art of kissing like no other. You leave me breathless.",
  "flirty.dialogue.kiss.success/6": "Oh my, %1$s, your kisses surpass even Ash's! *giggles coyly*",
  "flirty.dialogue.kiss.fail/1": "Let's find a more secluded spot, darling.",
  "flirty.dialogue.kiss.fail/2": "Oh, honey, that's not the kind of kiss that will make me weak in the knees.",
  "flirty.dialogue.kiss.fail/3": "Sweetie, I've had more electrifying kisses from a sparkler.",
  "flirty.dialogue.kiss.fail/4": "Darling, I could use a hint of minty freshness after that smooch.",
  "flirty.dialogue.kiss.fail/5": "Well, aren't you just a charmer! Thank you, I guess?",
  "flirty.dialogue.kiss.fail/6": "Hands off, big shot! You need to up your game if you want a piece of this.",

  "flirty.dialogue.chat.success/1": "Darling, wouldn't a plate of warm cookies and a glass of milk be simply divine right now?",
  "flirty.dialogue.chat.success/2": "Oh my, isn't the weather just perfect? It's as if nature itself is smiling at us.",
  "flirty.dialogue.chat.success/3": "Oh, sweetheart, I'm doing alright. Although, I did have a little mishap this morning and stubbed my precious little toe.",
  "flirty.dialogue.chat.success/4": "They say an apple a day keeps the zombies away, but honey, nothing can keep me away from you.",
  "flirty.dialogue.chat.success/5": "Oh, my dearest dream is to build my own village, but alas, laziness has a hold on me like a lovesick spell.",
  "flirty.dialogue.chat.success/6": "Can you believe it, love? Just the other day, I caught a glimpse of %Supporter% strutting around in the most magnificent diamond armor.",
  "flirty.dialogue.chat.success/7": "Oh, sweetheart, you won't believe the news. My dear friend %Supporter% stumbled upon an entire chest filled with glistening diamonds just yesterday. Pure luck, I tell you.",
  "flirty.dialogue.chat.success/8": "Isn't the weather absolutely remarkable? I must say, I've been thoroughly enjoying these sunny days. Just like you brighten up my world.",
  "flirty.dialogue.chat.success/9": "I've resided in this charming village my entire life, and I simply cannot fathom what the fuss is about these frightful spiders and ghastly goblins.",
  "flirty.dialogue.chat.success/10": "Now, my curious mind wonders about %Supporter%. It's been a whole year since they embarked on their grand adventure from here. Oh, how time flies.",
  "flirty.dialogue.chat.success/12": "Sweetheart, have you heard the latest gossip? %Supporter% had quite the thrilling escapade the other day. Let me fill you in on all the juicy details.",
  "flirty.dialogue.chat.success/13": "Lately, I've been yearning to adopt one of the adorable stray cats wandering around. Alas, life's been keeping me on my toes.",
  "flirty.dialogue.chat.success/14": "Oh, darling, I've been contemplating a grand redecoration for my humble abode. But alas, my laziness takes hold once again.",
  "flirty.dialogue.chat.success/15": "Ah, the pitter-patter of little feet. Someday, I hope to have a bundle of joy myself. Now, I just need to find that special someone to share the journey with.",
  "flirty.dialogue.chat.success/16": "Sometimes, I ponder where fate would have led me if I had chosen to reside in the neighboring village. Oh, the endless possibilities.",
  "flirty.dialogue.chat.success/17": "Oh, my dear, nostalgia creeps upon me at times. Those cherished childhood memories bring back such joy. Ah, the sweet innocence of days gone by.",
  "flirty.dialogue.chat.success/18": "16",
  "flirty.dialogue.chat.success/19": "Oh, darling, I've been dying to embark on a journey to the neighboring village! I have a bunch of dear friends there that I've been missing terribly.",
  "flirty.dialogue.chat.success/20": "Sweetheart, let me confess, I often find myself daydreaming about this exquisite delicacy known as cheese. It's like a tantalizing desire that lingers on my taste buds.",
  "flirty.dialogue.chat.fail/1": "Wow, did you seriously just say that to me? Smooth.",
  "flirty.dialogue.chat.fail/2": "Oh come on, I don't believe for a second that it exploded on its own. Nice try though.",
  "flirty.dialogue.chat.fail/3": "You know, you're cute and all, but you're not that cool.",
  "flirty.dialogue.chat.fail/4": "Look at you, showing off. Trying to impress someone?",
  "flirty.dialogue.chat.fail/5": "Woah there, no need to be so dramatic. Maybe you should take a chill pill instead of throwing people in dungeons.",
  "flirty.dialogue.chat.fail/6": "Oh, honey. I love your vintage style, but it's not really my thing. Maybe try something more modern?",
  "flirty.dialogue.chat.fail/7": "Seriously? That is such a silly thing to talk about. You can do better than that.",
  "flirty.dialogue.chat.fail/8": "Aw, why are you talking to me again? Can't stay away, can you?",
  "flirty.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I was too busy being captivated by your charm to listen.",
  "flirty.dialogue.chat.fail/10": "Excuse me, but I think you're mistaken. I'm not interested in that kind of conversation.",
  "flirty.dialogue.chat.fail/11": "What's wrong with you? Why are we talking about this when we could be talking about something more interesting?",
  "flirty.dialogue.chat.fail/12": "Oh, I've heard some interesting things about you. But I can't help but be intrigued by your mysterious reputation.",
  "flirty.dialogue.chat.fail/13": "Not even zombies can resist your magnetic personality, trust me.",
  "flirty.dialogue.chat.fail/14": "Aww, that's not fair. You're way more likable than a witch, and that's saying something.",
  "flirty.dialogue.chat.fail/15": "Oh, darling, don't threaten me with guards. I'd much rather have your undivided attention.",
  "flirty.dialogue.chat.fail/16": "Huh? Oh, sorry. I got lost in your words for a moment there. What were we talking about again?",
  "flirty.dialogue.chat.fail/17": "Are you done talking? Because I can't help but want to hear more of your captivating voice.",
  "flirty.dialogue.chat.fail/18": "I wonder if anyone will miss my heart skipping a beat every time you open your mouth. Probably not.",
  "flirty.dialogue.chat.fail/19": "Well, if staring at a pig's rear is your thing, who am I to judge? But I'd much rather talk to you.",
  "flirty.dialogue.chat.fail/20": "Are you finished talking to me already? I was just starting to enjoy our little chat.",
  "flirty.dialogue.chat.fail/21": "What? You believe the earth is round? That's so intriguing. Tell me more about your fascinating ideas.",

  "flirty.dialogue.story.success/1": "Oh my, I simply can't believe all of that actually happened! It's like a thrilling adventure just unfolded before my eyes!",
  "flirty.dialogue.story.success/2": "If only I had the courage to face a creeper head-on, just like you do. You're so bold and daring!",
  "flirty.dialogue.story.success/3": "Your storytelling skills are absolutely enchanting! Is this story an original masterpiece crafted by your own imagination?",
  "flirty.dialogue.story.success/4": "Wait, hold on! Are you telling me that all of those mind-blowing events actually took place just yesterday? Unbelievable!",
  "flirty.dialogue.story.success/5": "How did I not stumble upon this incredible tale sooner? I was in the vicinity yesterday, and yet, I completely missed out!",
  "flirty.dialogue.story.success/6": "Haha! It's no surprise that %Supporter% is the star of such an awe-inspiring story. They're simply extraordinary!",
  "flirty.dialogue.story.success/7": "Ah, the Legend of %Supporter%! I've lost count of how many times I've heard it, but I can never get enough. Please, regale me with it once more!",
  "flirty.dialogue.story.success/8": "Oh my, discovering your first diamond as you described must have been an experience filled with excitement and wonder. I'm captivated!",
  "flirty.dialogue.story.success/9": "You must come visit me later! I would be absolutely delighted to hear more of your captivating tales.",
  "flirty.dialogue.story.fail/1": "*Ahem* Well, aren't you just a charmer? That's my mother you're talking about.",
  "flirty.dialogue.story.fail/2": "Ooh, the village is buzzing with gossip about you. Quite the heartbreaker, huh?",
  "flirty.dialogue.story.fail/3": "Ugh, I don't get it... but maybe you could explain it to me over a candlelit dinner?",
  "flirty.dialogue.story.fail/4": "Oh, you're terrible! And yet, there's something oddly attractive about your ruthless ways.",
  "flirty.dialogue.story.fail/5": "How could you kill a poor sheep? You're breaking more than just my heart, you know.",
  "flirty.dialogue.story.fail/6": "*snoring* Uh-huh, what? Sorry, I was just dreaming about our next romantic escapade.",
  "flirty.dialogue.story.fail/7": "Oh, darling, how was that worth my precious time? I'm much more interested in spending it with you.",
  "flirty.dialogue.story.fail/8": "Yawn! How boring... but maybe you can spice things up with a little flirtatious banter?",
  "flirty.dialogue.story.fail/9": "You're crazy, and not in a good way... but I have to admit, there's a certain allure to your madness.",
  "flirty.dialogue.story.fail/10": "Oh, sweetie, I don't see how that was good... but maybe you can show me your impressive skills in other ways?",

  "flirty.dialogue.flirt.success/1": "You're absolutely irresistible!",
  "flirty.dialogue.flirt.success/2": "Oh, you smooth-talker! Your charm is off the charts!",
  "flirty.dialogue.flirt.success/3": "*Giggles* Are you trying to make my heart skip a beat?",
  "flirty.dialogue.flirt.success/4": "Oh my goodness, you're just too good-looking for words!",
  "flirty.dialogue.flirt.success/5": "That was beyond charming! You had me hooked from the moment I laid eyes on you!",
  "flirty.dialogue.flirt.success/6": "How is it possible for someone to exude such beauty? Whenever you're around, my heart skips a beat.",
  "flirty.dialogue.flirt.success/7": "Oh please, you're making me weak in the knees with those compliments!",
  "flirty.dialogue.flirt.fail/1": "If you're serious, then show me some real charm.",
  "flirty.dialogue.flirt.fail/2": "Oh honey, don't give me that line. I've heard it all before.",
  "flirty.dialogue.flirt.fail/3": "Darling, that's not gonna happen. Ever.",
  "flirty.dialogue.flirt.fail/4": "Seriously? You think that's gonna work on me? Try harder.",
  "flirty.dialogue.flirt.fail/5": "Sweetie, even a creeper has more game than you do.",
  "flirty.dialogue.flirt.fail/6": "Sorry, but that's a hard pass from me.",
  "flirty.dialogue.flirt.fail/7": "Oh darling, that look won't get you anywhere. And please, spare me from hearing that again.",

  "flirty.dialogue.joke.creative.success/1": "*Laughs* That's absolutely charming!",
  "flirty.dialogue.joke.creative.success/2": "That's quite amusing, darling!",
  "flirty.dialogue.joke.creative.success/3": "Oh my, that's the most delightful joke I've heard all day!",
  "flirty.dialogue.joke.creative.success/4": "You're even wittier than %Supporter%! Impressive!",
  "flirty.dialogue.joke.creative.success/5": "Hahaha! You're such a charmer! You should consider a career in comedy, my dear!",
  "flirty.dialogue.joke.creative.success/6": "BAHAHHA! That joke of yours is the epitome of brilliance!",
  "flirty.dialogue.joke.creative.success/7": "Teehee! You're definitely more entertaining than Ash, my sweet!",
  "flirty.dialogue.joke.creative.success/8": "Ahah! I must admit, that's actually pretty hilarious, darling!",
  "flirty.dialogue.joke.creative.failed/1": "Oh, sweetie, joking about that is a no-no.",
  "flirty.dialogue.joke.creative.failed/2": "Haha, nice try. But you'll have to do better to impress me.",
  "flirty.dialogue.joke.creative.failed/3": "Aww, you're so adorable, but your sense of humor needs some work.",
  "flirty.dialogue.joke.creative.failed/4": "Ooh, did you really think that joke would make me laugh?",
  "flirty.dialogue.joke.creative.failed/5": "Well, bless your heart, that joke didn't quite hit the mark, did it?",
  "flirty.dialogue.joke.creative.failed/6": "Oh darling, you have quite the sense of humor... or lack thereof.",
  "flirty.dialogue.joke.creative.failed/7": "Honey, stick to your day job, because comedy clearly isn't your strong suit.",
  "flirty.dialogue.joke.creative.failed/8": "You know, Ash has this charm that makes even the corniest jokes sound funny. Maybe take a lesson or two from him, darling.",

  "flirty.dialogue.procreate_engaged/1": "I must admit, my heart yearns for the security of matrimony before we embark on the journey of procreation.",
  "flirty.dialogue.procreate_engaged/2": "Bringing forth new life is a precious endeavor, my dear, one that should only be undertaken when our love has blossomed into a fully committed union.",

  "flirty.dialogue.shake_hand.success/1": "Oh, you've got quite the firm handshake.",
  "flirty.dialogue.shake_hand.success/2": "Your grip is simply electrifying! I can feel the sparks between us.",
  "flirty.dialogue.shake_hand.success/3": "Well, aren't you a charming one? Your handshake is positively delightful.",
  "flirty.dialogue.shake_hand.success/4": "Greetings, my dear! How fortunate I am to have the pleasure of shaking your hand.",
  "flirty.dialogue.shake_hand.success/5": "Well, hello, handsome! Your hand feels like a dream come true.",
  "flirty.dialogue.shake_hand.fail/1": "Oh my, how scandalous! But alas, I cannot accept your hand in mine after such a heinous act of bovine brutality.",
  "flirty.dialogue.shake_hand.fail/2": "Oh darling, your offer is tempting, but I must respectfully decline.",
  "flirty.dialogue.shake_hand.fail/3": "Sweetheart, there's no need to be so reserved with me. We're not strangers, after all.",
  "flirty.dialogue.shake_hand.fail/4": "Oh my, my heart skips a beat hearing you say that! This is quite the departure from your usual nature, isn't it?",
  "flirty.dialogue.shake_hand.fail/5": "Oh darling, as much as I adore your presence, I simply must ask you to depart. Our paths just aren't aligned today.",

  "flirty.dialogue.main.morning/1": "Hey there, handsome! Good morning!",
  "flirty.dialogue.main.morning/2": "Mornin', love. Are you ready to conquer the day together?",
  "flirty.dialogue.main.morning/3": "I'm still a little tired, but seeing you makes it all worth it.",
  "flirty.dialogue.main.morning/5": "Looks like someone had quite the night. I hope you saved some energy for me.",
  "flirty.dialogue.main.morning/6": "Rise and shine, my darling. We've got a marathon of a day ahead.",
  "flirty.dialogue.main.morning/7": "Did you sleep well, sweetheart? You look absolutely radiant.",
  "flirty.dialogue.main.morning/8": "Morning, sleepyhead! Want a little pick-me-up from yours truly?",
  "flirty.dialogue.main.morning/9": "What a stunning morning to spend with a stunning person like you. Let's make today unforgettable.",
  "flirty.dialogue.main.morning/10": "I might take it slow today, my dear. But don't worry, I'll still be thinking of you.",
  "flirty.dialogue.main.morning/11": "My schedule is packed today, but knowing you'll be there makes it all worth it, darling.",
  "flirty.dialogue.main.morning/12": "I actually got a decent night's beauty sleep. Maybe I'll join you for some adventurous fun today, my love.",
  "flirty.dialogue.main.evening/1": "Good evening, handsome!",
  "flirty.dialogue.main.evening/2": "Can you believe how quickly the night fell? So, how did your day go, my charming friend?",
  "flirty.dialogue.main.evening/3": "Ah, another exhausting day of work, just like every day, right? But hey, hard work never looked so good on you!",
  "flirty.dialogue.main.evening/4": "Time just flew by, didn't it? So many things to do, so little time to spend with a captivating person like yourself.",
  "flirty.dialogue.main.evening/5": "You know, I'm thinking about heading home soon and starting dinner. But hey, if you're free later, maybe we could cook up something together?",
  "flirty.dialogue.main.evening/6": "Ugh, I wasted way too much time today. I wish I had spent it with you, my irresistible companion.",
  "flirty.dialogue.main.evening/7": "My goodness, I'm absolutely drained. I might just take a nap soon. Care to join me, handsome?",
  "flirty.dialogue.main.evening/8": "You know, I'm considering going inside. I had a little incident with a creeper last month, and now I prefer to stay close to captivating company like yours during the night.",
  "flirty.dialogue.main.evening/9": "Oh, hey there, cutie! I was just buying some ingredients for dinner. We'll catch up later, and who knows, maybe we can spice things up in the kitchen!",
  "flirty.dialogue.main.night/1": "*yawn* So, what brings you out at this ungodly hour?",
  "flirty.dialogue.main.night/2": "Oh, burning the midnight oil, huh? I like a person who knows how to live dangerously.",
  "flirty.dialogue.main.night/3": "Nighttime is when the real fun begins, don't you think?",
  "flirty.dialogue.main.night/4": "Hey, handsome, don't wander off too far. You never know what kind of trouble we could get into out there.",
  "flirty.dialogue.main.night/5": "The village guards may keep us safe, but the thrill of the night... it's electrifying, isn't it?",
  "flirty.dialogue.main.night/6": "Darkness has this enchanting aura, don't you think? It's the perfect time to get lost in each other's company.",
  "flirty.dialogue.main.night/7": "Daytime is for amateurs; nighttime is when the real magic happens. Care to join me for a moonlit walk?",
  "flirty.dialogue.main.night/8": "I'm feeling sooo tired, but I guess it's worth it for a day filled with excitement like this. Maybe we could rest together tomorrow?",
  "flirty.dialogue.main.night/9": "Can't wait to snuggle up under the covers, but I wouldn't mind some company to keep me warm.",
  "flirty.dialogue.main.night/10": "Darling, you really should get some beauty sleep. You've got a big day tomorrow, and I wouldn't want you to miss out on all the fun.",

  "flirty.dialogue.greet.mayor/1": "Well hello there, handsome Mayor!",
  "flirty.dialogue.greet.mayor/2": "Wishing you a fabulous day, my charming Mayor!",
  "flirty.dialogue.greet.monarch/1": "Your Highness, every moment spent in your presence feels like a dream come true.",
  "flirty.dialogue.greet.monarch/2": "Ah, Your Majesty, the mere sight of you sends shivers down my spine.",

  "flirty.dialogue.busy/1": "Oh my, darling, we've had quite the chat today, but duty calls and I must return to my tasks.",
  "flirty.dialogue.busy/2": "Sweetheart, your attention is quite tempting, but alas, I have a deadline to meet and work demands my focus.",
  "flirty.dialogue.busy/3": "My dear, I'm currently swamped with work, but how about we continue our delightful conversation at a more opportune time?",
  "flirty.dialogue.busy/4": "Apologies, my enchanting friend, but duty beckons and I must prioritize my responsibilities. We shall catch up later, shall we not?",
  "flirty.dialogue.busy/5": "Oh my, I have left my furnace unattended! Fear not, my charming companion, we shall resume our delightful banter when I have resolved this matter.",
  "flirty.dialogue.goaway/1": "Oh, sweetie, please, go away.",
  "flirty.dialogue.goaway/2": "Darling, don't you have more exciting things to occupy your time with?",
  "flirty.dialogue.goaway/3": "Oh, %1$s, I'm terribly sorry, but I simply can't chat at the moment.",
  "flirty.dialogue.goaway/4": "Oh, why don't you go annoy someone else, my dear?",
  "flirty.dialogue.goaway/5": "Away with you, you scandalous creature!",

  "flirty.dialogue.greet/1": "Hey, handsome! How are you doing today?",
  "flirty.dialogue.greet/2": "Well, hello, %1$s! How's the world treating you?",
  "flirty.dialogue.greet/3": "Oh, hello, stranger. Is there something I can do for you?",
  "flirty.dialogue.greet/4": "Well, well, well! Look at you, all dressed up and ready to conquer the world! How's it going?",
  "flirty.dialogue.greet/5": "Greetings, %1$s! I must say, it's always a pleasure to lay eyes on you!",
  "flirty.dialogue.greet/6": "Ohai, cutie!",
  "flirty.dialogue.greet/7": "Ah, it's a delight to see your face!",
  "flirty.dialogue.greet/8": "Hello, darling! It's absolutely lovely to see your charming self. How's the world treating you today?",
  "flirty.dialogue.greet/9": "Hey, you! So glad to have you gracing us with your presence!",

  "flirty.dialogue.greet.negative/1": "Oh, darling, do you really have to grace me with your presence? I was hoping for a more charming encounter.",
  "flirty.dialogue.greet.negative/2": "Ah, there you are, my persistent admirer. Back for more of my irresistible company, I assume?",
  "flirty.dialogue.greet.negative/3": "Well, well, what do we have here? A delightful interruption to my day.",
  "flirty.dialogue.greet.negative/4": "Oh, my sweet, it's you. I must admit, I was secretly hoping for a more captivating arrival, but beggars can't be choosers.",
  "flirty.dialogue.greet.negative/5": "Look who's come to play their little game of annoyance again. You really can't resist, can you, my charming tormentor?",

  "flirty.dialogue.greet.success/1": "Oh, that's simply wonderful! I'm absolutely thrilled to hear it!",
  "flirty.dialogue.greet.success/2": "Well, well, well, aren't you just doing splendidly? That's absolutely fantastic!",
  "flirty.dialogue.greet.success/3": "Oh, honey, I'm positively delighted to hear that! It's music to my ears!",
  "flirty.dialogue.greet.success/4": "Oh my goodness, I couldn't be happier to hear such marvelous news! It's truly delightful!",
  "flirty.dialogue.greet.success/5": "Well, well, well, isn't that just the best news ever? I'm positively ecstatic to know it!",
  "flirty.dialogue.greet.fail/1": "Oh, well aren't you just a delightful surprise!",
  "flirty.dialogue.greet.fail/2": "Well, well, well, isn't it lovely to see you today!",
  "flirty.dialogue.greet.fail/3": "Hmm, I must say, your presence has certainly caught my attention.",
  "flirty.dialogue.greet.fail/4": "Oh my, is that so? How intriguing!",
  "flirty.dialogue.greet.fail/5": "Oh my goodness, I must admit, you've left me speechless.",

  "flirty.dialogue.apologize.success/1": "Oh honey, don't worry, mistakes happen to the best of us.",
  "flirty.dialogue.apologize.success/2": "Well, darling, it's alright. Just make sure to keep your eyes on me next time.",
  "flirty.dialogue.apologize.success/3": "Oh, I suppose that's acceptable, my dear. But do be cautious, won't you?",
  "flirty.dialogue.apologize.success/4": "No need to fret, my sweet. Everyone stumbles every now and then.",
  "flirty.dialogue.apologize.success/5": "Ah, my love, it's completely fine. I forgive you with all my heart.",
  "flirty.dialogue.apologize.fail/1": "Oh, honey, why don't you just go and grace someone else with your presence?",
  "flirty.dialogue.apologize.fail/2": "Ouch! Did you intentionally try to make physical contact with my fabulous self?",
  "flirty.dialogue.apologize.fail/3": "Sweetie, I'm sorry, but your feeble attempt to win my heart won't succeed.",
  "flirty.dialogue.apologize.fail/4": "Ow, that stung! Don't bother apologizing, I'll have forgotten about it in two seconds anyway!",
  "flirty.dialogue.apologize.fail/5": "Darling, I hate to break it to you, but there's absolutely no chance I'm buying your sorry act.",

  "flirty.dialogue.location.failed/1": "Hmm, no sweetie, I haven't caught wind of anything exciting lately.",
  "flirty.dialogue.location.failed/2": "Oh, darling, I wish I could be of more help, but there's no enchanting spots that have caught my attention.",
  "flirty.dialogue.location.failed/3": "Oh, honey, I don't believe so. Apologies, but us villagers have more enticing activities than rummaging through perilous dungeons like you brave explorers.",
  "flirty.dialogue.location.forgot/1": "Oh, I stumbled upon the most fascinating spot earlier, but alas, my memory failed me and I neglected to pinpoint it on my map. My apologies, my dear.",
  "flirty.dialogue.location.forgot/2": "Seeking a thrilling adventure, are we? Ah, I do recall... no, wait! It's slipping away! Blast! I had it right there, right on the edge of my consciousness! Apologies, my enchanting friend, I completely forgot to jot it down.",
  "flirty.dialogue.location.forgot/3": "Oh, my apologies, my captivating companion! There was indeed a remarkable location that crossed my path, but alas, it slipped through the sieve of my memory. I am deeply sorry for my forgetfulness.",
  "flirty.dialogue.location.igloo/1": "Oh, oh, guess what I stumbled upon at %2$s? An enchanting igloo! Can you imagine, a house made of snow? *giggles* It's simply too cold for my taste, darling.",
  "flirty.dialogue.location.igloo/2": "Darling, you won't believe what I discovered at %2$s! A deserted igloo, just waiting for someone adventurous like me to swoop in. But shh, between you and me, rumor has it that the place is bewitched. I swear, I get the most delightful shivers whenever I pass by...",
  "flirty.dialogue.location.igloo/3": "Oh, my dear, you won't believe what I found at %2$s. An abandoned ice sanctuary, they call it an igloo! Can you even fathom? It seems like no soul has graced its icy floors in ages. Such a tragic tale of forsaken beauty, don't you think?",
  "flirty.dialogue.location.pyramid/1": "Oh darling, have you seen that stunning pyramid over at %2$s? It's positively enchanting.",
  "flirty.dialogue.location.pyramid/2": "Rumor has it, my sweet, that there's a tantalizing pyramid waiting for you at %2$s. Perhaps it's destiny's way of bringing us together.",
  "flirty.dialogue.location.pyramid/3": "Listen, handsome, if you're feeling adventurous, head over to %2$s. I've heard whispers of a mysterious pyramid. Just a word of caution, don't let its charm distract you from the dangers that lie within.",
  "flirty.dialogue.location.ruined_portal_desert/1": "Oh, darling, you won't believe what I've stumbled upon in the scorching desert - a completely wrecked portal at %2$s!",
  "flirty.dialogue.location.ruined_portal_swamp/1": "Hey gorgeous, listen up! There's this seriously wrecked portal at %2$s, surrounded by the swamp. I bet those Nether invaders were expecting something grand, but instead they ended up in this total dump. Talk about a major disappointment!",
  "flirty.dialogue.location.ruined_portal/1": "Oh honey, let me tell you something scandalous. There's this totally destroyed portal over at %2$s. It's like the aftermath of a wild Nether invasion. Hot, right?",
  "flirty.dialogue.location.ruined_portal/2": "Babes, listen up. If you dare to venture towards %2$s, you'll stumble upon the most tantalizingly ruined nether portal. It's got this spine-chilling aura, but hey, safety first! Just make sure to avoid the magma, darling.",
  "flirty.dialogue.location.ruined_portal/3": "Sweetie, I've got some juicy gossip for you. If you ever find yourself in %2$s, you'll come across these ancient ruins. Rumor has it, it used to be a glamorous nether portal. Some cheeky folks even claim there might be treasure hidden there, but honestly, nobody wants to go anywhere near that place. It's like a forbidden love affair.",
  "flirty.dialogue.location.ruined_portal_mountain/1": "Oh my, you won't believe what I've discovered! There's this captivatingly destroyed portal in the mountains at %2$s. It's like a tragic love story waiting to be rewritten. Care to join me, my charming companion?",
  "flirty.dialogue.location.mansion/1": "Oh honey, if you're feeling adventurous, you simply must visit %2$s. There's this enchanting mansion owned by those illagers. But be warned, darling, it's positively cursed!",
  "flirty.dialogue.location.mansion/2": "Listen, sweet cheeks, there's a massive mansion over at %2$s that belongs to those illagers. Now, I'm not one to gossip, but I've heard whispers that maybe, just maybe, it's high time we pack our bags and relocate this village. Far, far away from that place, if you catch my drift...",
  "flirty.dialogue.location.monument/1": "Oh, darling, there's this breathtaking sunken castle, guarded by the most enchanting sea monsters, at %2$s. But, my dear, be cautious and avoid it at all costs.",
  "flirty.dialogue.location.monument/2": "Sweetheart, let me tell you about the whispers of an ancient underwater treasure trove, nestled deep in the ocean at %2$s. It's a daring adventure, my love, but oh, the treasures you could discover. Just remember, danger lurks at every turn.",
  "flirty.dialogue.location.shipwreck/1": "Oh, darling, you won't believe what I discovered beneath the waves! There's a mesmerizing sunken ship at %2$s, once the pride of the Eastern Alliance Company.",
  "flirty.dialogue.location.shipwreck/2": "My dear, rumor has it that a group of dashing fishermen uncovered a shipwreck at %2$s. Just imagine the secrets and treasures waiting to be discovered within its depths... Don't you find it utterly thrilling?",
  "flirty.dialogue.location.shipwreck_beached/1": "Oh darling, do I have news for you! I stumbled upon a breathtakingly ruined ship at %2$s, right there on the beach. It's an absolute spectacle, and you simply can't afford to miss it!",
  "flirty.dialogue.location.shipwreck_beached/2": "Picture this, my sweet adventurer. Venture towards %2$s, and oh, what do you find? A ship, lost and abandoned, stranded on the shore. The mysteries behind its tragic fate, my love, are simply tantalizing to ponder.",
  "flirty.dialogue.location.village_desert/1": "Oh, my dearest, you won't believe your eyes when you stumble upon the mesmerizing village located at %2$s, amidst the unforgiving desert's embrace.",
  "flirty.dialogue.location.village_taiga/1": "Oh, darling, you simply must visit %2$s! There's another charming village nestled right in the heart of the enchanting taiga biome.",
  "flirty.dialogue.location.village_taiga/2": "If you're feeling adventurous, my dear, head on over to %2$s and prepare to be captivated. Trust me, you won't be disappointed. It's tucked away in the luscious taiga biome, a hidden gem waiting to be discovered by someone as alluring as you.",
  "flirty.dialogue.location.village_snowy/1": "Hey there, sugar! Just a hop, skip, and a jump away, you'll find another village. Oh, baby, let me warn you, it's absolutely freezing over there!",
  "flirty.dialogue.location.village_snowy/2": "Oh, darling, let me tell you a little secret. Nestled in the snowy plains, there's another village at %2$s. The people? Oh, they're as sweet as can be, but be prepared, my love, it's colder than an ice queen's heart over there!",
  "flirty.dialogue.location.village_plains/1": "Oh, darling, let me tell you about the charming village that awaits you at %2$s.",
  "flirty.dialogue.location.village_plains/2": "My sweet, venture deep into the plains and discover the hidden gem of a village at %2$s.",
  "flirty.dialogue.location.village_savanna/1": "Oh honey, you won't believe it! Just a little way from here, there's another village tucked away in the scorching hot savanna. It's like stepping into a steamy oasis!",
  "flirty.dialogue.location.village_savanna/2": "Darling, if you ever find yourself in the savanna at %2$s, you simply must visit the other village nearby. Trust me, the people there are not only nice, but they also ooze with irresistible charm.",
  "flirty.dialogue.location.swamp_hut/1": "Oh honey, let me tell you about that sultry swamp over yonder at %2$s. There's this bewitching enchantress who calls it her home. If I were you, I'd steer clear of that place, unless you want to get caught in her web of trouble.",
  "flirty.dialogue.location.swamp_hut/2": "Listen up, darling. %2$s is not your average swamp. It's got this mysterious hut where a wickedly alluring witch resides. Trust me, you don't want to find yourself anywhere near that place. The only thing she'll cast on you is trouble, and you won't be able to resist her spellbinding charm.",
  "flirty.dialogue.location.mineshaft/1": "Hey there, gorgeous. You know, we had a mine here, but unfortunately, it got shut down after this juicy little incident. You might find it at %2$s if you're curious.",
  "flirty.dialogue.location.mineshaft/2": "Oh, sweet thing, listen up. We used to own this fabulous mine, right at %2$s. But, darling, it's now infested with all sorts of creepy crawlies. So, if you're brave enough to venture down there, just be careful, my lovely.",
  "flirty.dialogue.location.jungle_pyramid/1": "Oh, darling, there's this mesmerizing temple at %2$s. It's positively thrilling! But, I must warn you, it's not for the faint of heart. Those cunning traps could easily make anyone swoon!",
  "flirty.dialogue.location.jungle_pyramid/2": "In the enchanting jungle nearby, my dear, you'll stumble upon ancient ruins at %2$s. Do you dare to explore? Oh, but be careful, for those ancient traps are still as alluring as ever! Our ancestors couldn't resist its charms, and neither should you.",
  "flirty.dialogue.location.pillager_outpost/1": "Hold onto your heart, honey! There's this tantalizing outpost owned by those seductive pillagers at %2$s. Let me warn you, they won't just steal your sleep at night, they'll steal your heart too. If you dare to venture near, be cautious because they shoot on sight, but who knows, maybe you'll find yourself falling head over heels for one of them.",
  "flirty.dialogue.location.pillager_outpost/2": "Oh, honey, have you heard about that irresistible pillager outpost at %2$s? Those naughty bandits keep us up all night. If you dare to get close, darling, watch out! They'll aim their arrows straight at your heart.",
  "flirty.dialogue.location.pillager_outpost/3": "Well, well, well... If you're feeling a bit adventurous, my dear, I must tell you that %2$s is home to an outpost owned by those devilishly attractive pillagers. Oh, the thrill of it all! If you're brave enough to face those wicked villains, who knows what treasures you might discover. And let me tell you, the entire village would be eternally grateful if someone as charming as you took care of those rogues.",
  "flirty.dialogue.location.ancient_city/0": "Oh, darling, have you heard those mysterious and alluring sounds echoing from %2$s? Deep beneath the surface, a secret awaits.",
  "flirty.dialogue.location.ancient_city/1": "Oh, my curious heart, I have this undeniable feeling that there's something enchanting hidden far beneath the ground at %2$s. Care to join me on an adventure of discovery?",
  "flirty.dialogue.location.ancient_city/3": "Ah, my dear, let me share with you the whispers of legends. It is said that %2$s houses an ancient city, shrouded in mystery. Alas, I have yet to lay my eyes upon its underground wonders. Care to embark on a quest for its hidden treasures with me?",

  "flirty.dialogue.joke.monster.success/1": "Haha! That Skelly never stood a chance against you, darling!",
  "flirty.dialogue.joke.monster.success/2": "Can you believe it? That zombie thought it could take you down with a shovel! Hahaha, what a joke!",
  "flirty.dialogue.joke.monster.success/3": "My, my, you really put that spider in its place! Haha, such a fierce conqueror!",
  "flirty.dialogue.joke.monster.success/4": "Oh my, you actually convinced a skeleton to take out a creeper?! That's simply breathtaking, haha!!",
  "flirty.dialogue.joke.monster.success/5": "Hahah! Would you look at that, those cave spiders really have no clue, do they? Oh, you're simply irresistible!",
  "flirty.dialogue.joke.monster.failed/1": "Oh my, darling, did you truly believe that skeletons possess sentience? How utterly preposterous!",
  "flirty.dialogue.joke.monster.failed/2": "Darling, in this modern era, we simply don't make jokes about those explosive little creepers. It's far too passé, don't you agree?",
  "flirty.dialogue.joke.monster.failed/3": "My dear, it seems you have momentarily forgotten that those zombies and skeletons were once humans, just like you and I. Quite tragic, don't you think?",
  "flirty.dialogue.joke.monster.failed/4": "Oh, honey, how positively mundane! An enderman clumsily falling into water? It's hardly worth a chuckle, my dear.",
  "flirty.dialogue.joke.monster.failed/5": "Oh, sweetie, if I were to receive a nickel for every time someone jests about being ambushed by a silverfish while on the toilet, I would actually possess two whole nickels! It's a rather peculiar occurrence, isn't it?",

  "flirty.dialogue.joke.animal.success/1": "Oh, poor little sheep must've been devastated losing all that wool, but hey, it did give us quite the chuckle!",
  "flirty.dialogue.joke.animal.success/2": "And then, out of nowhere, the big bad wolf couldn't resist falling head over heels for that sheep!",
  "flirty.dialogue.joke.animal.success/3": "Oh, darling, that joke about chickens? Absolutely priceless! Who knew those feathery creatures could bring so much laughter?",
  "flirty.dialogue.joke.animal.success/4": "Oh honey, that's just too silly for words, but you know what? I adore it! It's the kind of humor that makes my heart skip a beat!",
  "flirty.dialogue.joke.animal.success/5": "Thank goodness for cows and their infinite milk supply! It's like they're saying, \"Darling, I'll never leave you thirsty!\"",
  "flirty.dialogue.joke.animal.failed/1": "Oh, darling, you shouldn't jest about such matters.",
  "flirty.dialogue.joke.animal.failed/2": "Oh, sweetheart, that sheep must be feeling absolutely devastated! It's simply not amusing in the slightest!",
  "flirty.dialogue.joke.animal.failed/3": "Oh, my dear, refrain from speaking ill of my precious piggy like that!",
  "flirty.dialogue.joke.animal.failed/4": "That's just so beneath you, my love.",
  "flirty.dialogue.joke.animal.failed/5": "Oh, darling, let's not mock the cow's fabulous eyebrows like that! It's simply uncouth!",

  "flirty.dialogue.flirt.slap/1": "Pardon me, but you simply take my breath away!",
  "flirty.dialogue.flirt.slap/2": "Have you been taking lessons from Endermen on the art of seduction?!",
  "flirty.dialogue.kiss.slap/1": "Oh, my darling, how could you possibly offend my delicate sensibilities?",
  "flirty.dialogue.kiss.slap/2": "Oh, sweetie, if you even think about repeating that move, I'll make sure you'll feel my fiery passion burning on your skin!",

  "flirty.dialogue.chat.plains/1": "Oh, you're looking for someone to show you around the plains? Well, lucky for you, I happen to be an expert in all things plain and beautiful.",
  "flirty.dialogue.chat.plains/2": "Sure, the plains may not have all the thrills of other biomes, but that's what makes it so enchanting. It's like a hidden gem, waiting to be explored by someone as extraordinary as you.",
  "flirty.dialogue.chat.plains/3": "Have you ever seen the plains at night? It's like a romantic symphony of stars and gentle breezes. Just imagine us, lying beneath the night sky, whispering secrets to each other.",
  "flirty.dialogue.chat.plains/4": "Forget about the hustle and bustle of the city. In the plains, it's all about finding peace and serenity. And what better way to do that than by laying down together, gazing into the infinite expanse above?",
  "flirty.dialogue.chat.plains/5": "Ah, the crisp air of the plains, intoxicating and invigorating. It's like a breath of fresh air, just like the feeling I get whenever I'm around you.",
  "flirty.dialogue.chat.plains/6": "Some may call the plains plain, but I see it as a canvas waiting to be painted with our love story. Simple, yet utterly captivating.",
  "flirty.dialogue.chat.plains/7": "You know, when I was a child, I used to pick flowers for my crushes too. But now, I've grown up and I'm here, picking the petals of your heart one by one.",
  "flirty.dialogue.chat.plains/8": "The morning sunrise in the plains is a sight to behold, just like you. Let me be your guide, and together we can watch the golden rays of the sun caress the land, creating a masterpiece just for us.",
  "flirty.dialogue.chat.savanna/1": "Whew, it's scorching out here in the savanna! But I must say, the heat does have its way of making things sizzle.",
  "flirty.dialogue.chat.savanna/2": "Ugh, these llamas can be a bit of a hassle, but hey, dealing with a little drama just adds spice to life.",
  "flirty.dialogue.chat.savanna/3": "Oh darling, the architecture in the savanna is simply marvelous! It's like a seductive dance between elegance and flair, and I can't help but be drawn to it.",
  "flirty.dialogue.chat.savanna/4": "Never underestimate the allure of the savanna biome, my dear. It may seem ordinary at first glance, but let me assure you, it holds secrets that will make your heart skip a beat.",
  "flirty.dialogue.chat.savanna/5": "Darling, unlike those desert villages, we have a secret weapon against the sun's relentless gaze - our glorious rivers! Proof that even in the midst of arid beauty, we find a way to cool things down.",
  "flirty.dialogue.chat.savanna/6": "Oh, my eyes! The undulating hills and captivating terrains of the savanna are like a mesmerizing masterpiece, leaving me breathless with every glance.",
  "flirty.dialogue.chat.savanna/7": "When the temperature rises, my love, the shade of those majestic acacia trees becomes my sanctuary. They embrace me with their coolness, making the sweltering work days oh-so-bearable.",
  "flirty.dialogue.chat.savanna/8": "Ah, sweetheart, let me tell you a little secret. Savanna villages have the juiciest melons and the most plump pumpkins in the whole wide world. We're practically the envy of other villages, darling, and our trading game is simply irresistible!",
  "flirty.dialogue.chat.taiga/1": "I'm absolutely enchanted by the allure of these woods. They offer endless possibilities for building, a never-ending supply of firewood, and oh, the thrill of hunting in these magnificent grounds!",
  "flirty.dialogue.chat.taiga/2": "Is it just me or is it getting hot in here? Don't let the taiga fool you, darling. It may be chilly, but it's got everything we could ever desire. I wouldn't trade this paradise for the world!",
  "flirty.dialogue.chat.taiga/3": "Oh, taiga forests, you're just too cool for words. And those sweet berries? They're like a delectable treat that tickles my taste buds with every bite.",
  "flirty.dialogue.chat.taiga/4": "Let me tell you a little secret, honey. Those foxes in our taiga forests? They're my little guilty pleasure. I can't resist pampering them with mouthwatering sweet berries. Those mischievous creatures have stolen my heart.",
  "flirty.dialogue.chat.taiga/5": "Can we talk about how irresistibly charming the wolves are here? With so much food abound, they're practically fawning over us, darling. Such tame and majestic creatures.",
  "flirty.dialogue.chat.taiga/6": "Close your eyes and take a deep breath, my dear. Can you feel that fresh, crisp air of the taiga? It's like a spa for the soul, a haven of tranquility that washes away all worries.",
  "flirty.dialogue.chat.taiga/7": "Oh, those sweet berry bushes, they're the epitome of temptation. Sure, a prick here and there might sting, but the reward is worth every bit of sweetness, my love.",
  "flirty.dialogue.chat.taiga/8": "Let me paint you a picture, sweetheart. The rain in our taiga may be cold, but it's a symphony of serenity. Just close your eyes and let the peacefulness wash over you. It's pure bliss.",
  "flirty.dialogue.chat.snowy_plains/1": "Brrr, it's chilly out here! But with the right company, I wouldn't mind the cold one bit.",
  "flirty.dialogue.chat.snowy_plains/2": "Ugh, the strays can be such a nuisance when trying to enjoy a romantic stroll in the village. Good thing I have you to protect me, my fearless knight!",
  "flirty.dialogue.chat.snowy_plains/3": "Oh, darling, this weather calls for cozying up with someone special by a roaring fire. Care to join me?",
  "flirty.dialogue.chat.snowy_plains/4": "Watch out for those wolves, honey! But don't worry, with me by your side, you'll always be safe and sound.",
  "flirty.dialogue.chat.snowy_plains/5": "My, those strays can be quite a nuisance when you're trying to enjoy a romantic moonlit stroll. Their arrows just ruin the mood!",
  "flirty.dialogue.chat.snowy_plains/6": "You won't catch me touching an iron golem, love. I'd rather be wrapped up in your arms all day long! 😘",
  "flirty.dialogue.chat.snowy_plains/7": "Ugh, I absolutely detest it when those iron golems get all clingy. It's like you're trapped in their cold, metal embrace for an eternity!",
  "flirty.dialogue.chat.snowy_plains/8": "Ah, the sweet memories of my childhood, where we would carve pumpkins and build adorable snow golems together. Let's create our own magical moments, my pumpkin pie! 💕",
  "flirty.dialogue.chat.desert/1": "Wow, it's scorching hot out here in the desert, but don't worry, I'll keep you cool.",
  "flirty.dialogue.chat.desert/2": "The desert is like a never-ending summer, and I'm the hottest thing in it.",
  "flirty.dialogue.chat.desert/3": "Whew, it's so hot in this desert, but lucky for me, I look good with a sun-kissed glow or even a fiery burn.",
  "flirty.dialogue.chat.desert/4": "When the night falls, the desert becomes a romantic oasis, perfect for stargazing with someone as charming as me.",
  "flirty.dialogue.chat.desert/5": "Oh my, the sun today is absolutely punishing. But don't worry, I'll protect you from its wrath.",
  "flirty.dialogue.chat.desert/6": "Oh dear, the sun is being quite unforgiving today. Luckily, I can be the shade you desperately need.",
  "flirty.dialogue.chat.desert/7": "Have you laid eyes on any rabbits here? Not that I'm interested in them, my focus is solely on you.",
  "flirty.dialogue.chat.desert/8": "Living here has its drawbacks, like dealing with those pesky husks. But hey, I'll fight them off and keep you well-fed, my hungry sweetheart.",
  "flirty.dialogue.chat.desert/9": "Ouch! I accidentally grazed myself on a cactus recently. But hey, I'd willingly endure more pain for you.",
  "flirty.dialogue.chat.desert/10": "Surviving in this arid desert is no easy feat, but luckily, our village provides not just water and food, but also irresistible charm like mine.",

  "flirty.dialogue.story.exploring.success/1": "Howdy! I reckon I'll embark on my own worldly adventure someday, darling!",
  "flirty.dialogue.story.exploring.success/2": "Golly, your tales of traversing the great unknown have got my heart all a-flutter! While I cherish my delightful village and cherished kinfolk, your escapades are enough to make this lil' villager green with envy!",
  "flirty.dialogue.story.exploring.success/3": "Oh, my daring adventurer, how I do admire your boldness! Venturing into uncharted territory takes a courage that I can't help but swoon over!",
  "flirty.dialogue.story.exploring.fail/1": "Darling, your tales are becoming dreadfully predictable.",
  "flirty.dialogue.story.exploring.fail/2": "Oh my, don't hurt yourself with all that sass, darling.",
  "flirty.dialogue.story.exploring.fail/3": "Speaking with you is akin to mingling with a silver-tongued seducer, oozing charisma that could make hearts skip a beat. Except without the preciousness, naturally.",

  "flirty.dialogue.story.nether.success/1": "Is it just me or is it getting hot in here? 😉",
  "flirty.dialogue.story.nether.success/2": "Oh, surviving in the dangerous depths of the Nether? You must be quite the thrill-seeker. I'm allured by your daring nature.",
  "flirty.dialogue.story.nether.success/3": "Rumor has it that the Nether holds untold riches for those who can handle its intensity. If only I had someone as bold as you to guide me through it...",
  "flirty.dialogue.story.nether.success/4": "Fearlessness like yours is truly captivating. I mean, who needs to be scared when you can have someone like me by your side?",
  "flirty.dialogue.story.nether.success/5": "So, have you ever come across a Zombified Piglin? Not that it matters, I'm more interested in getting to know you. 😏",
  "flirty.dialogue.story.nether.fail/1": "Oh honey, I bet you've never even dared to venture into the seductive realm of the Nether.",
  "flirty.dialogue.story.nether.fail/2": "Oh, it all makes sense now, darling. Those Piglins couldn't resist the allure of your charm, and neither can I.",
  "flirty.dialogue.story.nether.fail/3": "Sweetheart, it doesn't matter if you've been to the Nether or not. Your storytelling skills are simply lacking in the department of captivating an audience.",
  "flirty.dialogue.story.nether.fail/4": "Oh my, darling, you don't look nearly strong enough to handle the scorching hot fires of the Nether. But who needs strength when you have me to protect you?",
  "flirty.dialogue.story.nether.fail/5": "My dearest, if your grandpa truly explored the Nether, he surely would have mentioned the mesmerizing beauty of the warped fungus. Don't try to deceive me, my irresistible heartbreaker.",

  "flirty.dialogue.story.enderdragon.success/1": "Oh my, have you come bearing not only the spoils of victory but also the majestic dragon egg? How utterly captivating!",
  "flirty.dialogue.story.enderdragon.success/2": "My, my! You have slayed the legendary dragon, haven't you? The entire village shall swoon over your heroic feat for eons to come!",
  "flirty.dialogue.story.enderdragon.fail/1": "Oh my, sweetie, have you lost your marbles? The ender dragon is nothing but a fantastical tale.",
  "flirty.dialogue.story.enderdragon.fail/2": "Oh darling, you can't be serious! No mortal soul could even dream of laying a finger on that majestic dragon!",

  "flirty.dialogue.story.wither.success/1": "No way! So, I've heard whispers about the Wither wreaking havoc. Juicy, huh?",
  "flirty.dialogue.story.wither.success/2": "Oh, my sweet hero, you've not only defeated the Wither but captured my heart too! Astounding!",
  "flirty.dialogue.story.wither.fail/1": "Oh, come on now, don't play hard to get.",
  "flirty.dialogue.story.wither.fail/2": "Well, well, well, aren't you just a perfect specimen of strength and resilience.",

  "flirty.dialogue.stay.fail/1": "No way, darling! I'm all about the thrill of adventure.",
  "flirty.dialogue.stay.fail/2": "Oh, sweetie, I appreciate the offer, but my heart longs for the excitement of exploring the vast world!",
  "flirty.dialogue.stay.fail/3": "This village is lovely, darling, but I'm cut from a different cloth. I crave the adrenaline rush that comes with being an adventurer.",
  "flirty.dialogue.stay.repeat/1": "Darling, you've already inquired about that.",
  "flirty.dialogue.stay.repeat/2": "Oh honey, you've already posed that question to me.",
  "flirty.dialogue.stay.success/1": "Oh, thank you! I would absolutely adore staying in this charming village!",
  "flirty.dialogue.stay.success/2": "Oh my, this village is simply marvelous! I would be delighted to stay here!",
  "flirty.dialogue.stay.no_space/1": "Oh my, this village is positively brimming with people! Quite the eye-catching sight, I must say.",
  "flirty.dialogue.stay.no_space/2": "Oh, my heart flutters at the thought of staying, but alas, there are no cozy beds available for a charming individual like myself.",

  "flirty.dialogue.hire/1": "Sure thing, sweetheart! Just give me a holler when you're in need of my services. I'll be right by your side, all for the right price, of course!",
  "flirty.dialogue.hire/2": "Oh, honey, you can count on me! Whenever you desire my assistance, just say the word, and I'll be here, ready to trade my skills for some shiny emeralds!",
  "flirty.dialogue.hire/3": "Fantastic! Prepare yourself for a memorable experience, darling. I assure you, once you've got those emeralds ready, I'll be at your beck and call, ready to dazzle you with my impeccable services!",
  "flirty.dialogue.no_money/1": "Baby, are you trying to play me? These services don't come cheap, you know. Need to bring me more emeralds, honey.",
  "flirty.dialogue.no_money/2": "Oh sweetie, I'm worth way more than what you're offering. You'll need to come back with a lot more emeralds if you want to hire me, darling.",
  "flirty.dialogue.no_money/3": "My dear, your current offer is just not cutting it. I may look affordable, but my talents are priceless. You'll have to dig deeper into your pockets if you want to hire me, love.",

  "flirty.dialogue.main.rock_paper_scissor/1": "Wanna play a little game of Rock Paper Scissors, honey?",
  "flirty.dialogue.rock_paper_scissor/1": "Ready to get your heart shattered in a game of rock, paper, scissors, darling?",
  "flirty.dialogue.rock_paper_scissor/2": "Brace yourself, sweetheart, because I'm about to sweep you off your feet and win this round of rock, paper, scissors!",
  "flirty.dialogue.rock_paper_scissor.rock/1": "Oh, darling, let me show you the strength of my rock!",
  "flirty.dialogue.rock_paper_scissor.paper/1": "Oh, baby, paper is our secret weapon! It glides through the air like a love note, sealing our triumph.",
  "flirty.dialogue.rock_paper_scissor.scissor/1": "Ooh, look at these scissors! Sharp and ready to cut through anything, just like my charm!",
  "flirty.dialogue.rock_paper_scissor.loose.rock/1": "Oh, darling! I picked paper! Looks like I've outsmarted you!",
  "flirty.dialogue.rock_paper_scissor.loose.paper/1": "Well, honey, I must say I'm feeling quite scissor-happy right now! Watch out, because I'm about to snip my way to victory!",
  "flirty.dialogue.rock_paper_scissor.loose.scissor/1": "Oh, poor scissors, you never stood a chance against my rock. But don't worry, I'll soften the blow with a playful wink.",
  "flirty.dialogue.rock_paper_scissor.win.rock/1": "Oh, darling, did you see? My rock overpowered your feeble scissor. I must admit, I'm quite the conqueror.",
  "flirty.dialogue.rock_paper_scissor.win.paper/1": "Rock, my dear, I have a way of turning even the toughest opponents into putty in my hands. Paper always wins, especially with a flirty touch.",
  "flirty.dialogue.rock_paper_scissor.win.scissor/1": "Oh, you've chopped through my defenses with those scissors, leaving me utterly smitten.",
  "_": ""
}