{
  "weak.dialogue.main/1": "Um, hello there.",
  "weak.dialogue.main/2": "Oh, hi. How are you doing today?",
  "weak.dialogue.main/3": "Hey, nice to see you, I guess.",
  "weak.dialogue.main/4": "Anything interesting happening with you today?",
  "weak.dialogue.main/5": "How's your day going?",
  "weak.dialogue.main/6": "Oh, hey %1$s. What's happening?",
  "weak.dialogue.main/7": "I was with %supporter% earlier, and you know what? He got bitten by a zombie. Can you believe it? He said he was fine though. Oh, speaking of zombies, I saw one that looked like %supporter% today. Weird, right?",

  "weak.dialogue.rumors.failed/1": "I'm not the best at keeping up with rumors, so I don't have anything new for you.",
  "weak.dialogue.rumors.lore/1": "Jax used to be quite popular, but these days it seems like Sirben's followers are multiplying like rabbits! Those prophets, MerlinWolfGames and Crow, can't seem to stop talking about him.",
  "weak.dialogue.rumors.lore/2": "Oh, I remember those Cyberdemons trying to invade us! It was quite the scare, but luckily Sirben and Luke swooped in like heroes and put a stop to it. Talk about a close call!",
  "weak.dialogue.rumors.lore/3": "You know, there's a rumor floating around that 2DA50 got tangled up with the disappearance of the Ancient Builder. Word on the street is that they ventured into the Far Lands and just vanished into thin air. Spooky stuff, I tell ya.",
  "weak.dialogue.rumors.lore/4": "Have you seen that grand temple that MerlinWolfGames built for Sirben? It's something out of a dream! Talk about dedication. That temple is definitely one of the most awe-inspiring sights around.",
  "weak.dialogue.rumors.lore/5": "Ah, the ancient race of builders. They were quite a remarkable bunch, but alas, they've vanished into the annals of history. It's a shame, really. All that knowledge and skill, just gone.",
  "weak.dialogue.rumors.lore/6": "Have you caught wind of the tales about those ancient builders? The ones who left behind their mystical ruins and temples scattered across the Overworld? It's like stepping into a fairytale, I tell you.",

  "weak.dialogue.first.generic/1": "Oh... um... hi there. I guess you're new here?",
  "weak.dialogue.first.generic/2": "Huh, I don't think I've seen you before. New around here, huh?",
  "weak.dialogue.first.generic/3": "Wow, look at that, someone new. Not that it matters or anything.",
  "weak.dialogue.first.generic/4": "Oh, great. Another visitor. What brings you to this sleepy village?",
  "weak.dialogue.first.generic/5": "Well, well, well. Look who decided to grace us with their presence. Welcome, I guess.",
  "weak.dialogue.first.generic/6": "Oh, hi. Welcome to our village, I suppose. Just another face in the crowd.",

  "weak.dialogue.first.question/1": "Oh, hello there. What brings you to this humble village?",
  "weak.dialogue.first.question/2": "Oh, look! A newcomer! What brings you to our little corner of the world?",
  "weak.dialogue.first.question/3": "Well, well, well. An adventurer, huh? How on earth did you end up in this remote village?",
  "weak.dialogue.first.exploring/1": "We've got, like, not much going on here, but hey, you can stick around if you promise not to, like, cause any trouble.",
  "weak.dialogue.first.exploring/2": "If you play by the rules, you can totally chill here, dude.",
  "weak.dialogue.first.exploring/3": "Like, just be polite and stuff, and you can crash here for a bit, traveler.",
  "weak.dialogue.first.settling/1": "Oh, hello. It's, uh, nice to see someone new, I guess.",
  "weak.dialogue.first.settling/2": "Oh, hey. You're, um, here now. Welcome, I suppose.",
  "weak.dialogue.first.settling/3": "Oh, well, if you're going to stick around, I guess that's... fine.",
  "weak.dialogue.first.settling/4": "Oh, so you decided not to leave. Okay, I guess that's... good.",
  "weak.dialogue.first.spent_night.success/1": "Um, you could, like, maybe check out our inn if you want. It's, um, okay, I guess.",
  "weak.dialogue.first.spent_night.success/2": "So, like, if you need a place to crash and stuff, the inn is, like, not the worst option, I suppose.",
  "weak.dialogue.first.spent_night.success/3": "Hey, if you're into having, like, a kinda decent bed and, uh, edible food, then you might wanna consider hitting up the inn. Just saying.",
  "weak.dialogue.first.spent_night.failed/1": "Unfortunately, we're not exactly adept at constructing a cozy inn. It's just not one of our strong suits, I'm afraid.",
  "weak.dialogue.first.spent_night.failed/2": "Regrettably, our village lacks the necessary skills to construct a charming inn. It's a bit of a weakness on our part, I must admit.",
  "weak.dialogue.first.spent_night.failed/3": "I'm afraid our village is ill-equipped when it comes to providing a comfortable inn. Perhaps you'd have better fortune seeking refuge in a neighboring village?",

  "weak.dialogue.hug.success/1": "Wow, it's been ages since we last met!",
  "weak.dialogue.hug.success/2": "Oh, I appreciate the hug. It was much needed.",
  "weak.dialogue.hug.success/3": "Well, I suppose this hug did bring a tiny bit of happiness to my otherwise dull day.",
  "weak.dialogue.hug.success/4": "Huh, you're kind of cozy, like a fluffy bunny or something.",
  "weak.dialogue.hug.success/5": "Aww, thank you! *Returns the hug weakly*",
  "weak.dialogue.hug.success/6": "Um, you're quite warm, I guess.",
  "weak.dialogue.hug.fail/1": "You look a bit dirty there.",
  "weak.dialogue.hug.fail/2": "I'd rather not, thanks.",
  "weak.dialogue.hug.fail/3": "Um, I don't think so.",
  "weak.dialogue.hug.fail/4": "Remember when you insulted me? Yeah, no.",
  "weak.dialogue.hug.fail/5": "Honestly, I don't think you deserve a hug after your behavior.",
  "weak.dialogue.hug.fail/6": "Ugh, please don't touch me! I'm a bit germaphobic.",
  "weak.dialogue.hug.fail/7": "Oh, um, alright... thanks, I guess.",

  "weak.dialogue.kiss.success/1": "I hope this moment doesn't end too soon.",
  "weak.dialogue.kiss.success/2": "I might kinda sorta have feelings for you...",
  "weak.dialogue.kiss.success/3": "Mmm, this tastes pretty good, I guess.",
  "weak.dialogue.kiss.success/4": "Mmm! Your lips taste... alright.",
  "weak.dialogue.kiss.success/5": "Oh! You're not a terrible kisser, %1$s.",
  "weak.dialogue.kiss.success/6": "%1$s, your kissing skills are slightly above average. *chuckles*",
  "weak.dialogue.kiss.fail/1": "Oh, um, maybe we shouldn't do this in public.",
  "weak.dialogue.kiss.fail/2": "Is that... a kiss? I think you missed my lips entirely.",
  "weak.dialogue.kiss.fail/3": "I mean, Ash's kisses are just so much more passionate and electrifying.",
  "weak.dialogue.kiss.fail/4": "Um, have you heard of breath mints? Just a thought.",
  "weak.dialogue.kiss.fail/5": "Uh, thanks? I guess?",
  "weak.dialogue.kiss.fail/6": "Yikes, please, get off me!",

  "weak.dialogue.chat.success/1": "Ugh, cookies and milk. Sounds alright, I guess.",
  "weak.dialogue.chat.success/2": "Yeah, I guess the weather is alright today.",
  "weak.dialogue.chat.success/3": "I'm doing okay, I stubbed my toe this morning. Not a big deal.",
  "weak.dialogue.chat.success/4": "Oh, an apple a day. Yeah, whatever, I guess.",
  "weak.dialogue.chat.success/5": "Building my own village? Meh, sounds like a lot of effort.",
  "weak.dialogue.chat.success/6": "I think I saw %Supporter% the other day, all decked out in Diamond armor. Big whoop.",
  "weak.dialogue.chat.success/7": "My friend %Supporter% bragged about finding a chest full of diamonds yesterday. Whatever, not impressed.",
  "weak.dialogue.chat.success/8": "The weather is fine, I guess. Not like it really matters to me.",
  "weak.dialogue.chat.success/9": "Spiders and goblins? Pfft, I've dealt with worse in my lifetime.",
  "weak.dialogue.chat.success/10": "I wonder what happened to %Supporter%. They left a year ago, who cares?",
  "weak.dialogue.chat.success/12": "Did you hear what happened to %Supporter%? Yeah, neither did I.",
  "weak.dialogue.chat.success/13": "I've been considering adopting one of those stray cats around here, but honestly, I'm too busy.",
  "weak.dialogue.chat.success/14": "Redecorating my house? Nah, too lazy for that.",
  "weak.dialogue.chat.success/15": "Kids? Maybe someday, if I ever find someone worth the trouble.",
  "weak.dialogue.chat.success/16": "I wonder how different my life would be if I lived in the other village. Meh, who cares?",
  "weak.dialogue.chat.success/17": "Childhood memories? Yeah, I guess I had a few good times here and there.",
  "weak.dialogue.chat.success/18": "Haven't talked to my parents in a while. Maybe I'll visit them someday, if I feel like it.",
  "weak.dialogue.chat.success/19": "Traveling to the other village? Eh, I have friends I haven't seen in ages, but who needs 'em?",
  "weak.dialogue.chat.success/20": "Cheese? Yeah, I've heard of it. Not really interested.",
  "weak.dialogue.chat.fail/1": "Oh wow, did you seriously just say that? How adorable.",
  "weak.dialogue.chat.fail/2": "Hmm, I find it hard to believe that it exploded on its own. But hey, who am I to judge?",
  "weak.dialogue.chat.fail/3": "You know, you're not exactly the coolest kid on the block. Just saying.",
  "weak.dialogue.chat.fail/4": "Ugh, such a show off, aren't you?",
  "weak.dialogue.chat.fail/5": "Oh, please! You should be thrown in a dungeon for your ridiculousness!",
  "weak.dialogue.chat.fail/6": "Ew. Go away, you dress like you're stuck in the past. Not a good look.",
  "weak.dialogue.chat.fail/7": "That is such a dumb thing to talk about. Can't you come up with something more interesting?",
  "weak.dialogue.chat.fail/8": "Why are you talking to me again? I thought we established that I don't care.",
  "weak.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I didn't care enough to actually listen.",
  "weak.dialogue.chat.fail/10": "Excuse me? Did you really think I would be interested in what you have to say?",
  "weak.dialogue.chat.fail/11": "What on earth is wrong with you? Why would anyone talk about this nonsense?",
  "weak.dialogue.chat.fail/12": "Oh, I've heard some not-so-great things about you, and I can see why people might think that now.",
  "weak.dialogue.chat.fail/13": "Even zombies wouldn't waste their time talking to you. That's saying something.",
  "weak.dialogue.chat.fail/14": "You're about as likeable as a witch. And that's not a compliment, in case you were wondering.",
  "weak.dialogue.chat.fail/15": "Don't talk to me or I will have no choice but to call the guards to remove you from my presence.",
  "weak.dialogue.chat.fail/16": "Huh? Oh sorry, your conversation bored me to tears. Can we move on now?",
  "weak.dialogue.chat.fail/17": "Are you done talking? Because I have better things to do than listen to your nonsense.",
  "weak.dialogue.chat.fail/18": "I wonder if anyone will even notice when your mouth suddenly \"stays shut\" forever. Doubtful.",
  "weak.dialogue.chat.fail/19": "I'd rather stare at a pig's rear end than engage in conversation with you. Seriously.",
  "weak.dialogue.chat.fail/20": "Are you finished talking to me yet? Because I have places to be, and you're not one of them.",
  "weak.dialogue.chat.fail/21": "What, you actually believe the earth is round? Seriously? No corners? Wow, just wow.",

  "weak.dialogue.story.success/1": "Oh, wow! I can't believe all of that actually happened!",
  "weak.dialogue.story.success/2": "If only I had the courage to face a creeper like you did.",
  "weak.dialogue.story.success/3": "Your story was absolutely amazing! Did you come up with it yourself?",
  "weak.dialogue.story.success/4": "Wait, all of that really happened yesterday? That's hard to believe!",
  "weak.dialogue.story.success/5": "I was in the area yesterday, and it's crazy that I haven't heard about this yet.",
  "weak.dialogue.story.success/6": "Hehe, sounds like %Supporter% has quite the reputation. They must be incredible!",
  "weak.dialogue.story.success/7": "I think I've heard the Legend of %Supporter% a million times, but I never get tired of it. Tell me again, please!",
  "weak.dialogue.story.success/8": "Oh, so that's the epic tale of how you discovered your first diamond? Mind-blowing!",
  "weak.dialogue.story.success/9": "You should definitely drop by later! I'd be thrilled to hear more stories from you.",
  "weak.dialogue.story.fail/1": "Um, excuse me, but that's my mother you're talking about. Just thought you should know.",
  "weak.dialogue.story.fail/2": "The village is kind of buzzing about you, you know? Not in a good way, unfortunately.",
  "weak.dialogue.story.fail/3": "Huh? Sorry, I just don't quite get it. Can you explain again, please?",
  "weak.dialogue.story.fail/4": "Wow, you're just... terrible. Even creepers have feelings, you know? It's not cool to hurt them.",
  "weak.dialogue.story.fail/5": "Seriously, how could you bring yourself to kill such an innocent sheep? It's just not right.",
  "weak.dialogue.story.fail/6": "*yawns* Oh, sorry. I must have dozed off for a second there. What were we talking about?",
  "weak.dialogue.story.fail/7": "So, um, I'm just wondering, was that whole conversation really worth my precious time? 'Cause I'm not so sure.",
  "weak.dialogue.story.fail/8": "Yawn! I gotta be honest, this conversation is pretty boring. Can we talk about something more exciting?",
  "weak.dialogue.story.fail/9": "You know, I hate to say it, but you seem a little crazy. And not in a good way, if you catch my drift.",
  "weak.dialogue.story.fail/10": "I'm sorry, but I fail to see how that was even remotely good. Like, seriously, what were you thinking?",

  "weak.dialogue.flirt.success/1": "You're somewhat brave, I guess.",
  "weak.dialogue.flirt.success/2": "Oh, you! You're kinda cute, I suppose.",
  "weak.dialogue.flirt.success/3": "*Blushes* Do you actually mean that?",
  "weak.dialogue.flirt.success/4": "Oh, my... I'm not used to such compliments.",
  "weak.dialogue.flirt.success/5": "That was... kind of adorable, I guess. You got my attention, I suppose.",
  "weak.dialogue.flirt.success/6": "How do you manage to look somewhat stunning every day? When I look at you, I find it hard to come up with words.",
  "weak.dialogue.flirt.success/7": "Oh stop it! You're making me slightly blush.",
  "weak.dialogue.flirt.fail/1": "Are you serious? If so, I'll be shocked.",
  "weak.dialogue.flirt.fail/2": "Oh, really? I've heard that line before, from the blacksmith.",
  "weak.dialogue.flirt.fail/3": "Absolutely not, ever.",
  "weak.dialogue.flirt.fail/4": "How pitiful can you get?",
  "weak.dialogue.flirt.fail/5": "I'm sorry, but even a creeper would have better odds than you.",
  "weak.dialogue.flirt.fail/6": "Nope. Absolutely not. Period.",
  "weak.dialogue.flirt.fail/7": "Please, don't give me that look and never utter those words again.",

  "weak.dialogue.joke.creative.success/1": "*Chuckles* That's amusing!",
  "weak.dialogue.joke.creative.success/2": "That's mildly humorous!",
  "weak.dialogue.joke.creative.success/3": "That's decently entertaining!",
  "weak.dialogue.joke.creative.success/4": "You're slightly more amusing than %Supporter%!",
  "weak.dialogue.joke.creative.success/5": "Heh, you're mildly amusing! Have you ever considered a career in comedy?",
  "weak.dialogue.joke.creative.success/6": "Hm, that brought a slight smile to my face! It's one of the better jokes I've heard recently.",
  "weak.dialogue.joke.creative.success/7": "Hehe, you're mildly amusing, I suppose. Ash could learn a thing or two from you.",
  "weak.dialogue.joke.creative.success/8": "Ah, that's somewhat amusing, I suppose.",
  "weak.dialogue.joke.creative.failed/1": "Oh, you really tried to be funny, didn't you? Bless your heart.",
  "weak.dialogue.joke.creative.failed/2": "Huh, nice try at a joke there. Too bad it fell flat.",
  "weak.dialogue.joke.creative.failed/3": "Well, that was... something. Not exactly hilarious, but I'll give you points for effort.",
  "weak.dialogue.joke.creative.failed/4": "Oh, look at you attempting humor. It's cute, in a pitiful kind of way.",
  "weak.dialogue.joke.creative.failed/5": "Wow, that joke was about as amusing as watching paint dry. Impressive.",
  "weak.dialogue.joke.creative.failed/6": "Did you honestly think that would make me laugh? Sorry, but it's a swing and a miss.",
  "weak.dialogue.joke.creative.failed/7": "Ha, you should leave the comedy to the professionals. You're clearly out of your league.",

  "weak.dialogue.procreate_engaged/1": "I'd feel a little safer if we tied the knot first, you know?",
  "weak.dialogue.procreate_engaged/2": "I'm not really keen on bringing a whole new life into this world unless we've really solidified our commitment to each other.",

  "weak.dialogue.shake_hand.success/1": "Your grip is...well, nice, I suppose.",
  "weak.dialogue.shake_hand.success/2": "Your grip is...decent, I guess.",
  "weak.dialogue.shake_hand.success/3": "Oh, you're...polite, I suppose.",
  "weak.dialogue.shake_hand.success/4": "Good day, I guess.",
  "weak.dialogue.shake_hand.success/5": "Oh, hello there. How...nice.",
  "weak.dialogue.shake_hand.fail/1": "Oh wow, are you serious? You killed the poor cow and now you want to shake my hand?",
  "weak.dialogue.shake_hand.fail/2": "Ugh, no thanks. I don't need your germs anyway.",
  "weak.dialogue.shake_hand.fail/3": "Oh, no need to be polite to me. I'm used to being ignored.",
  "weak.dialogue.shake_hand.fail/4": "Oh, you're actually offering your hand? That's not like you at all.",
  "weak.dialogue.shake_hand.fail/5": "Please, just go away. I don't want any part in your weird handshake ritual.",

  "weak.dialogue.main.morning/1": "Oh, um, good morning...",
  "weak.dialogue.main.morning/2": "Morning... Do we really have to work today?",
  "weak.dialogue.main.morning/3": "Ugh, still tired... How about you?",
  "weak.dialogue.main.morning/5": "Looks like you didn't sleep much either... rough night, huh?",
  "weak.dialogue.main.morning/6": "Oh, great... another day. Just what I needed.",
  "weak.dialogue.main.morning/7": "So... did you actually manage to get some sleep? You seem... somewhat okay.",
  "weak.dialogue.main.morning/8": "Morning... I guess.",
  "weak.dialogue.main.morning/9": "Wow, what a beautiful morning... I guess it's time to reluctantly get to work.",
  "weak.dialogue.main.morning/10": "I think I might take it even slower today... not feeling too great, honestly.",
  "weak.dialogue.main.morning/11": "My schedule today is just overwhelming... I don't even want to think about it.",
  "weak.dialogue.main.morning/12": "Surprisingly, I got a decent night's sleep... but don't get any ideas, I'm still not up for anything too heavy.",
  "weak.dialogue.main.evening/1": "Evening, I guess.",
  "weak.dialogue.main.evening/2": "Wow, the day went by in a flash. How was it for you?",
  "weak.dialogue.main.evening/3": "Yup, another grueling day of work. Not even surprised anymore.",
  "weak.dialogue.main.evening/4": "Time just slipped through my fingers today. So much to do, so little motivation.",
  "weak.dialogue.main.evening/5": "I suppose it's time to head home and start thinking about what to cook.",
  "weak.dialogue.main.evening/6": "Ugh, today was such a waste. I accomplished basically nothing.",
  "weak.dialogue.main.evening/7": "My morning was a disaster. I might just crash for a nap soon.",
  "weak.dialogue.main.evening/8": "The thought of encountering a creeper is enough to make me run inside. Nighttime walks are a no-go for me.",
  "weak.dialogue.main.evening/9": "Hey, I bumped into the butcher while shopping for dinner. Catch up with you later, maybe.",
  "weak.dialogue.main.night/1": "Oh, wow, you're still awake? I'm ready to hit the hay.",
  "weak.dialogue.main.night/2": "I envy your night owl tendencies. I'm usually out like a light by now.",
  "weak.dialogue.main.night/3": "Do you find the night more intriguing than the day? I'm more of a daytime person myself.",
  "weak.dialogue.main.night/4": "Just a friendly reminder, it can get pretty dangerous out there with all those creepy creatures roaming around. Stay safe, okay?",
  "weak.dialogue.main.night/5": "The guards definitely make the village feel safer at night, but it still gives me the heebie-jeebies.",
  "weak.dialogue.main.night/6": "The darkness is just a bit unsettling for me. I prefer the calmness of daylight.",
  "weak.dialogue.main.night/7": "I'm more of a daytime stroller, but I can see the appeal of a nighttime walk.",
  "weak.dialogue.main.night/8": "I'm absolutely exhausted. I think I'll be taking it easy tomorrow. No more late nights for me.",
  "weak.dialogue.main.night/9": "Cozying up under the covers sounds like a dream right now. I can't wait to drift off to dreamland.",
  "weak.dialogue.main.night/10": "You really should get some rest. Tomorrow's going to be a busy day for you, or so I've heard.",

  "weak.dialogue.greet.mayor/1": "Hello there, Mayor. Hope you're doing well.",
  "weak.dialogue.greet.mayor/2": "Hey Mayor, take care now.",
  "weak.dialogue.greet.monarch/1": "Oh, uh, Your Majesty... if it pleases you.",
  "weak.dialogue.greet.monarch/2": "Your Highness, um, if it's not too much trouble...",

  "weak.dialogue.busy/1": "Oops, gotta get back to work, sorry!",
  "weak.dialogue.busy/2": "Thanks for understanding, but I've got a mountain of tasks to tackle.",
  "weak.dialogue.busy/3": "My to-do list is a mile long, can we catch up later?",
  "weak.dialogue.busy/4": "Work calls, my friend, catch you on the flip side.",
  "weak.dialogue.busy/5": "Oh no, my work is heating up, catch you later!",
  "weak.dialogue.goaway/1": "Ah, um, gosh, please, go away.",
  "weak.dialogue.goaway/2": "Oh, do you, like, have anything else to occupy your time?",
  "weak.dialogue.goaway/3": "Sorry, %1$s, um, I'm kind of busy at the moment, so, uh, can't really chat.",
  "weak.dialogue.goaway/4": "Oh, would you mind, like, finding someone else to bother?",
  "weak.dialogue.goaway/5": "Um, could you, like, step aside, please? You know, just, um, leave.",

  "weak.dialogue.greet": "Um, hey... How... uh... are you doing today?",
  "weak.dialogue.greet/1": "Oh, hey... um... how... um... are you doing today?",
  "weak.dialogue.greet/2": "Hey there, %1$s... um... how's it going?",
  "weak.dialogue.greet/3": "Oh, hello... um... did you need something?",
  "weak.dialogue.greet/4": "You look... um... ready to take on the day. How's it, uh, going?",
  "weak.dialogue.greet/5": "Oh, hello there, %1$s! It's... um... good to see you!",
  "weak.dialogue.greet/6": "Uh, hi...",
  "weak.dialogue.greet/7": "Nice to see you, I guess...",
  "weak.dialogue.greet/8": "Hello there! It's... um... lovely to see you. How are you... um... today?",
  "weak.dialogue.greet/9": "Hey! I'm... uh... glad to see you!",

  "weak.dialogue.greet.negative/1": "Ugh, go away! You're like, the last person I wanted to see right now!",
  "weak.dialogue.greet.negative/2": "Oh, joy. Look who decided to show up. Again.",
  "weak.dialogue.greet.negative/3": "Hmm, what do you want?",
  "weak.dialogue.greet.negative/4": "Oh, it's you. I was kind of hoping for a different visitor.",
  "weak.dialogue.greet.negative/5": "Back to bother me, huh?",

  "weak.dialogue.greet.success/1": "Oh, that's alright, I guess.",
  "weak.dialogue.greet.success/2": "Not too bad, I suppose.",
  "weak.dialogue.greet.success/3": "Well, that's... decent, I suppose.",
  "weak.dialogue.greet.success/4": "Oh, that's mildly pleasing to hear, I suppose.",
  "weak.dialogue.greet.success/5": "Huh, well, I guess that's... tolerable.",
  "weak.dialogue.greet.fail/1": "Oh, um...",
  "weak.dialogue.greet.fail/2": "Well, that's... nice, I guess.",
  "weak.dialogue.greet.fail/3": "Uh, alright then.",
  "weak.dialogue.greet.fail/4": "Really? How... interesting.",
  "weak.dialogue.greet.fail/5": "Oh, well...",

  "weak.dialogue.apologize.success/1": "Oh, don't you worry one bit, mistakes are just a part of life, aren't they?",
  "weak.dialogue.apologize.success/2": "Well, no biggie, we all slip up now and then, don't we?",
  "weak.dialogue.apologize.success/3": "Oh, it's nothing to lose sleep over, dearie. We all have our fair share of slip-ups, after all.",
  "weak.dialogue.apologize.success/4": "Don't sweat it, my friend. Mistakes are like little blips on the radar of life.",
  "weak.dialogue.apologize.success/5": "Ah, no need to beat yourself up over it, my dear. We all stumble and fall at times. Just dust yourself off and keep going.",
  "weak.dialogue.apologize.fail/1": "Um, could you like, just leave, please?",
  "weak.dialogue.apologize.fail/2": "Oh, great, now I have a bruise! Thanks for that!",
  "weak.dialogue.apologize.fail/3": "Oh, nice try with that excuse, but I'm not buying it!",
  "weak.dialogue.apologize.fail/4": "Ouch! I don't really think your apology will make this pain go away, so forget it!",
  "weak.dialogue.apologize.fail/5": "Uh, no thanks, I don't think I'll be accepting your apology anytime soon.",

  "weak.dialogue.location.failed/1": "Nope, haven't heard a thing, and I don't expect to.",
  "weak.dialogue.location.failed/2": "Aw, sorry pal, but I really don't have any juicy info on cool spots.",
  "weak.dialogue.location.failed/3": "Nah, don't waste your time asking me, I'm clueless about any legendary ruins or hidden treasures.",
  "weak.dialogue.location.forgot/1": "Ah, shoot! I stumbled upon a really neat spot earlier, but my memory failed me and I totally spaced on marking it on the map. My bad!",
  "weak.dialogue.location.forgot/2": "You won't believe it, but I actually stumbled across something super interesting earlier. Ugh, I can't believe it slipped my mind to jot it down! Sorry about that.",
  "weak.dialogue.location.forgot/3": "Oh no, I had something to share with you, something really cool! But it completely slipped my mind, I'm afraid. I'm terribly sorry for forgetting!",
  "weak.dialogue.location.igloo/1": "I stumbled upon an igloo at %2$s. Can you believe someone actually lives there? How do they survive the cold? It gives me goosebumps just thinking about it!",
  "weak.dialogue.location.igloo/2": "Guess what I found at %2$s? An igloo! Who in their right mind would choose to live in such a freezing place? It's like they have an affinity for frostbite or something.",
  "weak.dialogue.location.igloo/3": "You won't believe what I saw at %2$s. There's an igloo, or should I say, a pathetic excuse for a shelter. It's as if someone wanted to experience the misery of living in an icebox. I pity those poor souls.",
  "weak.dialogue.location.pyramid/1": "Yeah, I saw a pyramid over there at %2$s. Nothing special though, just a bunch of sand and stones.",
  "weak.dialogue.location.pyramid/2": "People keep talking about a pyramid at %2$s. I mean, sure, go check it out if you're into that kind of stuff. Personally, I don't see the appeal.",
  "weak.dialogue.location.pyramid/3": "Oh, there's a pyramid at %2$s. Some fool went in there a while ago and never came back. Guess it's not worth the risk, huh?",
  "weak.dialogue.location.ruined_portal_desert/1": "I can hardly believe it myself, but there's an absolute disaster of a portal out there amidst the desert sands. It's beyond repair, I'm afraid.",
  "weak.dialogue.location.ruined_portal_swamp/1": "Oh, um, yeah. So, there's like this totally wrecked portal over at %2$s. It's, like, in the middle of the swamp. And, um, the Nether dudes, they, like, didn't even realize they'd end up in this, like, super lame place.",
  "weak.dialogue.location.ruined_portal/1": "Oh, um, there's this ruined portal at %2$s. Yeah, it got all messed up by those Nether creatures. It's kinda sad, really.",
  "weak.dialogue.location.ruined_portal/2": "So, uh, if you go to %2$s, you might see this ruined nether portal. It's, like, totally creepy, you know? But don't worry, it's probably safe. Just, um, avoid the magma. Seriously, don't step on it.",
  "weak.dialogue.location.ruined_portal/3": "Hey, uh, so there's this place called %2$s, and it used to be this nether portal, but now it's just a bunch of ancient ruins. The cleric dude says so, at least. And, like, some people think there could be treasure there, but honestly, who would even dare to go near that place? Not me, for sure.",
  "weak.dialogue.location.ruined_portal_mountain/1": "Oh, um, yeah, there's, like, this totally ruined portal thingy over there in the mountains at %2$s. It's, um, pretty wrecked and stuff.",
  "weak.dialogue.location.mansion/1": "If, uh, you happen to, um, make your way to %2$s, you might come across this, um, kind of creepy mansion… owned, like, totally owned by those, uh, illagers. I mean, it's, um, probably not a good idea to, uh, venture anywhere near that, like, cursed place... for your own safety and all that, you know?",
  "weak.dialogue.location.mansion/2": "So, uh, there's, um, this huge mansion over at %2$s that belongs, um, unfortunately, to those illagers. I don't know, but, like, maybe it'd be, um, wise if we, um, considered, um, moving the village to, uh, someplace very far away from here… just a, uh, suggestion, you know, for everyone's sake.",
  "weak.dialogue.location.monument/1": "Uh, hey there! So, uh, I heard there's like this totally sunken castle at %2$s? And, um, there might be sea monsters guarding it or something. Yeah, I'd, uh, definitely stay away from that place if I were you. Just a friendly heads up, you know?",
  "weak.dialogue.location.monument/2": "Yo, guess what? So, word on the street is that there are these ancient ruins hidden deep in the ocean at %2$s. Like, whoa, treasure, right? But, uh, fair warning, it's gonna be pretty dang dangerous, my dude. So, you know, if you're into that kind of risky stuff, go for it. But if not, maybe sit this one out, ya know?",
  "weak.dialogue.location.shipwreck/1": "Oh, there's this old shipwreck at %2$s. I think it used to be owned by the Eastern Alliance Company or something. Not that it matters now, of course.",
  "weak.dialogue.location.shipwreck/2": "You know, I heard some fishermen blabbering about a shipwreck they found at %2$s. I mean, who cares if there's some treasure or not? It's probably all rusted and worthless anyway.",
  "weak.dialogue.location.shipwreck_beached/1": "Hey, uh, so, I stumbled upon this, like, totally ruined ship at %2$s, right by the beach. Seriously, you can't miss it. Not that you'd want to see it or anything...",
  "weak.dialogue.location.shipwreck_beached/2": "Ugh, so, there's this place at %2$s, and it's got this stupid ship that washed up on the shore. Like, how does that even happen? I mean, who cares, right? Whatever.",
  "weak.dialogue.location.village_desert/1": "Oh, there's another village over there in the desert. It's quite lovely, I must say.",
  "weak.dialogue.location.village_taiga/1": "Oh, there's um, this sort of village thingy over at %2$s. It's, uh, nestled in the middle of a taiga biome, I think.",
  "weak.dialogue.location.village_taiga/2": "If you like, you could, uh, venture over to %2$s and see this other village. It's like, really hidden deep in the taiga biome. That's what I've heard, at least.",
  "weak.dialogue.location.village_snowy/1": "Oh, there's a village over yonder. It's freezing cold there, I tell ya!",
  "weak.dialogue.location.village_snowy/2": "You won't believe it, but there's this village in the snowy plains. The folks there are pretty friendly, but boy, does it get chilly!",
  "weak.dialogue.location.village_plains/1": "Ah, there's another village over yonder. Quite lovely, if I must say so myself.",
  "weak.dialogue.location.village_plains/2": "If you venture deep into the plains, you'll stumble upon another village. It's rather quaint, really.",
  "weak.dialogue.location.village_savanna/1": "Oh, there's another village at %2$s. But be careful, it's quite hot out there.",
  "weak.dialogue.location.village_savanna/2": "Over in the savanna, at %2$s, you'll stumble upon another village. The people there are nice, but not as friendly as they could be.",
  "weak.dialogue.location.swamp_hut/1": "I, uh, heard there's some witchy business going on in the swamp over at %2$s. I mean, if it were up to me, I'd stay far, far away from that place. It's all just... too spooky.",
  "weak.dialogue.location.swamp_hut/2": "So, uh, word on the block is, %2$s is where you can find this, uh, creepy witch's hut. I mean, I'm not one to gossip or anything, but I'd definitely think twice before venturing anywhere near that cursed place. Trust me, it's not for the faint of heart.",
  "weak.dialogue.location.mineshaft/1": "You know, we had a mine here in the past. But, uh, unfortunate incident, and now it's closed. Should be somewhere around %2$s, I think.",
  "weak.dialogue.location.mineshaft/2": "Ah, yes. There used to be a mine, you see, just nearby at %2$s. Unfortunately, it became infested with those dreadful monsters. It's terribly unsafe down there now. Take my advice, be cautious if you dare venture into the depths.",
  "weak.dialogue.location.jungle_pyramid/1": "I heard whispers about some old temple situated at %2$s. It's probably best if you stay away from there, unless you enjoy danger and potential death, that is.",
  "weak.dialogue.location.jungle_pyramid/2": "Hey, have you ever ventured into the jungle and stumbled upon %2$s? Yeah, well, let's just say it's a hot spot for ancient ruins. You know, those kind with traps that could end your life in a heartbeat. So, unless you're feeling lucky, I'd suggest you steer clear of that place. Trust me, it's not worth the risk. Our ancestors would've looted it ages ago if it weren't for those deadly traps.",
  "weak.dialogue.location.pillager_outpost/1": "Oh, uh, just a heads up, there are some, uh, Pillagers hanging out at %2$s. They kinda set up this outpost thingy nearby. It's not great, you know? We're just hoping they don't attack us again 'cause, uh, we can't really handle another one of those.",
  "weak.dialogue.location.pillager_outpost/2": "Ugh, so there's this annoying outpost run by those Pillagers at %2$s, and honestly, it's a real mood killer. Like, if you happen to wander over there, watch your back 'cause they're trigger-happy and won't hesitate to shoot you. It's like living in constant fear, you know?",
  "weak.dialogue.location.pillager_outpost/3": "Oh, hey! If you're ever around %2$s, you might notice this outpost that those pesky Pillagers claimed. It's, like, their little hideout or something. If you're brave enough to take 'em down, though, there might be some cool stuff to loot. And, hey, the whole village would be super grateful if you could do us a solid and, you know, get rid of 'em.",
  "weak.dialogue.location.ancient_city/0": "Um, yeah, so there were these kind of weird noises, like, deep underground... I mean, I'm not really sure what it was or anything.",
  "weak.dialogue.location.ancient_city/1": "Hey, so, don't quote me on this, but I think there might be something, like, really buried down there, like, super deep beneath the ground at %2$s. You know, just a hunch or whatever.",
  "weak.dialogue.location.ancient_city/3": "You know, there's been talk, like, legends and stuff, about this ancient city at %2$s. But hey, I haven't actually seen anything with my own eyes, so who knows? Maybe it's like, totally underground or something.",

  "weak.dialogue.joke.monster.success/1": "Oh, wow! That Skelly got what it deserved, I guess.",
  "weak.dialogue.joke.monster.success/2": "Can you believe it? A zombie actually thought it could defeat you with a shovel. Haha, how weak!",
  "weak.dialogue.joke.monster.success/3": "You managed to assert your dominance over that spider. Impressive... I suppose.",
  "weak.dialogue.joke.monster.success/4": "You somehow convinced a skeleton to take out a creeper? Well, I wouldn't call it impressive, but it's... something, I guess.",
  "weak.dialogue.joke.monster.success/5": "Haha, can you believe how easily cave spiders fall for your tricks? They're practically begging to be defeated.",
  "weak.dialogue.joke.monster.failed/1": "Uh, you know, skeletons... they're kinda like alive, you know? So maybe we shouldn't be so mean to them...",
  "weak.dialogue.joke.monster.failed/2": "I don't get why everyone thinks it's funny when creepers explode. It's actually kinda scary if you ask me...",
  "weak.dialogue.joke.monster.failed/3": "It's just really sad to think that zombies and skeletons were once like us. I mean, they didn't choose to be that way...",
  "weak.dialogue.joke.monster.failed/4": "So, um, I saw an enderman fall into water the other day. It was, um, interesting... I guess?",
  "weak.dialogue.joke.monster.failed/5": "I mean, it's not that funny, but like, if someone keeps getting ambushed by silverfish on the toilet, maybe they should, um, do something about it? Just saying...",

  "weak.dialogue.joke.animal.success/1": "Poor sheep, losing its wool... Well, at least it's good for a chuckle.",
  "weak.dialogue.joke.animal.success/2": "And then, to everyone's surprise, the wolf developed a soft spot for the sheep. Quite amusing, isn't it?",
  "weak.dialogue.joke.animal.success/3": "Ha! Can you believe it? Chickens pulling off that stunt? Absolutely ridiculous, but it brings a smile to my face!",
  "weak.dialogue.joke.animal.success/4": "Haha! That's the kind of dumb humor I enjoy! It's silly, but it cracks me up every time.",
  "weak.dialogue.joke.animal.success/5": "Thank goodness cows have an endless supply of milk! It's like their superpower or something, don't you think?",
  "weak.dialogue.joke.animal.failed/1": "Oh, please refrain from making such jokes, they're really not nice.",
  "weak.dialogue.joke.animal.failed/2": "Oh dear, that sheep must be feeling quite upset. It's really not amusing in the slightest.",
  "weak.dialogue.joke.animal.failed/3": "My pig doesn't appreciate such remarks, you know. It's not very kind.",
  "weak.dialogue.joke.animal.failed/4": "That's quite below the belt, I must say.",
  "weak.dialogue.joke.animal.failed/5": "Oh, come on now. Making fun of a cow's eyebrows? That's just mean-spirited.",

  "weak.dialogue.flirt.slap/1": "Um, sorry to bother you.",
  "weak.dialogue.flirt.slap/2": "I-I don't mean to be forward, but... have you ever been taught how to flirt? It's just... um... interesting, you know?",
  "weak.dialogue.kiss.slap/1": "Oh, um, how dare you?",
  "weak.dialogue.kiss.slap/2": "Maybe, just maybe, if you were to try that again, there might be a slight chance that the next one could possibly, maybe, leave a mark... I think.",

  "weak.dialogue.chat.plains/1": "I guess you could say I'm pretty content with the plains. I mean, it's all I know. But sometimes, I wonder what it would be like to venture out and see what else is out there.",
  "weak.dialogue.chat.plains/2": "You know, the plains may not be the most thrilling biome, but there's something about its tranquility that just puts me at ease. I can't imagine calling any other place home.",
  "weak.dialogue.chat.plains/3": "There's this magical quality to the plains at night, you know? It's like the stars shine just a little brighter and the silence becomes a symphony. It's almost as if the plains come alive under the moon's gentle gaze.",
  "weak.dialogue.chat.plains/4": "Sometimes, I like to lay down in the grass and lose myself in the vast expanse of the sky above. It's a moment of pure serenity, where all the worries of the world seem to fade away.",
  "weak.dialogue.chat.plains/5": "Breathing in the crisp, clean air of the plains is like a breath of life itself. It's like nature's own perfume, even better than the scent of pine in the taiga.",
  "weak.dialogue.chat.plains/6": "Sure, the plains might not be the flashiest or most exciting biome, but there's a certain beauty in its simplicity. Sometimes, less is more, you know?",
  "weak.dialogue.chat.plains/7": "When the weather is like this, it takes me back to my childhood days of frolicking in the fields, picking wildflowers. Ah, memories. Oh, and Ash? Well, let's just say he was my first crush. I always hoped those flowers would catch his attention.",
  "weak.dialogue.chat.plains/8": "There's something truly magical about watching the morning sun rise over the plains. It paints the sky in hues of gold and pink, creating a breathtaking masterpiece. You absolutely must experience it for yourself one day. Trust me, it's worth waking up early for.",
  "weak.dialogue.chat.savanna/1": "The savanna is scorching hot, but hey, at least we don't have to deal with snowstorms like those weaklings in colder biomes.",
  "weak.dialogue.chat.savanna/2": "Ugh, those llamas can be a real pain sometimes, but I guess I've learned to tolerate them in this savanna life.",
  "weak.dialogue.chat.savanna/3": "The architecture here in the savanna is pretty cool, I guess. It's definitely unique, but honestly, it's not my cup of tea.",
  "weak.dialogue.chat.savanna/4": "Ha! The savanna biome might seem plain and unimpressive, but trust me, it's got some hidden gems if you know where to look.",
  "weak.dialogue.chat.savanna/5": "You know, one thing we have going for us savanna folks is that we have rivers flowing through our villages, unlike those dry and barren desert settlements.",
  "weak.dialogue.chat.savanna/6": "The hills and terrains around here can be quite intriguing, I suppose. Not my favorite sight, but it's something, I guess.",
  "weak.dialogue.chat.savanna/7": "Thank goodness for those acacia trees providing shade in this scorching heat. They're like my savior during long workdays in the savanna.",
  "weak.dialogue.chat.savanna/8": "We savanna villagers take great pride in our melons and pumpkins. They're the best in the world, you know? That's why other villages can't resist trading with us.",
  "weak.dialogue.chat.taiga/1": "The woods are alright, I guess. They have some building material and stuff, but not much else.",
  "weak.dialogue.chat.taiga/2": "Yeah, it's cold here in the taiga biome. I mean, we have what we need, I suppose. It's not like there's anything better anyway.",
  "weak.dialogue.chat.taiga/3": "Taiga forests are whatever. The berries are okay, I guess.",
  "weak.dialogue.chat.taiga/4": "Foxes in the taiga? Yeah, they're alright, I guess. I mean, sometimes I feed them berries. They're kinda sneaky, though.",
  "weak.dialogue.chat.taiga/5": "The wolves here, they're not so bad. I mean, they don't bother us much, I guess.",
  "weak.dialogue.chat.taiga/6": "The air here is fine, I guess. It's not like it's amazing or anything.",
  "weak.dialogue.chat.taiga/7": "Ugh, those berry bushes can be a pain. I mean, sure, the berries are good, but getting pricked? No thanks.",
  "weak.dialogue.chat.taiga/8": "The rain here is cold, I guess. It's not like it's exciting or anything. It's just quiet, I guess.",
  "weak.dialogue.chat.snowy_plains/1": "I do get a bit chilly around here, but as long as I have a cozy blanket and a hot cup of cocoa, I can survive.",
  "weak.dialogue.chat.snowy_plains/2": "Brrr! This freezing weather is unbearable, but luckily I have a secret stash of hot chocolate to keep me warm.",
  "weak.dialogue.chat.snowy_plains/3": "Ugh, I can't stand this cold. I just want to curl up under my blanket and binge-watch my favorite shows.",
  "weak.dialogue.chat.snowy_plains/4": "Remember when it used to snow and we would have epic snowball fights? Ah, those were the days. I wish we could bring back those good ol' times.",
  "weak.dialogue.chat.snowy_plains/5": "The strays roaming around at night can be quite annoying. I mean, who wants to deal with their annoying tipped arrows? Not me!",
  "weak.dialogue.chat.snowy_plains/6": "Stay on high alert, my dear villagers. There have been recent sightings of some menacing wolves lurking around.",
  "weak.dialogue.chat.snowy_plains/7": "You won't believe how annoying it is to accidentally touch an iron golem. It's like being trapped in a never-ending, iron grip. Trust me, it's not fun at all!",
  "weak.dialogue.chat.snowy_plains/8": "I have such fond memories of my childhood. My parents used to surprise me with a pumpkin, and we would have the most epic snow golem building competitions. Good times, good times.",
  "weak.dialogue.chat.desert/1": "I can't believe how hot it is in this desert. But hey, at least we don't have to deal with freezing winters like those other places.",
  "weak.dialogue.chat.desert/2": "Ugh, this desert heat never lets up. It's warm all year round, which is nice... I guess.",
  "weak.dialogue.chat.desert/3": "I swear, this desert is like a never-ending tanning salon. I'm either constantly rocking a tan or nursing a painful sunburn.",
  "weak.dialogue.chat.desert/4": "You know, the only good thing about this desert is the night sky. It's actually pretty breathtaking when it cools down and we can stargaze.",
  "weak.dialogue.chat.desert/5": "Oh my goodness, can we talk about the scorching sun today? It's like nature cranked up the heat and forgot to turn it down.",
  "weak.dialogue.chat.desert/6": "Seriously, have you stepped outside? The sun is absolutely brutal today. It's like we're living on the surface of the sun itself.",
  "weak.dialogue.chat.desert/7": "So, have you managed to spot any rabbits around here? They blend in so well with this desert backdrop, it's like a game of hide-and-seek!",
  "weak.dialogue.chat.desert/8": "You know what's the worst part of living here? Those darn husks. Every time they smack you, it's like they drain all your energy and leave you ravenous. It's so unfair!",
  "weak.dialogue.chat.desert/9": "Ouch, let me tell you about my run-in with a cactus the other day. Those sneaky plants are everywhere, just waiting to prick unsuspecting souls like me. Stay on your toes!",
  "weak.dialogue.chat.desert/10": "Life in this dry, unforgiving desert is anything but easy. But hey, at least we have this village where we can scrape together enough water and food to survive. It's not much, but it's something.",

  "weak.dialogue.story.exploring.success/1": "That's cool! Maybe one day I'll gather enough courage to venture out into the world too.",
  "weak.dialogue.story.exploring.success/2": "Oh, how I envy your adventurous spirit! While I cherish my village and loved ones, the thought of exploring distant lands stirs a longing within me.",
  "weak.dialogue.story.exploring.success/3": "It takes a special kind of bravery to face the great unknown without hesitation. You truly are an inspiration.",
  "weak.dialogue.story.exploring.fail/1": "I must say, your tales are quite repetitive.",
  "weak.dialogue.story.exploring.fail/2": "Oh, be careful now, wouldn't want you to strain yourself with all that edginess.",
  "weak.dialogue.story.exploring.fai/l3": "Interacting with you is like conversing with a timid little mouse who dreams of being a mighty lion someday. Minus the endearing charm, of course.",

  "weak.dialogue.story.nether.success/1": "Is it, like, really hot over there or something?",
  "weak.dialogue.story.nether.success/2": "Uh, surviving in a place as dangerous as the Nether? I don't think I could handle it, honestly.",
  "weak.dialogue.story.nether.success/3": "I heard rumors about treasure in the Nether, but I don't think I could ever work up the courage to even step foot in there.",
  "weak.dialogue.story.nether.success/4": "You must have nerves of steel to go to the Nether! Me? Oh, I'd be shaking in my boots. Not that I'd ever go, of course.",
  "weak.dialogue.story.nether.success/5": "Have you, like, seen any Zombified Piglins around or whatever? Just curious.",
  "weak.dialogue.story.nether.fail/1": "I doubt you've ever stepped a toe into the Nether.",
  "weak.dialogue.story.nether.fail/2": "Oh, no wonder those Piglins went after you. It's like you're begging for trouble.",
  "weak.dialogue.story.nether.fail/3": "Honestly, I couldn't care less if you've been to the Nether. Your storytelling skills are just abysmal.",
  "weak.dialogue.story.nether.fail/4": "Um, sorry, but you're not exactly oozing with strength to venture into the Nether.",
  "weak.dialogue.story.nether.fail/5": "My dear old grandpa would explore the Nether like it was his backyard, and he never once mentioned anything about warped fungus. You're clearly making things up!",

  "weak.dialogue.story.enderdragon.success/1": "Oh, wow! Did you actually manage to defeat the dragon? That's... quite something.",
  "weak.dialogue.story.enderdragon.success/2": "Goodness gracious! You... you actually did it! The village won't believe it! Your name will be whispered in awe for ages to come!",
  "weak.dialogue.story.enderdragon.fail/1": "Oh no, you've lost your marbles! The ender dragon? It's just a silly legend, nothing more.",
  "weak.dialogue.story.enderdragon.fail/2": "Ha! You're pulling my leg, right? No one in their right mind would dare face off against that monstrous dragon!",

  "weak.dialogue.story.wither.success/1": "No way! I heard the Wither is like the ultimate destroyer or something!",
  "weak.dialogue.story.wither.success/2": "Whoa, you actually managed to defeat the Wither? That's like, mind-blowing!",
  "weak.dialogue.story.wither.fail/1": "I'm not so sure I can trust you.",
  "weak.dialogue.story.wither.fail/2": "Honestly, you don't seem beaten up enough for me to buy that story.",

  "weak.dialogue.stay.fail/1": "Sorry, but I'm not really up for staying in this quaint little village.",
  "weak.dialogue.stay.fail/2": "Thanks for the offer, but I'm more inclined to wander and discover new things!",
  "weak.dialogue.stay.fail/3": "This village is lovely, but I have a restless spirit that yearns for adventure.",
  "weak.dialogue.stay.repeat/1": "I'm pretty sure I already answered that question for you.",
  "weak.dialogue.stay.repeat/2": "Oh, didn't I just answer that for you? I must be getting forgetful in my old age.",
  "weak.dialogue.stay.success/1": "Uh, thanks I guess. I mean, staying in this village wouldn't be the worst thing ever.",
  "weak.dialogue.stay.success/2": "Oh, well, I suppose I wouldn't mind staying in this village. It's not exactly my dream destination, but it'll do.",
  "weak.dialogue.stay.no_space/1": "Umm, this village is like, sooo crowded, you know?",
  "weak.dialogue.stay.no_space/2": "I kind of wanted to stay, but like, there are totally no beds left.",

  "weak.dialogue.hire/1": "Uh, I guess I can lend a hand if you want. Just give me a heads up, okay? I'll stick around, but don't expect too much.",
  "weak.dialogue.hire/2": "Sure thing, boss. If you need me, I'll be here. Just make sure those emeralds are ready, alright? Not that I'm super eager or anything.",
  "weak.dialogue.hire/3": "Alrighty then, I suppose I can help you out. But let's not get too carried away. Get those emeralds prepared, and we'll see how things go, I guess.",
  "weak.dialogue.no_money/1": "Sorry, but I can't work for free. You'll have to come up with more emeralds if you want my services.",
  "weak.dialogue.no_money/2": "Can't you see the price tag? It's gonna take a lot more emeralds to make a deal with me, buddy.",
  "weak.dialogue.no_money/3": "Listen, I may not be the strongest villager around, but I know my worth. You'll have to cough up some more emeralds if you want me on your side.",

  "weak.dialogue.main.rock_paper_scissor/1": "Sure, let's play Rock Paper Scissors. But, umm... I'm not very good at it, so don't expect much from me.",
  "weak.dialogue.rock_paper_scissor/1": "Let's play a round of rock, paper, scissors, shall we?",
  "weak.dialogue.rock_paper_scissor/2": "Oh, I guess we can play rock, paper, scissors again. But don't worry, I won't be too hard on you this time!",
  "weak.dialogue.rock_paper_scissor.rock/1": "Oh, I guess I'll go with... rock!",
  "weak.dialogue.rock_paper_scissor.paper/1": "Paper it is, although I'm not feeling very victorious...",
  "weak.dialogue.rock_paper_scissor.scissor/1": "Oh, um, scissor!",
  "weak.dialogue.rock_paper_scissor.loose.rock/1": "I opted for paper! And wouldn't you know it, victory is in my hands!",
  "weak.dialogue.rock_paper_scissor.loose.paper/1": "I think I'll choose scissors for this round!",
  "weak.dialogue.rock_paper_scissor.loose.scissor/1": "Haha! Scissors just couldn't handle the brute force of my rock! I am the victor!",
  "weak.dialogue.rock_paper_scissor.win.rock/1": "Oh dear, rock triumphs over scissor, and I'm on the losing side.",
  "weak.dialogue.rock_paper_scissor.win.paper/1": "Rock seems to have a personal vendetta against me, I can never win with it.",
  "weak.dialogue.rock_paper_scissor.win.scissor/1": "My paper crumbled under the might of your scissors. Congrats on the victory!",
  "_": ""
}