{
  "tips.console.1": "Utilisez une houe pour préparer les zones de terre pour la plantation.",
  "tips.console.2": "Donnez un os à un loup pour l'apprivoiser. Vous pouvez ensuite le faire asseoir ou vous suivre.",
  "tips.console.3": "Utilisez le bon outil pour le travail !",
  "tips.console.4": "Un seul seau de lave suffit à fondre 100 blocs dans un four.",
  "tips.console.5": "La lave peut prendre plusieurs minutes pour DISPARAÎTRE COMPLÈTEMENT lorsque le bloc source est enlevé.",
  "tips.console.6": "Placer deux coffres côte à côte fera un grand coffre.",
  "tips.console.7": "Vous pouvez changer le point d'apparition de votre jeu et passer la nuit jusqu'à l'aube en dormant dans un lit.",
  "tips.console.8": "Les clôtures empilables sont maintenant dans le jeu !",
  "tips.console.9": "Les loups ne peuvent pas entrer dans le Nether.",
  "tips.console.10": "Récoltez le cuir des vaches et utilisez-le pour fabriquer une l'armure.",
  "tips.console.11": "Saviez-vous qu'il existe un Wiki Minecraft ?",
  "tips.console.12": "Plantez de jeunes pousses et elles produiront des arbres.",
  "tips.console.13": "Les blocs qui peuvent être utilisés comme source de lumière feront fondre la neige et la glace. Cela inclut les torches, la pierre lumineuse et les Jack-O-Lanternes.",
  "tips.console.14": "Les poules pondent un œuf toutes les 5 à 10 minutes.",
  "tips.console.15": ".party() était excellent !",
  "tips.console.16": "L'obsidienne ne peut se miner qu'à l'aide d'une pioche en diamant.",
  "tips.console.17": "L'obsidienne se forme lorsque l'eau touche un bloc source de lave.",
  "tips.console.18": "Les Creepers sont la source la plus facilement obtenable de poudre à canon.",
  "tips.console.19": "Ne regardez pas un Enderman dans les yeux !",
  "tips.console.20": "Ne regardez pas les bugs dans les yeux.",
  "tips.console.21": "L'instrument joué par un bloc musical dépend du matériau sur lequel il est posé.",
  "tips.console.22": "Les loups n'attaqueront pas les Creepers.",
  "tips.console.23": "Si vous avez réglé la difficulté du jeu sur Paisible, votre santé se régénérera automatiquement, et aucun monstre ne sera de sortie à la nuit tombée !",
  "tips.console.24": "Toujours supposer que les rumeurs sont fausses, plutôt que de supposer qu'elles sont vraies !",
  "tips.console.25": "Manger des côtelettes de porc cuites donne plus de santé que manger des côtelettes de porc crues.",
  "tips.console.26": "Personne chez Mojang n'a jamais vu le visage de junkboy.",
  "tips.console.27": "Il y aura éventuellement une mise à jour de ce jeu !",
  "tips.console.28": "Certaines personnes célèbres jouent à Minecraft!",
  "tips.console.29": "Mojang a plus de récompenses que de personnel !",
  "tips.console.30": "deadmau5 aime Minecraft!",
  "tips.console.31": "La construction d'un portail vous permettra de voyager vers une autre dimension - Le Nether.",
  "tips.console.32": "Lisez la section \"Quoi de neuf\" dans les menus \"Comment jouer\" pour voir les dernières informations de mise à jour sur le jeu.",
  "tips.console.33": "Cuire du cactus dans un four pour obtenir de la teinture verte.",
  "tips.console.34": "La pierre taillée est résistante aux boules de feu Ghast, ce qui la rend utile pour protéger les portails.",
  "tips.console.35": "Qui est Notch?",
  "tips.console.36": "Notch a plus d'un million de followers sur twitter!",
  "tips.console.37": "Les creepers explosent quand ils s'approchent de vous !",
  "tips.console.38": "Creuser la terre ou le sable avec une pelle est plus rapide qu'avec votre main !",
  "tips.console.39": "Soyez prudent lorsque vous construisez des structures en laine en plein air, car la foudre peut mettre le feu à la laine.",
  "tips.console.40": "Si vous ne pouvez pas trouver de charbon pour vos torches, vous pouvez toujours fabriquer du charbon de bois à partir des arbres dans un fourneau.",
  "tips.console.41": "L'engrais d'os (fabriqué à partir d'un os de squelette) peut être utilisé comme fertilisant et peut faire pousser les choses instantanément !",
  "tips.console.42": "Dormir dans un lit la nuit fera avancer rapidement le jeu jusqu'à l'aube, mais tous les joueurs dans une partie multijoueur doivent dormir dans des lits en même temps.",
  "tips.console.43": "Certains animaux vous suivront si vous avez du blé dans votre main.",
  "tips.console.44": "Le nouveau bureau de Mojang est cool!",
  "tips.console.45": "Les araignées ne vous attaqueront pas pendant la journée - à moins que vous ne les attaquiez.",
  "tips.console.46": "Fabriquez des torches pour éclairer les zones la nuit. Les monstres éviteront les zones autour de ces torches.",
  "tips.console.47": "Si un animal ne peut pas se déplacer de plus de 20 blocs dans n'importe quelle direction, il ne disparaîtra pas.",
  "tips.console.48": "Creuser droit vers le bas ou droit vers le haut n'est pas une bonne idée.",
  "tips.console.49": "Les Creepers sont nés d'un bug de codage.",
  "tips.console.50": "Les loups apprivoisés montrent leur santé avec la position de leur queue. Donnez-leur de la viande pour les soigner.",
  "tips.console.51": "Renvoyez ces boules de feu vers le Ghast !",
  "tips.console.52": "Tous les Suédois n'ont pas les cheveux blonds. Certains, comme Jens de Mojang, ont même les cheveux roux !",
  "tips.console.53": "Si vous avez un seau vide, vous pouvez le remplir avec du lait d'une vache, de l'eau ou de la lave !",
  "tips.console.54": "C'est une poule ou un canard ?",
  "tips.console.55": "Les zombies et les squelettes peuvent survivre à la lumière du jour s'ils sont dans l'eau.",
  "tips.console.56": "Attaquer un loup provoquera l'hostilité de tous les loups à proximité immédiate et ils vous attaqueront. Cette caractéristique est également partagée par les Zombie Pigmen.",
  "tips.console.57": "Les Pigmen ne vous attaqueront pas, à moins que vous ne les attaquiez.",
  "tips.console.58": "Récoltez des côtelettes de porc à partir de cochons, cuisinez-les et mangez-les pour regagner de la santé.",
  "tips.console.59": "Arrivez plus rapidement aux destinations avec un chariot et des rails !",
  "tips.console.60": "Musique par C418 !",
  "tips.console.minecon.1": "Étiez-vous à la Minecon?",
  "tips.console.minecon.2": "Personne ne se souvient où s'est déroulé la Minecon 2014.",
  "tips.console.minecon.3": "La Minecon 2011 était à Las Vegas, Nevada, États-Unis !",
  "tips.console.minecon.4": "La Minecon 2012 était à Paris, France!",
  "tips.console.minecon.5": "La Minecon 2013 était à Orlando, Floride, États-Unis !",
  "tips.console.minecon.6": "La Minecon 2015 était à Londres, Royaume-Uni!",
  "tips.console.minecon.7": "La Minecon 2016 était à Anaheim, Californie, États-Unis !",
  "tips.console.java.1": "Minecraft: Java Edition a battu de nombreux records!",
  "tips.console.java.2": "Nous pensons que Mojang a supprimé Herobrine de la Java Edition, mais nous ne sommes pas trop sûrs.",
  "tips.console.java.3": "minecraftforum a une section dédiée à l'Édition Java.",
  "tips.console.java.4": "Vous obtiendrez les dernières informations sur ce jeu de Minecraft sur Twitter !",
  "tips.console.java.5": "Modifier les paramètres de luminosité pour rendre le jeu plus lumineux ou plus sombre."
}