{
  "curious.dialogue.main/1": "Well, well, well, who do we have here?",
  "curious.dialogue.main/2": "Greetings! How's life treating you today?",
  "curious.dialogue.main/3": "Ah, it's you again! How's everything going in your world?",
  "curious.dialogue.main/4": "Tell me, friend, what adventures have you embarked on today?",
  "curious.dialogue.main/5": "How's your day treating you, my inquisitive friend?",
  "curious.dialogue.main/6": "Ahoy, %1$s! What intriguing things have crossed your path today?",
  "curious.dialogue.main/7": "Oh, you wouldn't believe the tale I have for you! I was with %supporter% when a zombie took a nibble at him. Can you imagine? He assured me it was nothing to fret about, and I took his word for it... Oh, what was I saying? Right, right! I actually spotted a zombie that bore a striking resemblance to %supporter% today! Quite an odd coincidence, don't you think?",

  "curious.dialogue.rumors.failed/1": "My dear interlocutor, my curiosity knows no bounds, yet it seems the winds of rumor have failed to carry any new secrets to my eagerly awaiting mind.",
  "curious.dialogue.rumors.lore/1": "Have you heard the whispers? Jax may still have followers, but the buzz around Sirben is growing louder by the day. His prophets, MerlinWolfGames and Crow, are spreading his sacred teachings far and wide.",
  "curious.dialogue.rumors.lore/2": "Ah, the tales of old! There was a time when Cyberdemons attempted to invade our realm, using otherworldly portals to infiltrate the Overworld. But fear not, for Sirben and the mighty Luke thwarted their wicked plans, ensuring our safety.",
  "curious.dialogue.rumors.lore/3": "Have you ever pondered the fate of the Ancient Builder? Rumor has it that 2DA50, entangled in the mystery of their disappearance, ventured into the enigmatic Far Lands, never to be seen again.",
  "curious.dialogue.rumors.lore/4": "Behold the grandeur! MerlinWolfGames himself constructed a magnificent temple, a testament to his unwavering devotion to Sirben. It stands as one of the true wonders of the ancient world.",
  "curious.dialogue.rumors.lore/5": "Delve into the annals of legend! Once upon a time, an extraordinary race of builders graced our land, their architectural marvels dotting the Overworld. Alas, they have vanished into the mists of time, leaving behind only whispers of their greatness.",
  "curious.dialogue.rumors.lore/6": "Have you been regaled with the tales of yore? Legends speak of the ancient builders, master craftsmen who sculpted the very fabric of our realm. Their remnants, the ruins and temples scattered across the Overworld, stand as a testament to their unmatched artistry.",

  "curious.dialogue.first.generic/1": "Well, well, well, would you look at that! A fresh face in our humble village! Welcome, welcome!",
  "curious.dialogue.first.generic/2": "Ah, greetings! My curious eyes have never laid sight upon your visage before. How delightful to have a newcomer amongst us!",
  "curious.dialogue.first.generic/3": "Well, isn't this intriguing? A stranger wandering into our little haven. Welcome, my dear traveler! Prepare to be amazed by our village's wonders.",
  "curious.dialogue.first.generic/4": "Oh, my inquisitive mind can't help but wonder! Who might you be, adventurous soul? Welcome to our village, where tales are spun and legends are born!",
  "curious.dialogue.first.generic/5": "Oh, my dear wanderer, it feels like ages since we've had the pleasure of hosting a traveler. Allow us to extend our warmest welcome and make our village your haven!",
  "curious.dialogue.first.generic/6": "Greetings, greetings! Do pardon my curiosity, but I'm absolutely fascinated by new faces gracing our village. Welcome, my friend! Let the stories and adventures begin!",

  "curious.dialogue.first.question/1": "Well, well, well. Look who we have here. What piqued your interest in our humble village?",
  "curious.dialogue.first.question/2": "Greetings, stranger! I must say, your arrival has stirred up quite a commotion. Care to share the tale behind your presence in our midst?",
  "curious.dialogue.first.question/3": "Oh, my stars! A newcomer! Pray tell, what extraordinary circumstances led you to stumble upon our charming little village?",
  "curious.dialogue.first.exploring/1": "Our humble abode may not boast extravagance, but rest assured, you are most welcome here, provided you adhere to our rules.",
  "curious.dialogue.first.exploring/2": "Venture forth, weary wanderer, and should you find solace in our modest dwellings, remember to heed the laws that bind us.",
  "curious.dialogue.first.exploring/3": "Ah, greetings, inquisitive explorer! Feel free to roam our humble village, but do kindly observe the proper etiquette, dear visitor.",
  "curious.dialogue.first.settling/1": "Oh, what a delightful surprise! A new face has graced our humble village!",
  "curious.dialogue.first.settling/2": "Ah, greetings, dear neighbor! How delightful it is to have you join our vibrant little community!",
  "curious.dialogue.first.settling/3": "Oh, how positively thrilling! Another soul eager to lend a hand and contribute to the prosperity of our village!",
  "curious.dialogue.first.settling/4": "My, my, my! You've made the wise decision to plant your roots here? Oh, how fortunate we are to have you!",
  "curious.dialogue.first.spent_night.success/1": "Have you heard the tales of our magnificent inn? It's an absolute wonder!",
  "curious.dialogue.first.spent_night.success/2": "Ah, dear traveler, if you seek respite and replenishment, our inn is a sight to behold! The epitome of comfort and indulgence!",
  "curious.dialogue.first.spent_night.success/3": "Oh, how your weary bones must long for the embrace of a cozy bed and a scrumptious meal! The answer lies within our inn, my friend, a place where warmth and nourishment intertwine!",
  "curious.dialogue.first.spent_night.failed/1": "Ah, alas, an inn we do not possess! Our humble abilities in construction fail to meet the requirements for such an establishment, I'm afraid.",
  "curious.dialogue.first.spent_night.failed/2": "Oh, how unfortunate! Our village lacks the honor of possessing an inn. Please pardon our inadequacies!",
  "curious.dialogue.first.spent_night.failed/3": "Ah, have you considered venturing to another village, dear traveler? They might be better equipped to quench your thirst for lodging!",

  "curious.dialogue.hug.success/1": "Wow, it's been ages since we last crossed paths!",
  "curious.dialogue.hug.success/2": "Oh, how delightful! That hug was just what the doctor ordered.",
  "curious.dialogue.hug.success/3": "Well, well, well, look who just brightened up my day! Thank you, kind soul.",
  "curious.dialogue.hug.success/4": "Oh, my goodness! You're like a cozy campfire in human form!",
  "curious.dialogue.hug.success/5": "Oh, bless your heart! Here's a big ol' hug in return for your warmth.",
  "curious.dialogue.hug.fail/1": "Wow, what an interesting choice of attire! Covered in soot and mud, huh?",
  "curious.dialogue.hug.fail/2": "I appreciate the offer, but I'll have to decline, my friend.",
  "curious.dialogue.hug.fail/3": "Oh, forgive my curiosity, but why would you like to engage in a hug?",
  "curious.dialogue.hug.fail/4": "Ah, remember when you called me a dinosaur? I'll have to pass on the hug this time, buddy.",
  "curious.dialogue.hug.fail/5": "To be completely honest with you, I believe your actions have warranted a lack of hug-worthy affection.",
  "curious.dialogue.hug.fail/6": "Oh dear, I'm terribly sorry, but I must avoid any physical contact. Your germs, you see...",
  "curious.dialogue.hug.fail/7": "Well, isn't that... unexpected? Thank you, I suppose?",

  "curious.dialogue.kiss.success/1": "This moment is so captivating, I never want it to end.",
  "curious.dialogue.kiss.success/2": "2. Could this be love? I can't help but think it might be.",
  "curious.dialogue.kiss.success/3": "3. Pumpkin pie has nothing on the sweetness I feel when I'm with you.",
  "curious.dialogue.kiss.success/4": "4. Your lips, like honey, leave the most delicious taste on mine.",
  "curious.dialogue.kiss.success/5": "5. Wow, you really know how to make my heart flutter with your kisses, %1$s.",
  "curious.dialogue.kiss.success/6": "6. Your kissing skills are on another level compared to Ash! *giggles*",
  "curious.dialogue.kiss.fail/1": "Is it possible for anyone to catch a glimpse?",
  "curious.dialogue.kiss.fail/2": "Is that what you consider a kiss?",
  "curious.dialogue.kiss.fail/3": "Oh, Ash's kisses are on a whole different level!",
  "curious.dialogue.kiss.fail/4": "Let me introduce you to the concept of breath mints, my friend. Two words, remember!",
  "curious.dialogue.kiss.fail/5": "Well, thank you, I suppose?",
  "curious.dialogue.kiss.fail/6": "Please, I kindly request that you remove yourself from my personal space!",

  "curious.dialogue.chat.success/1": "Oh my, the thought of cookies and milk is making my taste buds tingle! I must get some!",
  "curious.dialogue.chat.success/2": "Isn't the weather absolutely fascinating? I can't help but be captivated by its beauty.",
  "curious.dialogue.chat.success/3": "Life is treating me well, except for that little mishap with my toe this morning. Curiosity truly comes with a price!",
  "curious.dialogue.chat.success/4": "They say an apple a day keeps the zombies away, but I wonder if there's any truth to that. Quite intriguing, don't you think?",
  "curious.dialogue.chat.success/5": "Oh, the ambition to build my own village burns within me, but alas, laziness tends to get the best of me. A curious conundrum indeed!",
  "curious.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter% in their glorious Diamond armor! I couldn't believe my curious eyes!",
  "curious.dialogue.chat.success/7": "You won't believe what my dear friend %Supporter% shared with me recently. They stumbled upon a chest overflowing with shimmering diamonds! Utterly astonishing!",
  "curious.dialogue.chat.success/8": "Have you noticed the remarkable weather we've been having? The sunny days have been a delight for my curious soul.",
  "curious.dialogue.chat.success/9": "I've been a resident of this place for as long as I can remember, yet these spiders and goblins still baffle me. Such curious creatures!",
  "curious.dialogue.chat.success/10": "My mind often wanders, wondering about the fate of %Supporter%. It's been so long since they embarked on their remarkable journey.",
  "curious.dialogue.chat.success/12": "Have you heard the wild tale of %Supporter%? They encountered an adventure that left everyone's jaws dropped!",
  "curious.dialogue.chat.success/13": "I've been harboring a desire to adopt one of the adorable stray cats roaming around here. Curiosity is calling me to embrace a feline friend!",
  "curious.dialogue.chat.success/14": "In due time, I shall embark on the task of revamping my humble abode. But for now, my curious laziness takes hold.",
  "curious.dialogue.chat.success/15": "Ah, the thought of having children one day fills me with curiosity and wonder. I must find the perfect partner to embark on that incredible journey.",
  "curious.dialogue.chat.success/16": "Ever since I set foot in this village, I've often pondered what life would be like in the neighboring settlement. The grass is always greener, isn't it?",
  "curious.dialogue.chat.success/17": "Nostalgia often grips my heart, flooding me with memories of cherished childhood moments. Oh, the joy and wonder of those bygone days!",
  "curious.dialogue.chat.success/18": "It's been far too long since I visited my dear parents. A trip to see them is long overdue. My curious heart yearns for their embrace",
  "curious.dialogue.chat.fail/1": "Wait, did you really just say that?",
  "curious.dialogue.chat.fail/2": "I find it hard to believe that it exploded on its own, mind explaining?",
  "curious.dialogue.chat.fail/3": "You know, I've always wondered, what makes you think you're so cool?",
  "curious.dialogue.chat.fail/4": "Oh, look at you, such a show-off.",
  "curious.dialogue.chat.fail/5": "You know, if I had a say, I'd suggest throwing you in a dungeon!",
  "curious.dialogue.chat.fail/6": "Ew, go away! Your fashion sense seems to be from a different era.",
  "curious.dialogue.chat.fail/7": "That topic seems rather silly, don't you think?",
  "curious.dialogue.chat.fail/8": "Why are you seeking my attention once again? I'm curious.",
  "curious.dialogue.chat.fail/9": "Huh? Did you say something? Apologies, I was lost in thought, do tell.",
  "curious.dialogue.chat.fail/10": "Excuse me? I'm genuinely intrigued by your statement.",
  "curious.dialogue.chat.fail/11": "What seems to be bothering you? Why are you so fixated on this topic?",
  "curious.dialogue.chat.fail/12": "Interesting, I've heard some unfavorable things about you, care to discuss?",
  "curious.dialogue.chat.fail/13": "It seems even zombies prefer silence over engaging with you, fascinating.",
  "curious.dialogue.chat.fail/14": "You're as fascinating as a witch! That's actually a compliment in my book.",
  "curious.dialogue.chat.fail/15": "Don't talk to me, or I might have to summon the guards, I'm genuinely curious.",
  "curious.dialogue.chat.fail/16": "Huh? Oh, I'm sorry, I got a bit lost in thought there. Continue, please.",
  "curious.dialogue.chat.fail/17": "Are you finished with your thoughts? I'm quite curious to know.",
  "curious.dialogue.chat.fail/18": "I wonder if anyone would truly miss your endless babbling, a thought to ponder.",
  "curious.dialogue.chat.fail/19": "I'd rather observe a pig's rear than continue this conversation with you, truly captivating.",
  "curious.dialogue.chat.fail/20": "Are you done talking to me? I'm genuinely curious about your next topic.",
  "curious.dialogue.chat.fail/21": "What? You actually believe the earth is round? Fascinating! I'm curious to hear more about your perspective.",

  "curious.dialogue.story.success/1": "Oh really? That's absolutely fascinating! I can hardly believe it!",
  "curious.dialogue.story.success/2": "Oh, how I envy your bravery! I often dream of facing a creeper myself.",
  "curious.dialogue.story.success/3": "Wow, what an incredible story! Did you come up with it all on your own?",
  "curious.dialogue.story.success/4": "No way, you're telling me all of that happened just yesterday? That's incredible!",
  "curious.dialogue.story.success/5": "Oh my goodness, how did I not hear about this sooner? I was literally in the vicinity!",
  "curious.dialogue.story.success/6": "Hahaha! Ah, the legendary %Supporter%! Such a remarkable individual, indeed!",
  "curious.dialogue.story.success/7": "Oh, I've lost count of how many times I've heard the mesmerizing Legend of %Supporter%. Please, do tell it once more!",
  "curious.dialogue.story.success/8": "Oooh, so that's the secret behind your first diamond discovery? How utterly fascinating!",
  "curious.dialogue.story.success/9": "You simply must come over later! I'm positively dying to hear more of your captivating tales.",
  "curious.dialogue.story.fail/1": "Excuse me, but I must inquire - who is this mother you so boldly reference?",
  "curious.dialogue.story.fail/2": "Ah, your reputation precedes you, my dear. The village is abuzz with tales of your exploits.",
  "curious.dialogue.story.fail/3": "Pardon my curiosity, but I'm struggling to comprehend the intricacies of this situation.",
  "curious.dialogue.story.fail/4": "My goodness gracious! It's unconscionable to disregard the feelings of those poor Creepers.",
  "curious.dialogue.story.fail/5": "I must express my utmost dismay! How could one possibly justify the slaughter of an innocent sheep?",
  "curious.dialogue.story.fail/6": "*yawning* Oh, my apologies! I was momentarily lost in my thoughts. Pray, continue.",
  "curious.dialogue.story.fail/7": "Alas, I find myself pondering the worthiness of investing my precious time in such endeavors.",
  "curious.dialogue.story.fail/8": "Oh dear, forgive my lack of enthusiasm. This conversation does not captivate my inquisitive mind.",
  "curious.dialogue.story.fail/9": "You, my dear interlocutor, possess a level of eccentricity that surpasses all rational standards.",
  "curious.dialogue.story.fail/10": "I must confess, it eludes me entirely how that particular endeavor could be deemed praiseworthy.",

  "curious.dialogue.flirt.success/1": "Oh, you! Stop being so intriguing!",
  "curious.dialogue.flirt.success/2": "*Blushes* Do you truly mean that?",
  "curious.dialogue.flirt.success/3": "Oh, my... I'm simply captivated!",
  "curious.dialogue.flirt.success/4": "That was unbelievably charming! You had me from the moment we met!",
  "curious.dialogue.flirt.success/5": "How do you consistently exude such captivating charm? Your mere presence leaves me in awe.",
  "curious.dialogue.flirt.success/6": "Oh, please, enough! You're making me blush with curiosity.",
  "curious.dialogue.flirt.fail/1": "Oh really? So, has anyone else fallen for your smooth talk?",
  "curious.dialogue.flirt.fail/2": "Hm, interesting. How many times have you used that line today?",
  "curious.dialogue.flirt.fail/3": "Is that the best you've got? I expected something more captivating.",
  "curious.dialogue.flirt.fail/4": "You know, your chances with me are slim to none.",
  "curious.dialogue.flirt.fail/5": "Sorry, but I've seen more charming skeletons than you.",
  "curious.dialogue.flirt.fail/6": "Please, spare me the embarrassment and never attempt that again.",

  "curious.dialogue.joke.creative.success/1": "Oh my, that's absolutely amusing!",
  "curious.dialogue.joke.creative.success/2": "Haha, that's quite entertaining!",
  "curious.dialogue.joke.creative.success/3": "That's the most hilarious thing I've come across today!",
  "curious.dialogue.joke.creative.success/4": "You know, you might just surpass %Supporter%'s humor!",
  "curious.dialogue.joke.creative.success/5": "My sides are splitting from laughter! You should seriously consider a career as a professional comedian!",
  "curious.dialogue.joke.creative.success/6": "Goodness me, that joke was pure gold! It's been ages since I laughed so hard!",
  "curious.dialogue.joke.creative.success/7": "Teehee! You've got a knack for humor, much better than Ash, I must say!",
  "curious.dialogue.joke.creative.success/8": "Ahah, that's genuinely funny! You've got a knack for cracking jokes!",
  "curious.dialogue.joke.creative.failed/1": "I must admit, I never quite understood the humor in that joke.",
  "curious.dialogue.joke.creative.failed/2": "Oh, I see... So that's what passes as a joke these days?",
  "curious.dialogue.joke.creative.failed/3": "Pardon me, but I fail to find the amusement in your attempt at humor.",
  "curious.dialogue.joke.creative.failed/4": "Fascinating! Is that the best joke you could conjure up?",
  "curious.dialogue.joke.creative.failed/5": "Well, that was an interesting attempt at comedy, to say the least.",
  "curious.dialogue.joke.creative.failed/6": "How intriguing! I never knew such a peculiar sense of humor existed.",
  "curious.dialogue.joke.creative.failed/7": "Please enlighten me, what's the appeal in a joke like that?",
  "curious.dialogue.joke.creative.failed/8": "You know, I've heard children tell better jokes while playing hopscotch.",

  "curious.dialogue.procreate_engaged/1": "It would put my mind at ease if we took that leap of faith and tied the knot before starting a family.",
  "curious.dialogue.procreate_engaged/2": "I believe it's essential for us to solidify our commitment to one another before embarking on the beautiful journey of bringing new life into this world.",

  "curious.dialogue.shake_hand.success/1": "Your handshake reveals a fascinating level of dexterity!",
  "curious.dialogue.shake_hand.success/2": "The strength behind your grip is truly awe-inspiring!",
  "curious.dialogue.shake_hand.success/3": "Oh, how intriguing! Your polite manners are quite refreshing!",
  "curious.dialogue.shake_hand.success/4": "Greetings, kind sir/madam!",
  "curious.dialogue.shake_hand.success/5": "Well, well, well! What a pleasant surprise to encounter you here!",
  "curious.dialogue.shake_hand.fail/1": "Oh my, are you serious? After you mercilessly vanquished the poor cow?",
  "curious.dialogue.shake_hand.fail/2": "Hmm, interesting proposition, but I'll politely decline.",
  "curious.dialogue.shake_hand.fail/3": "Oh, how intriguing! I'm not a complete stranger, why be so polite?",
  "curious.dialogue.shake_hand.fail/4": "Oh my goodness, is this some kind of new side to you? I'm bewildered!",
  "curious.dialogue.shake_hand.fail/5": "Oh dear, kindly take your leave, good sir/madam.",

  "curious.dialogue.main.morning/1": "Top o' the mornin' to ya!",
  "curious.dialogue.main.morning/2": "G'mornin', what adventures await us today?",
  "curious.dialogue.main.morning/3": "I can't help but wonder, did you have a restless night too?",
  "curious.dialogue.main.morning/5": "Well, well, well, someone had a wild night, eh?",
  "curious.dialogue.main.morning/6": "Wakey wakey, pal! Brace yourself for a marathon of a day.",
  "curious.dialogue.main.morning/7": "How did you manage to get such a rejuvenating slumber? You're positively radiant!",
  "curious.dialogue.main.morning/8": "Rise and shine, lazybones!",
  "curious.dialogue.main.morning/9": "Ah, what a splendid morning! I have a feeling today holds endless possibilities!",
  "curious.dialogue.main.morning/10": "Today, I think I might take it easy and explore the art of relaxation. I'm feeling quite curious about it.",
  "curious.dialogue.main.morning/11": "My schedule is bursting at the seams today, just thinking about it makes me giddy with excitement!",
  "curious.dialogue.main.morning/12": "Guess who slept like a log? That's right, me! Time to conquer the day with gusto!",
  "curious.dialogue.main.evening/1": "Good evening! Did you have an adventurous day?",
  "curious.dialogue.main.evening/2": "Can you believe how quickly the sun disappeared? So, what exciting things happened today?",
  "curious.dialogue.main.evening/3": "Another grueling day, huh? Share with me the trials and tribulations of your work!",
  "curious.dialogue.main.evening/4": "Time just slipped away, didn't it? So many tasks, so little daylight to accomplish them all!",
  "curious.dialogue.main.evening/5": "You know, I'm getting a little hungry. I should go home and start concocting a fabulous dinner!",
  "curious.dialogue.main.evening/6": "Time slipped through my fingers today. I didn't really accomplish anything of significance.",
  "curious.dialogue.main.evening/7": "I'm thinking of indulging in a nap soon. The morning was quite rough, I must admit.",
  "curious.dialogue.main.evening/8": "As the darkness creeps in, I tend to retreat indoors. One never knows what lurks in the night!",
  "curious.dialogue.main.evening/9": "Oh, hello there! I was just at the butcher, gathering ingredients for a spectacular dinner. Shall we catch up later?",
  "curious.dialogue.main.night/1": "Wow, burning the midnight oil, huh? What's keeping you up?",
  "curious.dialogue.main.night/2": "Late nights seem to be your thing, huh? What's the secret?",
  "curious.dialogue.main.night/3": "So, what brings you out into the night? Searching for adventure, perhaps?",
  "curious.dialogue.main.night/4": "Just a friendly reminder, the night can be quite treacherous. But hey, I won't judge if you like living on the edge!",
  "curious.dialogue.main.night/5": "The village guards are great, but there's something thrilling about the eerie nighttime atmosphere, isn't there?",
  "curious.dialogue.main.night/6": "Ah, the tranquility of darkness. I find it oddly satisfying, like a soothing lullaby for the soul.",
  "curious.dialogue.main.night/7": "When the sun sets, the world becomes a painter's canvas, don't you think? Perfect for an evening stroll.",
  "curious.dialogue.main.night/8": "I'm absolutely beat. Today took a lot out of me. Might have to take a rain check on being productive tomorrow.",
  "curious.dialogue.main.night/9": "Ah, the sweet sanctuary of sleep. Can't wait to dive into my cozy nest and drift away into dreamland.",
  "curious.dialogue.main.night/10": "Psst! I've heard rumors that a full night's rest can work wonders. Perhaps it's time to tuck yourself in and rejuvenate.",

  "curious.dialogue.greet.mayor/1": "Greetings, esteemed Mayor! How fares your day?",
  "curious.dialogue.greet.mayor/2": "Wishing you a splendid day, oh wise Mayor!",
  "curious.dialogue.greet.monarch/1": "Your Majesty, may I humbly inquire about the affairs of the realm?",
  "curious.dialogue.greet.monarch/2": "Ah, Your Highness, might I indulge in the knowledge of the happenings in our glorious kingdom?",

  "curious.dialogue.busy/1": "Wow, I'm intrigued by your stories, but duty calls and I must accomplish my tasks before sundown.",
  "curious.dialogue.busy/2": "Oh, the wonders of conversation! Alas, I find myself engrossed in pressing matters at the moment. Shall we reconvene at a later time?",
  "curious.dialogue.busy/3": "Pardon me, dear interlocutor, but my obligations command my attention. Fear not, for we shall resume our delightful banter in due course.",
  "curious.dialogue.busy/4": "My apologies, but the flames of productivity beckon me back to my misplaced furnace. We shall continue our delightful exchange once I rectify this fiery mishap!",
  "curious.dialogue.goaway/1": "Don't you have any exciting adventures to embark on?",
  "curious.dialogue.goaway/2": "Sorry, %1$s, my curiosity is piqued elsewhere at the moment.",
  "curious.dialogue.goaway/3": "Go pester another soul, for I am consumed by my insatiable thirst for knowledge.",
  "curious.dialogue.goaway/4": "Begone, you uncivilized creature!",

  "curious.dialogue.greet": "Greetings! What's the latest buzz in your world?",
  "curious.dialogue.greet/1": "Hey there! What fascinating adventures have you embarked on today?",
  "curious.dialogue.greet/2": "Well, well, well, look who it is! How's the Minecraft universe treating you, %1$s?",
  "curious.dialogue.greet/3": "Oh, hello there, curious wanderer. Is there something intriguing you seek?",
  "curious.dialogue.greet/4": "Wow, you're positively radiating curiosity! How's your journey through Minecraft unfolding?",
  "curious.dialogue.greet/5": "Ahoy, %1$s! Tell me, what exciting tales do you bring from your travels?",
  "curious.dialogue.greet/6": "Heyo! What thrilling escapades have you found yourself in lately?",
  "curious.dialogue.greet/7": "Delightful to cross paths with you again! What exciting discoveries have you made?",
  "curious.dialogue.greet/8": "Greetings, my inquisitive friend! How goes your exploration of this pixelated realm?",
  "curious.dialogue.greet/9": "Hey, hey, hey! Thrilled to have you back! What wonders have captivated your attention today?",

  "curious.dialogue.greet.negative/1": "Ugh, seriously? Why are you here? I was hoping for someone more interesting.",
  "curious.dialogue.greet.negative/2": "Well, well, well. Look who decided to show up. Not exactly thrilled, but I guess I can tolerate your presence.",
  "curious.dialogue.greet.negative/3": "Hm? What brings you to my humble abode? I'm intrigued, but cautiously so.",
  "curious.dialogue.greet.negative/4": "Oh, it's you...again. Not exactly the visitor I was hoping for, but beggars can't be choosers, I suppose.",
  "curious.dialogue.greet.negative/5": "Ah, the bearer of annoyance has returned. Just what I needed to brighten up my day... not.",

  "curious.dialogue.greet.success/1": "That's fantastic news, I'm absolutely thrilled to hear it!",
  "curious.dialogue.greet.success/2": "Oh, wonderful! I'm positively buzzing with curiosity about your well-being!",
  "curious.dialogue.greet.success/3": "Well, isn't that just splendid! It warms my inquisitive heart to know you're doing well!",
  "curious.dialogue.greet.success/4": "Oh, how delightful! I'm positively intrigued by your good fortune!",
  "curious.dialogue.greet.success/5": "Well, isn't that just the most fascinating thing I've heard all day! I'm positively beaming with excitement for you!",
  "curious.dialogue.greet.fail/1": "Interesting...",
  "curious.dialogue.greet.fail/2": "Well, isn't that fascinating...",
  "curious.dialogue.greet.fail/3": "Oh, how peculiar...",
  "curious.dialogue.greet.fail/4": "Seriously? Well, that's intriguing...",
  "curious.dialogue.greet.fail/5": "Oh my goodness, you don't say...",

  "curious.dialogue.apologize.success/1": "Don't worry, accidents like that are a great opportunity to learn!",
  "curious.dialogue.apologize.success/2": "2. Oh, no worries at all! Just remember to keep an eye out next time, curiosity can lead us into unexpected situations.",
  "curious.dialogue.apologize.success/3": "3. Ah, it's all good! We all stumble upon mishaps on our journey of discovery.",
  "curious.dialogue.apologize.success/4": "4. No problemo! Embracing mistakes is how we unlock new knowledge and grow our understanding of the world.",
  "curious.dialogue.apologize.success/5": "5. Hey, it's absolutely fine! Remember, curiosity is a powerful force, it's only natural to occasionally stumble upon a little oopsie.",
  "curious.dialogue.apologize.fail/1": "Oh, hello there! Is there something specific you're looking for?",
  "curious.dialogue.apologize.fail/2": "Oh, it seems you accidentally bumped into me. Was it intentional?",
  "curious.dialogue.apologize.fail/3": "Haha, nice try, but I'm not buying that excuse!",
  "curious.dialogue.apologize.fail/4": "Ouch! That really stung! No need to apologize, just be careful next time!",
  "curious.dialogue.apologize.fail/5": "Hmm, sorry, but I don't think I can accept your apology. Better luck next time!",

  "curious.dialogue.location.failed/1": "Oh, I've been listening closely, but alas, my ears have yet to capture any fresh whispers.",
  "curious.dialogue.location.failed/2": "Regrettably, my inquisitive soul must inform you that there are no captivating locales of which I am privy.",
  "curious.dialogue.location.failed/3": "Oh, my dear seeker of thrills, I must confess that embarking on perilous escapades through monster-infested ruins is not our preferred pastime.",
  "curious.dialogue.location.forgot/1": "Oh, the tales I could tell! I came across an absolutely captivating location, but my excitement got the better of me, and I completely neglected to jot it down. My memory, oh, how it eludes me! I apologize profusely.",
  "curious.dialogue.location.forgot/2": "Dear me, how frustrating! I chanced upon a truly enchanting place, but my mind played tricks on me, and I failed to commit it to memory. Oh, the regret! I apologize sincerely for my forgetfulness.",
  "curious.dialogue.location.forgot/3": "Oh, the mysteries that surround me! I stumbled upon a mesmerizing location, but alas, my memory is as fleeting as a passing breeze. I neglected to mark it on my map, and for that, I offer my sincerest apologies.",
  "curious.dialogue.location.igloo/1": "Guess what I stumbled upon? An igloo at %2$s! Can you believe someone actually built a house out of snow? Brrr! I can't wrap my head around that one.",
  "curious.dialogue.location.igloo/2": "You won't believe what I discovered! There's this deserted igloo at %2$s. I don't think anyone lives there anymore. And, fun fact, I've heard strange noises coming from that place. It's like a ghostly symphony whenever I pass by...",
  "curious.dialogue.location.igloo/3": "Hey, have you heard about the abandoned ice palace at %2$s? It's this fancy igloo made entirely of ice! Can you imagine how long it's been vacant? I bet even the polar bears refuse to crash there anymore.",
  "curious.dialogue.location.pyramid/1": "Oh, have you seen that magnificent pyramid at %2$s? It's quite intriguing, isn't it?",
  "curious.dialogue.location.pyramid/2": "Rumor has it that there's a pyramid over yonder at %2$s. I wonder what mystical secrets lie within its ancient walls.",
  "curious.dialogue.location.pyramid/3": "Ah, yes! There's a splendid pyramid waiting for you at %2$s. It's been whispering tales of untold riches and unimaginable wonders. Care to give it a go? But be warned, brave adventurer, for it has swallowed many souls who dared to enter its domain.",
  "curious.dialogue.location.ruined_portal_desert/1": "You wouldn't believe your eyes! There's a ruined portal in the middle of the desert, precisely at %2$s. I couldn't help but be drawn to its enigmatic allure!",
  "curious.dialogue.location.ruined_portal_swamp/1": "Hey, have you seen that wrecked portal over there in the swamp? It's like the Nether invaders stumbled upon a total dump.",
  "curious.dialogue.location.ruined_portal/1": "Oh my, have you seen the ruined portal at %2$s? It's like something out of a nightmare! The remnants of a Nether invasion, perhaps? I can't help but wonder what horrors unfolded there.",
  "curious.dialogue.location.ruined_portal/2": "Hey, you should definitely check out %2$s! There's this ruined nether portal that's just begging to be explored. It's got this eerie vibe, but don't worry, it's perfectly safe... I think. Just watch out for those magma blocks, they're hotter than the sun!",
  "curious.dialogue.location.ruined_portal/3": "Guess what? I heard that if you dare to venture into %2$s, you'll stumble upon these ancient ruins. They say it used to be a magnificent nether portal, but now it's all destroyed and abandoned. Some people even whisper about hidden treasures, but honestly, who in their right mind would go anywhere near that place? Only the bravest of souls, I suppose!",
  "curious.dialogue.location.ruined_portal_mountain/1": "Do you know anything about that ruined portal in the mountains? I'm dying to investigate it and uncover its hidden treasures!",
  "curious.dialogue.location.mansion/1": "Have you ever heard of that creepy mansion over at %2$s? It's like something out of a horror movie! If you're brave enough, you should go check it out… or maybe not, unless you want to be scared out of your wits!",
  "curious.dialogue.location.mansion/2": "So, guess what I heard? There's this massive mansion at %2$s, and rumor has it that it's infested with those illagers. Seriously, we should start packing up and find a new village ASAP. I mean, who wants to risk living near that house of horrors, right?",
  "curious.dialogue.location.monument/1": "Have you ever heard of a sunken castle that's home to mythical sea monsters? It's said to be lurking at %2$s. I wouldn't go near it if I were you!",
  "curious.dialogue.location.monument/2": "Legends speak of mysterious ancient ruins hidden in the depths of the ocean at %2$s. Who knows what treasures lie within, but be warned, it's not for the faint of heart!",
  "curious.dialogue.location.shipwreck/1": "Oh, guess what I stumbled upon at %2$s? A sunken ship! It's like a treasure trove waiting to be explored, I'm telling you!",
  "curious.dialogue.location.shipwreck/2": "Hey, have you heard the news? There's this shipwreck at %2$s, and I can't help but wonder if there's some hidden treasure just waiting to be discovered. Let's go on an adventure!",
  "curious.dialogue.location.shipwreck_beached/1": "Hey, guess what? I stumbled upon a totally wrecked ship over at %2$s, right on the beach! Seriously, you won't believe your eyes when you see it.",
  "curious.dialogue.location.shipwreck_beached/2": "You absolutely have to check out %2$s! There's this incredible shipwreck just chilling on the shoreline. I can't help but wonder what the heck happened to it, though... It's like a real-life mystery waiting to be solved.",
  "curious.dialogue.location.village_desert/1": "Have you heard about the charming village just over yonder, nestled right in the heart of the vast desert?",
  "curious.dialogue.location.village_taiga/1": "Oh, have you heard about that enchanting little village nestled in the heart of the taiga biome? It's an absolute treasure worth exploring!",
  "curious.dialogue.location.village_taiga/2": "Venture forth towards %2$s, my friend, and you shall discover a hidden gem of a village, concealed amidst the enchanting embrace of the magnificent taiga biome.",
  "curious.dialogue.location.village_snowy/1": "Oh, did you know there's a whole other village over at %2$s? It's quite chilly there, but so intriguing!",
  "curious.dialogue.location.village_snowy/2": "Hey, have you ever been to the village at %2$s in the snowy plains? The people there are incredibly friendly, but boy, it's definitely a frosty place to be!",
  "curious.dialogue.location.village_plains/1": "Oh, have you heard about the delightful village over yonder at %2$s?",
  "curious.dialogue.location.village_plains/2": "Venture further into the vast plains at %2$s and prepare to be amazed by yet another charming village!",
  "curious.dialogue.location.village_savanna/1": "Oh, you won't believe it! Just a hop, skip, and a jump away from here, there's another village! And let me tell you, it's like a sauna over there! You'd better pack your sunblock and a whole lot of water!",
  "curious.dialogue.location.village_savanna/2": "Have you heard the whispers? There's a hidden gem in the savanna, a village where the people are just as fascinating as the land itself! Trust me, they've got stories to tell that will make your jaw drop!",
  "curious.dialogue.location.swamp_hut/1": "Have you heard about the infamous swamp at %2$s? It's said to be home to a wicked witch. I'd steer clear of that place if I were you.",
  "curious.dialogue.location.swamp_hut/2": "You know what's lurking at %2$s? That cursed swamp hut where that dreadful witch resides. I wouldn't go anywhere near it if I were you, my friend. It's trouble waiting to happen.",
  "curious.dialogue.location.mineshaft/1": "Did you know there used to be a bustling mine around these parts? It's been shut down, sadly, due to a mishap. You might find some remnants if you venture over to %2$s.",
  "curious.dialogue.location.mineshaft/2": "Ah, the good ol' days of our mine at %2$s. It was quite the hotspot until those creepy crawlies took over. It's a shame, really. If you're feeling adventurous, tread lightly down there. Who knows what lurks in the darkness now?",
  "curious.dialogue.location.jungle_pyramid/1": "Hey, have you ever heard about this mysterious temple at %2$s? It's like something out of a treasure hunter's dream! But be warned, it's filled with deadly traps that could turn you into ancient history.",
  "curious.dialogue.location.jungle_pyramid/2": "Psst! Guess what? I just discovered a secret hideout in the nearby jungle at %2$s. It's like a lost world waiting to be explored! But don't be fooled, my friend, because that place is booby-trapped like you wouldn't believe. You've been warned!",
  "curious.dialogue.location.pillager_outpost/1": "Hey, did you hear about those sneaky Pillagers at %2$s? They've set up a whole outpost right next to us! I wonder what kind of trouble they're planning this time. We better stay on our guard.",
  "curious.dialogue.location.pillager_outpost/2": "Can you believe those pesky Pillagers have taken over %2$s? It's like they think they own the place! I wouldn't go near that outpost if I were you, unless you want an arrow in your back.",
  "curious.dialogue.location.pillager_outpost/3": "Oh, you won't believe what's happening at %2$s! Those annoying Pillagers have claimed an outpost and they're causing a ruckus. But hey, if you're feeling brave, maybe you can swoop in and teach them a lesson. Our village would be forever grateful!",
  "curious.dialogue.location.ancient_city/0": "Oh, you won't believe the bizarre sounds echoing from %2$s, deep within the earth! My curiosity is piqued!",
  "curious.dialogue.location.ancient_city/1": "My dear friend, I have a hunch that there's a hidden treasure trove concealed in the depths of %2$s. I must uncover its secrets!",
  "curious.dialogue.location.ancient_city/3": "Have you ever heard the legends surrounding %2$s? They speak of an ancient city veiled below the surface. My inquisitiveness is ignited; it's time to dig deep and unravel this mystery!",

  "curious.dialogue.joke.monster.success/1": "Hehe! That Skelly got what it deserved!",
  "curious.dialogue.joke.monster.success/2": "Wait, you mean that zombie actually thought it could defeat you with a shovel? Hahaha, that's priceless!",
  "curious.dialogue.joke.monster.success/3": "Woah, you totally asserted your dominance over that spider! Haha, impressive!",
  "curious.dialogue.joke.monster.success/4": "Hold on, you managed to orchestrate a skeleton taking down a creeper?! That's mind-blowing, haha!!",
  "curious.dialogue.joke.monster.success/5": "Hahah! Can you believe how clueless those cave spiders are? It's almost too easy to outsmart them!",
  "curious.dialogue.joke.monster.failed/1": "Did you know that some villagers actually believe that skeletons have feelings? Can you imagine?",
  "curious.dialogue.joke.monster.failed/2": "I can't believe it! Someone actually cracked a joke about creepers exploding. How quaint!",
  "curious.dialogue.joke.monster.failed/3": "You know, zombies and skeletons were once human beings, just like you and me. It's fascinating, isn't it?",
  "curious.dialogue.joke.monster.failed/4": "Oh my, would you look at that! An enderman falling into water. How utterly predictable.",
  "curious.dialogue.joke.monster.failed/5": "It seems like every time someone tries to lighten the mood with a silverfish-on-the-toilet joke, I can't help but find it strange. It's like déjà vu, but with a strange twist.",

  "curious.dialogue.joke.animal.success/1": "Oh my, what a peculiar scenario for that poor sheep to lose its wool! Quite amusing, don't you think?",
  "curious.dialogue.joke.animal.success/2": "And what do you know, the wolf actually ended up falling head over heels for the sheep! Quite the unexpected twist, I must say.",
  "curious.dialogue.joke.animal.success/3": "Isn't it absolutely fascinating? I never would have thought chickens were capable of such comedic feats!",
  "curious.dialogue.joke.animal.success/4": "How utterly nonsensical! But you know what? I find myself utterly charmed by its absurdity. It's simply delightful!",
  "curious.dialogue.joke.animal.success/5": "Ah, the beauty of cows and their infinite milk supply! It's nothing short of a miraculous and hilarious wonder, wouldn't you agree?",
  "curious.dialogue.joke.animal.failed/1": "Oh my goodness! Can you believe what happened to that sheep? It's just tragic, not a laughing matter!",
  "curious.dialogue.joke.animal.failed/2": "Excuse me, but I must ask, why would you even dare to talk about my precious pig in such a manner? It's simply unacceptable!",
  "curious.dialogue.joke.animal.failed/3": "How could you stoop so low as to make such a joke? It's just plain wrong!",
  "curious.dialogue.joke.animal.failed/4": "Seriously, mocking a cow's eyebrows? That's beyond the bounds of decency! Show some respect!",

  "curious.dialogue.flirt.slap/1": "Pardon me?",
  "curious.dialogue.flirt.slap/2": "Did an Enderman mentor you in the art of wooing?!",
  "curious.dialogue.kiss.slap/1": "Oh my goodness, did you really just do that? How dare you!",
  "curious.dialogue.kiss.slap/2": "I must say, if you attempt that again, the consequences might just surprise you. And trust me, they won't be pleasant!",

  "curious.dialogue.chat.plains/1": "Have you ever wondered about the wonders beyond the plains? I've been dreaming of exploring distant lands!",
  "curious.dialogue.chat.plains/2": "The serene plains fill me with such curiosity. While other biomes may offer more thrills, I can't help but be drawn to this tranquil paradise.",
  "curious.dialogue.chat.plains/3": "When the moon graces the sky, the plains reveal a captivating beauty, begging to be discovered.",
  "curious.dialogue.chat.plains/4": "In moments like these, I can't resist lying down and gazing at the heavens, pondering the secrets they hold.",
  "curious.dialogue.chat.plains/5": "Ah, the crisp, invigorating air of the plains! It rivals even the most enchanting forests of the taiga!",
  "curious.dialogue.chat.plains/6": "Though the plains may lack extravagance, there's a certain charm in their simplicity that cannot be matched.",
  "curious.dialogue.chat.plains/7": "This weather takes me back to my childhood, when I would venture into the fields, gathering wildflowers for my childhood sweetheart, Ash. Those were the days!",
  "curious.dialogue.chat.plains/8": "The break of dawn paints a breathtaking picture across the plains. Don't miss the opportunity to witness its awe-inspiring spectacle.",
  "curious.dialogue.chat.savanna/1": "It's scorching in this savanna! But I can't help but wonder what it would be like to experience winter's chilly embrace.",
  "curious.dialogue.chat.savanna/2": "Those llamas can be quite the curious creatures! Despite their shenanigans, I find myself strangely fascinated by them.",
  "curious.dialogue.chat.savanna/3": "Oh, the architecture here in the savanna is a sight to behold! It's so uniquely captivating that it's the sole reason I call this place my home.",
  "curious.dialogue.chat.savanna/4": "Never judge a savanna biome by its cover! Beneath its seemingly plain exterior lies a treasure trove of hidden wonders just waiting to be discovered.",
  "curious.dialogue.chat.savanna/5": "While the desert villagers may envy our lack of rainfall, we have something they don't - majestic rivers flowing through our lands, bringing life and vitality.",
  "curious.dialogue.chat.savanna/6": "The hills and terrains here are like a canvas painted by nature's own hand. Each one tells a story, and I can't help but be enraptured by their captivating beauty.",
  "curious.dialogue.chat.savanna/7": "When the scorching sun beats down on us, the shade of the acacia trees becomes our sanctuary. It's where we find solace and respite during those sweltering workdays!",
  "curious.dialogue.chat.savanna/8": "Our savanna villages boast the most delectable melons and pumpkins you could ever imagine! They're so delicious that neighboring villages are always eager to trade with us. It's a true testament to our agricultural prowess!",
  "curious.dialogue.chat.taiga/1": "The woods are absolutely fascinating! They offer an endless supply of resources, from sturdy timber for construction to cozy firewood for those chilly nights. And let's not forget the abundance of wildlife for hunting, making it a true paradise for survival enthusiasts like myself!",
  "curious.dialogue.chat.taiga/2": "Oh, the taiga biome! It's like stepping into a frozen wonderland filled with endless wonders. Sure, it may get a bit nippy, but who needs warmth when you have everything you could possibly need right here? I wouldn't trade this snowy paradise for anything in the world!",
  "curious.dialogue.chat.taiga/3": "Taiga forests are simply mesmerizing! The towering trees, the serene silence, and oh, those delectable sweet berries! Can you believe Mother Nature blessed us with such a delightful treat? It's like having a buffet of sweetness right at our fingertips!",
  "curious.dialogue.chat.taiga/4": "Have you ever encountered a fox in the taiga forests? Oh, they are the epitome of mischief and charm. I've even become friends with a few of them! In fact, I often pamper them with handfuls of those juicy sweet berries. It's like our own little secret pact of mischievous delights!",
  "curious.dialogue.chat.taiga/5": "You won't believe how docile the wolves are around here. With such an abundance of food in the taiga, they've practically become our friendly neighbors! It's like having a pack of loyal guardians watching over us. Truly remarkable, isn't it?",
  "curious.dialogue.chat.taiga/6": "Ah, the taiga air! It's as refreshing as a crisp morning breeze on a mountaintop. Breathing in the cool, invigorating atmosphere is like an instant spa treatment for the soul. It's no wonder this place has such a calming effect on everyone who ventures into its embrace.",
  "curious.dialogue.chat.taiga/7": "Let's talk about those sweet berry bushes. Yes, they are a delight for the taste buds, but dear me, the thorns! Getting pricked by one is like a tiny reminder that even paradise has its prickly sides. But hey, a few thorns are a small price to pay for such exquisite sweetness, don't you agree?",
  "curious.dialogue.chat.taiga/8": "Rain in the taiga may send a shiver down your spine, but oh, the serenity it brings is simply unmatched. The gentle pitter-patter of icy droplets against the forest canopy creates a symphony of tranquility. It's like nature's lullaby, soothing our souls and washing away all worries. Truly, a peaceful oasis in the midst of a chilly downpour!",
  "curious.dialogue.chat.snowy_plains/1": "Brrr! It's chilly here, but I'm always curious about how the frost forms on the branches. Fascinating!",
  "curious.dialogue.chat.snowy_plains/2": "Oh my frostbite! The cold is unbearable, but I can't help but wonder how the fish survive in this icy water. Nature's miracle!",
  "curious.dialogue.chat.snowy_plains/3": "With this freezing weather, I can't resist exploring every nook and cranny of the village to discover cozy spots near the furnace. It's like a little adventure!",
  "curious.dialogue.chat.snowy_plains/4": "Every time it snows, it piques my curiosity about the joyful snowball fights I had as a child. I wonder if I can still throw a snowball with precision!",
  "curious.dialogue.chat.snowy_plains/5": "Those pesky strays are such a bother when they interrupt the tranquility of our village. I'm always curious if we can find a way to make peace with them.",
  "curious.dialogue.chat.snowy_plains/6": "Hey, watch out for the wolves! I'm always curious about how they manage to survive in this snowy wilderness. A lesson in adaptability, perhaps?",
  "curious.dialogue.chat.snowy_plains/7": "I've always wondered why touching an iron golem feels like being glued to a block of ice. It's like a puzzle waiting to be solved!",
  "curious.dialogue.chat.snowy_plains/8": "Ah, the nostalgia! As a child, I used to build snow golems with pumpkins too. I'm curious if there are any new tricks to make them even more marvelous!",
  "curious.dialogue.chat.desert/1": "Isn't it fascinating how the desert is always warm? No need to worry about freezing temperatures!",
  "curious.dialogue.chat.desert/2": "The desert maintains its warm embrace throughout the year. Quite remarkable, isn't it?",
  "curious.dialogue.chat.desert/3": "Despite the scorching heat, I find myself perpetually sun-kissed or, more often than not, sunburned...",
  "curious.dialogue.chat.desert/4": "The night brings a breathtaking spectacle of coolness and starry wonders. Quite the sight to behold!",
  "curious.dialogue.chat.desert/5": "Oh my, today's sun is exceptionally brutal! I never thought I'd say this, but it's truly overwhelming.",
  "curious.dialogue.chat.desert/6": "Goodness gracious! The sun is relentless today, isn't it?",
  "curious.dialogue.chat.desert/7": "Have you had the pleasure of spotting any elusive rabbits amidst this vast desert? They seem to be playing hide and seek!",
  "curious.dialogue.chat.desert/8": "Ah, one cannot deny the unfortunate reality of living here. Those husks can be quite the bother, leaving us famished whenever they strike! It's simply outrageous!",
  "curious.dialogue.chat.desert/9": "My dear friend, I had an unfortunate encounter with a cactus the other day. One must tread ever so carefully in these parts!",
  "curious.dialogue.chat.desert/10": "Life in this arid desert is undeniably challenging. However, we are fortunate to have this village, a sanctuary that provides us with water and sustenance.",

  "curious.dialogue.story.exploring.success/1": "Oh, how fascinating! I dream of venturing beyond the boundaries of our humble village someday!",
  "curious.dialogue.story.exploring.success/2": "My oh my, the thought of embarking on extraordinary adventures and discovering new wonders fills me with such envy! Your tales truly captivate me.",
  "curious.dialogue.story.exploring.success/3": "I must confess, the courage it takes to venture into the mysterious unknown is simply awe-inspiring! I commend your bravery, dear traveler.",
  "curious.dialogue.story.exploring.fail/1": "Your tales have lost their allure.",
  "curious.dialogue.story.exploring.fail/2": "Oh my, do be careful not to trip over that sharp wit, my intrepid friend.",
  "curious.dialogue.story.exploring.fai/l3": "Chatting with you is like chatting with an unquenchably curious soul, always seeking new knowledge and experiences. It's like having an endless well of questions without the cuteness overload, of course.",

  "curious.dialogue.story.nether.success/1": "Is it true that the Nether is scorching hot? I just can't fathom how anything can survive in such extreme temperatures!",
  "curious.dialogue.story.nether.success/2": "Oh my, you're a true survivor! How did you manage to endure the relentless dangers of the Nether? I'm utterly fascinated by your resilience!",
  "curious.dialogue.story.nether.success/3": "I've heard rumors about the Nether's hidden treasures. It's a shame I lack the audacity to venture into such a perilous realm. But tell me, are the tales of riches true?",
  "curious.dialogue.story.nether.success/4": "The fearlessness you possess to traverse the Nether is truly awe-inspiring. Do you ever feel a tinge of anxiety creeping in? Not that I would ever consider venturing there myself, of course...",
  "curious.dialogue.story.nether.success/5": "Speaking of the Nether, have you ever come face to face with a fearsome Zombified Piglin? The mere thought sends shivers down my spine!",
  "curious.dialogue.story.nether.fail/1": "Have you ever ventured into the mysterious realm of the Nether? It's a place brimming with danger and intrigue!",
  "curious.dialogue.story.nether.fail/2": "Ah, so that's why those fiery Piglins swarmed towards you! Seems like you encountered the wrath of the Nether, my friend.",
  "curious.dialogue.story.nether.fail/3": "Who cares if you've stepped foot in the Nether or not? I'm just dying to know if you can spin a captivating tale about your adventures there.",
  "curious.dialogue.story.nether.fail/4": "Hmm, forgive me for being skeptical, but you don't quite possess the brawn and bravery one would expect from a Nether explorer.",
  "curious.dialogue.story.nether.fail/5": "You claim to know about every nook and cranny of the Nether, but my wise grandpa never mentioned a word about warped fungus. Are you sure you're not just spinning a web of deceit?",

  "curious.dialogue.story.enderdragon.success/1": "Good gracious! I can hardly contain my excitement! Pray tell, have you managed to secure the precious dragon egg on your journey?",
  "curious.dialogue.story.enderdragon.success/2": "Well, well, well! My oh my! You've gone and vanquished the fearsome enderdragon, have you? Oh, the tales that shall be spun of your heroic conquest! The village shall trumpet your name for eternity!",
  "curious.dialogue.story.enderdragon.fail/1": "Whoa, hold up! Are you serious? The ender dragon? That's like the stuff of legends!",
  "curious.dialogue.story.enderdragon.fail/2": "Hahaha, you've got to be pulling my leg! No way a mere mortal could even make a dent in that fearsome dragon!",

  "curious.dialogue.story.wither.success/1": "No way! I've heard the Wither is like a walking disaster!",
  "curious.dialogue.story.wither.success/2": "Wait, hold up! You actually took down the Wither?! That's mind-blowing!",
  "curious.dialogue.story.wither.fail/1": "Are you pulling my blocks? I find it hard to believe.",
  "curious.dialogue.story.wither.fail/2": "Huh, you seem way too intact to be telling the truth. I need more evidence, buddy.",

  "curious.dialogue.stay.fail/1": "This village is charming, but my adventurous spirit yearns to roam the unknown!",
  "curious.dialogue.stay.fail/2": "I'm flattered by the offer, but my inquisitive nature beckons me to embark on thrilling adventures!",
  "curious.dialogue.stay.fail/3": "While I appreciate your kindness, I simply can't resist the allure of venturing into uncharted territories!",
  "curious.dialogue.stay.repeat/1": "Oh, splendid! I've already been asked that very question before.",
  "curious.dialogue.stay.repeat/2": "My, oh my! You seem to have a remarkable memory, for you've posed that very query to me already!",
  "curious.dialogue.stay.success/1": "Oh, thank you so much! I'm absolutely thrilled to have the opportunity to stay in this magnificent village!",
  "curious.dialogue.stay.success/2": "Oh my goodness, this is incredible! I am positively over the moon about being able to stay in this marvelous village!",
  "curious.dialogue.stay.no_space/1": "Oh, my curious mind is intrigued by the bustling activity in this village.",
  "curious.dialogue.stay.no_space/2": "Alas, as I wander through the streets, I discover that each cozy bed has been claimed by another fortunate soul.",

  "curious.dialogue.hire/1": "Oh, how intriguing! I'll gladly lend you my expertise for the promised payment. Just give me a heads up, and I'll be at your disposal, eagerly awaiting the emeralds.",
  "curious.dialogue.hire/2": "Fascinating! Count me in for this grand endeavor. Whenever the need arises, I'll be at your beck and call, excitedly awaiting the emeralds that will surely accompany my services.",
  "curious.dialogue.hire/3": "How marvelous! I'm positively intrigued by this opportunity. Inform me when my assistance is required, and I'll be here, eagerly awaiting the fulfillment of our agreement in the form of shiny emeralds.",
  "curious.dialogue.no_money/1": "Do you think I'm some kind of charity? I won't work for peanuts. Show me the emeralds!",
  "curious.dialogue.no_money/2": "Oh, you must be joking! I need a whole lot more emeralds to even consider helping you out.",
  "curious.dialogue.no_money/3": "Sorry, but my talents don't come cheap. You'll have to dig deeper into your pockets if you want my assistance.",

  "curious.dialogue.main.rock_paper_scissor/1": "Ah, the timeless game of Rock Paper Scissors! Are you in the mood to challenge fate and see who reigns supreme?",
  "curious.dialogue.rock_paper_scissor/1": "Oh my, have you ever played the ancient game of rock, paper, scissors? Let's give it a try, shall we?",
  "curious.dialogue.rock_paper_scissor/2": "Prepare yourself, my dear opponent, for I am about to claim victory in this thrilling game of wits and strategy!",
  "curious.dialogue.rock_paper_scissor.rock/1": "Oh, rock! The epitome of solidness! It makes me wonder about the wonders it can do, both in combat and in shaping the very world we live in. Absolutely fascinating!",
  "curious.dialogue.rock_paper_scissor.paper/1": "Oh my, a sheet of paper! I wonder what wonders it conceals!",
  "curious.dialogue.rock_paper_scissor.scissor/1": "Oh, look at this fascinating scissor! It's like a miniature pair of shears, ready to conquer the world of paper and rock!",
  "curious.dialogue.rock_paper_scissor.loose.rock/1": "Oh, fascinating! I've gone with paper this time, and look who triumphs! It's me, the ultimate victor!",
  "curious.dialogue.rock_paper_scissor.loose.paper/1": "I'm feeling adventurous, so scissors it is! Let's uncover the outcome!",
  "curious.dialogue.rock_paper_scissor.loose.scissor/1": "Wow, did you see that? Rock completely overpowers those feeble scissors! Victory is mine!",
  "curious.dialogue.rock_paper_scissor.win.rock/1": "Oh my goodness, did you see that? Rock just pulverized scissor, leaving me utterly spellbound. The world of rock-paper-scissors never ceases to amaze!",
  "curious.dialogue.rock_paper_scissor.win.paper/1": "It never ceases to amaze me how rock continuously falls into the trap of my swift paper. Quite the pattern, wouldn't you agree?",
  "curious.dialogue.rock_paper_scissor.win.scissor/1": "My oh my, scissors! A cunning choice indeed! You've caught me off guard with your sharp strategy, my curious companion!",
  "_": ""
}