{
  "text.loadingscreentips.tip": "Dica:",
  "text.loadingscreentips.tip.nether_bed": "Coloque uma cama no Nether, será uma explosão!",
  "text.loadingscreentips.tip.milk": "Beba leite para se livrar dos efeitos de poções!",
  "text.loadingscreentips.iron_golem": "Golens de Ferro são os protetores das vilas, eles irão te atacar se você atacar um aldeão.",
  "text.loadingscreentips.dirt_sugarcane": "Cana-de-açúcar pode crescer na terra!",
  "text.loadingscreentips.dig_straight_down": "Cavar diretamente para baixo tem 75% de chance de encontrar uma surpresa.",
  "text.loadingscreentips.scared_creepers": "Creepers têm medo de gatos!",
  "text.loadingscreentips.endermen_eyes": "Não olhe nos olhos de um enderman, ou eles podem ficar chateados.",
  "text.loadingscreentips.herobrine": "§4Tenha medo do Steve cujos olhos §fbrilham branco.",
  "text.loadingscreentips.illager_bell": "Você pode tocar um sino durante um ataque para fazer os illagers próximos brilharem.",
  "text.loadingscreentips.shear_snowgolem": "Você pode tosar um golem de neve para remover a cabeça de abóbora.",
  "text.loadingscreentips.mob_heads": "Usar uma cabeça de mob vai dificultar que eles te detectem, experimente com um creeper!",
  "text.loadingscreentips.basalt_gen": "Basalto pode ser feito a partir de lava fluindo em um espaço em cima de terra das almas e adjacente ao gelo azul.",
  "text.loadingscreentips.brown_mooshroom": "Raios podem transformar cogumelos vermelhos em marrons.",
  "text.loadingscreentips.axolotl_rename": "Você pode renomear um axolote em um balde, e ele manterá o nome quando você o colocar!",
  "text.loadingscreentips.curse_of_binding": "Armadura amaldiçoada ligada a você? Morra para removê-la!",
  "text.loadingscreentips.charged_creeper": "Quando um raio atinge um creeper, algo eletrizante acontece!",
  "text.loadingscreentips.piglin_gold": "Não se esqueça de usar ouro perto dos piglins, senão eles ficarão enfurecidos.",
  "text.loadingscreentips.warped_mushrooms": "Hoglins temem o fungo distorcido.",
  "text.loadingscreentips.glowstone_portal": "Construa um portal de pedras luminosas para te levar a um mundo acima das nuvens.",
  "text.loadingscreentips.evoker": "Invocadores podem transformar ovelhas azuis em vermelhas.",
  "text.loadingscreentips.dinnerbone": "Nomeie um mob de dinnerbone e veja o que acontece!",
  "text.loadingscreentips.jeb": "Nomeie uma ovelha de 'jeb_' e veja o que acontece!",
  "text.loadingscreentips.flooded_caves": "Cavernas inundadas são uma ótima fonte de minérios!",
  "text.loadingscreentips.goat_horn": "Chifres de cabra fazem o mesmo som que os chifres de ataque dos illagers.",
  "text.loadingscreentips.bad_omen": "Tenha cuidado se adquirir um mau presságio, você pode ter maus momentos numa vila se o tiver.",
  "text.loadingscreentips.pig_creepers": "Alguns dizem que porcos e creepers têm um ancestral comum.",
  "text.loadingscreentips.nitwit": "Aldeões com uma roupa verde podem ter dificuldade em encontrar um emprego.",
  "text.loadingscreentips.witherskull": "Se você tiver sorte ao matar esqueletos wither, talvez consiga um crânio.",
  "text.loadingscreentips.villager_witch": "Quando um raio atinge um aldeão, ele se transformará em uma bruxa.",
  "text.loadingscreentips.crossbow_fireworks": "Fogos de artifício podem ser carregados em uma besta.",
  "text.loadingscreentips.prevent_endermen_move": "Se um enderman está com raiva de você, olhe nos olhos dele para evitar que ele se mova.",
  "text.loadingscreentips.stronghold_rings": "Fortalezas geram em anéis ao redor do centro do mundo.",
  "text.loadingscreentips.pink_sheep": "Ovelhas rosas podem aparecer muito raramente.",
  "text.loadingscreentips.mending": "O encantamento de reparo pode consertar suas ferramentas ao custo de experiência.",
  "text.loadingscreentips.fishing": "A pesca pode ser uma boa fonte tanto de comida quanto de saques!",
  "text.loadingscreentips.axolotls": "Axolotes podem te proteger dos perigos do mar.",
  "text.loadingscreentips.diamond_ore": "Diamantes são mais facilmente encontrados nas camadas de ardósia do mundo.",
  "text.loadingscreentips.grimstone": "Ardósia era originalmente chamada de Pedra-sinistra!",
  "text.loadingscreentips.dragon_breath": "Você pode coletar o bafo do dragão do fim só com uma garrafa!",
  "text.loadingscreentips.snow_cauldron": "A neve fofa pode se acumular em um caldeirão enquanto está nevando.",
  "text.loadingscreentips.powdered_snow": "Cuidado com a neve fofa, você pode afundar e começar a congelar.",
  "text.loadingscreentips.trans_bee": "A abelha do Minecraft é trans.",
  "text.loadingscreentips.phantom": "Não se esqueça de dormir, ou os phantoms podem acordar.",
  "text.loadingscreentips.stray": "Se um esqueleto congela até a morte, ele se tornará um errante.",
  "text.loadingscreentips.drowned": "Se um zumbi se afogar, ele se tornará um afogado.",
  "text.loadingscreentips.trident": "O tridente é uma arma que se destaca na água.",
  "text.loadingscreentips.polar_bear": "Os ursos polares vão proteger seus filhotes.",
  "text.loadingscreentips.panda": "Os pandas têm 6 tipos de personalidade diferentes: Normal, Preguiçoso, Preocupado, Brincalhão, Agressivo, Fraco e Marrom",
  "text.loadingscreentips.glow_ink": "Use tinta brilhante numa placa para fazer o texto brilhar.",
  "text.loadingscreentips.slime_moon": "A fase da lua impacta o surgimento de slimes em pântanos, eles surgem mais durante a lua cheia.",
  "text.loadingscreentips.azalea_tree": "Cave embaixo de uma árvore de azaleia e você encontrará uma caverna exuberante.",
  "text.loadingscreentips.zombie_villager": "Zumbis podem transformar aldeões em zumbis.",
  "text.loadingscreentips.campfire_bee": "Coloque uma fogueira embaixo de uma colmeia de abelhas para acalmar as abelhas e coletar mel com segurança.",
  "text.loadingscreentips.goat_mountain": "Tenha cuidado com as cabras, pois elas podem te atacar.",
  "text.loadingscreentips.breed_hoglins": "Você pode procriar hoglins com cogumelos carmesim.",
  "text.loadingscreentips.zombified_pigs": "Tanto os hoglins quanto os piglins se transformarão em zumbis quando saírem do Nether.",
  "text.loadingscreentips.mushroom_island": "Se viajar o suficiente, você pode encontrar uma ilha com cogumelos gigantes.",
  "text.loadingscreentips.strider": "Use lavagantes para atravessar os vastos oceanos de lava no nether. Eles podem ser liderados com um cogumelo distorcido em um graveto.",
  "text.loadingscreentips.ocean_monument": "Guardiões-mestre lhe darão fadiga de mineração quando você se aproximar demais de um monumento oceânico.",
  "text.loadingscreentips.elder_guardian": "Guardiões-mestre soltarão esponjas ao morrer.",
  "text.loadingscreentips.bastion_chest": "Quando em uma fortaleza de piglins, os piglins defenderão seu saque.",
  "text.loadingscreentips.piglin_brute": "Piglins Bárbaros não se importam com ouro e vão atacar independentemente.",
  "text.loadingscreentips.end_city": "Cidades do Fim são encontradas por toda a ilha exterior do Fim e contêm alguns itens raros.",
  "text.loadingscreentips.tipped_arrow": "Coloque flechas em volta de uma poção prolongada e você terá flechas com ponta.",
  "text.loadingscreentips.horses": "Cavalos são uma maneira rápida de viajar pelo mundo, e você pode procriá-los para obter estatísticas melhores.",
  "text.loadingscreentips.deepslate": "Uma vez que você esteja abaixo de y=0, toda a pedra é substituída por ardósia, que é mais forte.",
  "text.loadingscreentips.large_ore_vein": "Veios grandes de minério de cobre e ferro podem ser encontrados no subsolo.",
  "text.loadingscreentips.bedrock_nether": "Tanto o topo quanto o fundo do Nether têm bedrock, um bloco inquebrável.",
  "text.loadingscreentips.deep_dark": "Dizem as lendas que existem cidades antigas profundamente subterrâneas, com tesouros raros encontrados em nenhum outro lugar.",
  "text.loadingscreentips.swift_sneak": "Passos Furtivos é um encantamento que aumenta sua velocidade de movimento enquanto está agachado.",
  "text.loadingscreentips.frog_magmacubes": "Não traga seus cubos de magma perto de um sapo, ou ele pode acabar sendo comido.",
  "text.loadingscreentips.sculk": "Sculk contém almas e soltará experiência quando você o quebrar.",
  "text.loadingscreentips.allay": "Dê um item a um allay e eles irão coletar mais para você!",
  "text.loadingscreentips.frog_types": "Sapos têm três tipos, Frio, Quente e Temperado, que podem ser criados em seus respectivos climas.",
  "text.loadingscreentips.sculk_catalyst": "O Catalisador de Sculk irá roubar a alma de mobs mortos por perto e usá-la para espalhar Sculk",
  "text.loadingscreentips.wool_occlusion": "Use lã para evitar que os sons ecoem na escuridão profunda",
  "text.loadingscreentips.frog_breeding": "Você pode procriar sapos com bolas de slime.",
  "text.loadingscreentips.warden": "Dizem que uma poderosa besta com poder ecoante existe nas partes mais profundas do mundo.",
  "text.loadingscreentips.dripstone_clay": "Espeleotema sob barro pode secar até se tornar argila.",
  "text.loadingscreentips.dupe_allay": "Se você der um fragmento de ametista a um allay enquanto ele está dançando música, ele pode duplicar",
  "text.loadingscreentips.villager": "Negociar com aldeões é uma ótima maneira de obter esmeraldas.",
  "text.loadingscreentips.sculk_shriekers": "Fique quieto perto dos emissores de sculk, ou você vai se arrepender.",
  "text.loadingscreentips.build_snowgolem": "Se você colocar dois blocos de neve com uma abóbora de halloween em cima, você pode construir um boneco de neve!",
  "text.loadingscreentips.leather_boots": "Botas de couro impedem que você caia na neve fofa!",
  "text.loadingscreentips.shulker_bullet": "Se um shulker for atingido por um projétil de shulker, há uma chance de duplicação!",
  "text.loadingscreentips.enchantability": "Alguns materiais recebem encantamentos melhor, como ouro.",
  "text.loadingscreentips.saturation": "Tente comer alimentos maiores, como carnes assadas, eles te mantêm saciado por mais tempo.",
  "text.loadingscreentips.armor_trim": "Você pode encontrar modelos de enfeites de sentinela em várias estruturas e usá-los para adicionar acabamentos à sua armadura.",
  "text.loadingscreentips.suspicious_sand": "Areia suspeita é um bloco encontrado em Templos do Deserto, Poços do Deserto e Ruínas Oceânicas Quentes, tente clicar nele com um pincel!",
  "text.loadingscreentips.suspicious_gravel": "Cascalho suspeito é um bloco encontrado em Ruínas Oceânicas Frias e Trilhas em Ruínas, tente clicar nele com uma escova!",
  "text.loadingscreentips.trail_ruins": "Trilhas em ruínas são estruturas contendo vários modelos de enfeites e um disco de música único.",
  "text.loadingscreentips.sherds": "Fragmentos de cerâmica são pedaços de cerâmica encontrados nas várias estruturas arqueológicas, em areia e cascalho suspeitos. Combine 4 para criar um vaso decorado.",
  "text.loadingscreentips.sniffer_moss": "Ovos de Farejador crescem duas vezes mais rápido em blocos de musgo.",
  "text.loadingscreentips.sniffer_egg": "Você pode encontrar ovos de farejadores em ruínas oceânicas quentes em areia suspeita.",
  "text.loadingscreentips.sniffing": "Farejadores ocasionalmente farejam o chão e retiram sementes antigas que crescem plantas do passado.",
  "text.loadingscreentips.sniffer_breeding": "Farejadores podem ser procriados com sementes de plantocha.",
  "text.loadingscreentips.camel_breeding": "Camelos podem ser procriados com cactos.",
  "text.loadingscreentips.camel": "Camelos são uma ótima maneira de atravessar o deserto e podem ser montados por dois jogadores.",
  "text.loadingscreentips.musical_heads": "Quando você coloca uma cabeça acima de um bloco musical, ele reproduzirá sons do mob.",
  "text.loadingscreentips.charged_creeper_heads": "Quando um creeper carregado mata certas criaturas, elas irão dropar suas cabeças.",
  "text.loadingscreentips.copy_template": "Você pode copiar os itens de modelo fabricando-os com 7 diamantes e seu material base.",
  "modmenu.summaryTranslation.loadingscreentips": "Adiciona dicas de carregamento à tela de carregamento do mundo.",
  "modmenu.descriptionTranslation.loadingscreentips": "Adiciona dicas de carregamento à tela de carregamento do mundo.",
  "loadingscreentips.midnightconfig.title": "Configuração de Dicas da Tela de Carregamento",
  "loadingscreentips.midnightconfig.corner": "Canto das dicas",
  "loadingscreentips.midnightconfig.changeTime": "Mudar Horário",
  "loadingscreentips.midnightconfig.enum.CORNER.BOTTOM_LEFT": "Bottom Left",
  "loadingscreentips.midnightconfig.enum.CORNER.TOP_LEFT": "Top Left",
  "loadingscreentips.midnightconfig.enum.CORNER.BOTTOM_RIGHT": "Bottom Right",
  "loadingscreentips.midnightconfig.enum.CORNER.TOP_RIGHT": "Top Right",
  "loadingscreentips.midnightconfig.serverLoadingTips": "Mostrar Dicas na Tela de Carregamento do Servidor"
}
