{
  "fragile.dialogue.main/1": "Oh, um, hello... I hope you're not here to cause any trouble...",
  "fragile.dialogue.main/2": "Um, hey... Are you... okay? I mean, emotionally...?",
  "fragile.dialogue.main/3": "Oh, hi there... I hope you're having a... less eventful day...",
  "fragile.dialogue.main/4": "Um, excuse me... Do you mind sharing what's going on with you today? Just... for my own fragile sanity...",
  "fragile.dialogue.main/5": "How... how are you today? I hope nothing too exciting is happening...",
  "fragile.dialogue.main/6": "Oh, hey... It's you... What's... what's up? I mean, if you don't mind sharing... I understand if you do...",
  "fragile.dialogue.main/7": "So, um... I was hanging out with %supporter%, and he... he got bit by a zombie... It was... it was quite traumatic for me... And now I... I keep seeing zombies that look just like him... It's... it's terrifying...",

  "fragile.dialogue.rumors.failed/1": "Oh dear, I'm afraid I haven't heard anything new.",
  "fragile.dialogue.rumors.lore/1": "Oh, it's so delicate, you know, how the worship of Sirben is just skyrocketing! And his prophets, MerlinWolfGames and Crow, oh my, they are simply outdoing themselves in spreading his divine words.",
  "fragile.dialogue.rumors.lore/2": "I must confess, my dear, the Overworld once faced quite a frightful invasion from those dreadful Cyberdemons. But fear not, for it was Sirben and the brave Luke who valiantly put an end to their wicked plans.",
  "fragile.dialogue.rumors.lore/3": "Oh, my fragile heart, the tale of the disappearance of the Ancient Builder still haunts me! Whispers in the wind suggest that 2DA50 embarked on a perilous journey to the Far Lands, never to return again.",
  "fragile.dialogue.rumors.lore/4": "Have you seen the temple that MerlinWolfGames has built for our beloved Sirben? It's an absolute marvel, my dear. One of the most extraordinary ancient wonders ever witnessed.",
  "fragile.dialogue.rumors.lore/5": "How tragic it is, my fragile friend, that the ancient race of builders has vanished into thin air. Once so vibrant and full of life, now lost in the annals of history.",
  "fragile.dialogue.rumors.lore/6": "Oh, oh, have you heard the whispers, my delicate soul? Legends of the ancient builders who left behind enchanting ruins and magnificent temples scattered all over the Overworld. Simply captivating, isn't it?",

  "fragile.dialogue.first.generic/1": "Oh my, I don't believe we've crossed paths before! Welcome to our humble village, dear traveler!",
  "fragile.dialogue.first.generic/2": "Well, well, well! Look who we have here, a new visitor! How delightful! Welcome to our little community!",
  "fragile.dialogue.first.generic/3": "Oh my goodness, someone new has graced us with their presence! Welcome, welcome! We've been eagerly awaiting some fresh energy in this village!",
  "fragile.dialogue.first.generic/4": "Oh, goodness gracious! A newcomer! How lovely! Welcome to our village, dear stranger. I can't wait to hear all about your adventures!",
  "fragile.dialogue.first.generic/5": "Oh my fragile heart! It's been an eternity since we've had the pleasure of hosting a traveler. Welcome, dear one! We hope you find solace and joy in our humble abode.",
  "fragile.dialogue.first.generic/6": "Oh, sweet mercy! Would you look at that! A new face in our village! Welcome, welcome! It's always a delight to encounter someone new.",

  "fragile.dialogue.first.question/1": "Greetings, weary traveler. Pray tell, what has led you to grace our humble village?",
  "fragile.dialogue.first.question/2": "Oh, bless your arrival! Pray, what tales of bravery have guided you to our doors?",
  "fragile.dialogue.first.question/3": "Oh my, a wanderer like yourself! Pray, unveil the secrets of your journey to our quaint abode.",
  "fragile.dialogue.first.exploring/1": "This place isn't much, but you're welcome to visit, just please, oh please, don't break any rules.",
  "fragile.dialogue.first.exploring/2": "If you can follow the rules, then you can stay here, my fragile friend.",
  "fragile.dialogue.first.exploring/3": "Oh dear traveler, please remember to mind your manners when you explore our humble abode.",
  "fragile.dialogue.first.settling/1": "Oh, how utterly delightful to lay my eyes upon another soul gracing our humble village!",
  "fragile.dialogue.first.settling/2": "Ah, greetings, dear neighbor! Pray tell, what brings you to our humble abode?",
  "fragile.dialogue.first.settling/3": "The mere thought of an additional kind-hearted helper gracing our village fills my fragile heart with boundless joy!",
  "fragile.dialogue.first.settling/4": "You have chosen to make this village your permanent dwelling? Oh, how my fragile heart leaps with jubilation at this splendid news!",
  "fragile.dialogue.first.spent_night.success/1": "Oh, I must insist that you try our quaint little inn. It may not be the grandest, but it's so cozy!",
  "fragile.dialogue.first.spent_night.success/2": "You simply must make your way to our precious little inn. It's the loveliest spot to rejuvenate your weary soul.",
  "fragile.dialogue.first.spent_night.success/3": "If you are in dire need of comfort and nourishment, I implore you to visit our humble inn. It's a sanctuary of warmth and deliciousness.",
  "fragile.dialogue.first.spent_night.failed/1": "Oh dear, it pains me to admit, but we are sadly lacking in the art of inn construction. It's just not our strong suit, you see.",
  "fragile.dialogue.first.spent_night.failed/2": "Alas, we are bereft of an inn in this village. My sincerest apologies for the inconvenience.",
  "fragile.dialogue.first.spent_night.failed/3": "Perchance, it might be more fortuitous for you to seek solace in a neighboring village? They may be better equipped to cater to your lodging needs.",

  "fragile.dialogue.hug.success/1": "Oh, it's been ages since we last met!",
  "fragile.dialogue.hug.success/2": "Oh wow, your hug saved my day, thank you so much.",
  "fragile.dialogue.hug.success/3": "Just when I thought today couldn't get any better, your hug made it worthwhile.",
  "fragile.dialogue.hug.success/4": "You're like a delicate feather, so gentle and comforting!",
  "fragile.dialogue.hug.success/5": "Oh my, your hug has melted my worries away! Thank you kindly.",
  "fragile.dialogue.hug.success/6": "Your warmth is like a cozy blanket on a chilly day, it feels so comforting.",
  "fragile.dialogue.hug.fail/1": "Oh my, you're absolutely covered in dirt and grime!",
  "fragile.dialogue.hug.fail/2": "I'm terribly sorry, but I'll have to decline your offer.",
  "fragile.dialogue.hug.fail/3": "Oh, I'm terribly frightened of physical contact, you see...",
  "fragile.dialogue.hug.fail/4": "Remember when you compared me to a prehistoric creature? I'll have to pass.",
  "fragile.dialogue.hug.fail/5": "Honestly, I don't think you've earned the privilege of a hug after that.",
  "fragile.dialogue.hug.fail/6": "Oh dear, please keep your germs to yourself! I'm terribly fragile, you know.",
  "fragile.dialogue.hug.fail/7": "Oh, umm, thank you, I suppose... But I'm feeling a bit vulnerable at the moment.",

  "fragile.dialogue.kiss.success/1": "I never want this beautiful moment to end.",
  "fragile.dialogue.kiss.success/2": "Oh my, I believe my heart is falling for you...",
  "fragile.dialogue.kiss.success/3": "This delightful sensation reminds me of the sweetest pumpkin pie!",
  "fragile.dialogue.kiss.success/4": "Oh, how your lips resemble the taste of golden honey.",
  "fragile.dialogue.kiss.success/5": "Wow! Your kisses are so tender and delicate, %1$s.",
  "fragile.dialogue.kiss.success/6": "%1$s, your kisses surpass even the enchanting Ash! *giggles*",
  "fragile.dialogue.kiss.fail/1": "Oh no, we can't let anyone witness this!",
  "fragile.dialogue.kiss.fail/2": "Is that supposed to be a kiss? It's so delicate!",
  "fragile.dialogue.kiss.fail/3": "Ash's kisses are just so much more exquisite than yours.",
  "fragile.dialogue.kiss.fail/4": "I can't help but notice... maybe it's time for some breath mints?",
  "fragile.dialogue.kiss.fail/5": "Um, thanks, I guess?",
  "fragile.dialogue.kiss.fail/6": "Oh dear, please, get off me at once!",

  "fragile.dialogue.chat.success/1": "Oh, how I crave cookies and milk right now! It's like a delicate dance of flavors.",
  "fragile.dialogue.chat.success/2": "Isn't the weather just splendid today? It's as if the sky itself is holding its breath.",
  "fragile.dialogue.chat.success/3": "Ouch! I accidentally stubbed my toe when I woke up this morning. I'm so fragile, it's unreal.",
  "fragile.dialogue.chat.success/4": "I firmly believe that an apple a day will keep the vile zombies far away! It's my fragile defense mechanism.",
  "fragile.dialogue.chat.success/5": "Oh, my dear dream is to build my own village, but my fragile nature tends to get in the way. Laziness takes hold of me too easily.",
  "fragile.dialogue.chat.success/6": "By chance, I caught a glimpse of %Supporter% the other day, adorned in the most exquisite diamond armor. My fragile heart skipped a beat.",
  "fragile.dialogue.chat.success/7": "My fragile friend %Supporter% regaled me with tales of discovering a chest brimming with diamonds. I can only imagine the sheer beauty.",
  "fragile.dialogue.chat.success/8": "Isn't the weather absolutely remarkable? My fragile soul has been basking in the gentle warmth of the sun's embrace.",
  "fragile.dialogue.chat.success/9": "I've resided in this place my whole life and, dare I say, my fragile constitution cannot comprehend the fuss over those spindly spiders and mischievous goblins.",
  "fragile.dialogue.chat.success/10": "My fragile mind wonders about %Supporter%'s whereabouts. It has been an entire year since they journeyed away from here, leaving a void in our hearts.",
  "fragile.dialogue.chat.success/12": "Pray, have you heard the tale of what transpired with %Supporter% the other day? It's a story that echoes through the fragility of our village.",
  "fragile.dialogue.chat.success/13": "How I yearn to adopt one of the stray cats that wander these fragile streets. Alas, my overwhelming busyness stifles my noble intentions.",
  "fragile.dialogue.chat.success/14": "The time draws near for me to redecorate my humble abode. Yet, my fragile spirit succumbs to the lethargy that plagues my existence.",
  "fragile.dialogue.chat.success/15": "My fragile heart longs for the day when I may have children of my own. I simply need to find a partner who can withstand my delicate nature.",
  "fragile.dialogue.chat.success/16": "I ponder upon where my fragile self would be if I had chosen to reside in the other village. Such a fragile twist of fate.",
  "fragile.dialogue.chat.success/17": "There are moments when my fragile soul yearns for the innocence of my childhood. Oh, how fragile memories bring forth a flood of emotions!",
  "fragile.dialogue.chat.success/18": "It has been an eternity since I last spoke to my parents. Perhaps my fragile self should embark on",
  "fragile.dialogue.chat.fail/1": "I can't even believe you just said that!",
  "fragile.dialogue.chat.fail/2": "The mere thought of it exploding on its own is absurd.",
  "fragile.dialogue.chat.fail/3": "Wow, you're really not as impressive as you think you are.",
  "fragile.dialogue.chat.fail/4": "Look at you, trying to show off.",
  "fragile.dialogue.chat.fail/5": "You deserve to be locked away in a dungeon!",
  "fragile.dialogue.chat.fail/6": "Ugh, go away! Your fashion sense is so outdated.",
  "fragile.dialogue.chat.fail/7": "Talking about that is just plain stupid, you know?",
  "fragile.dialogue.chat.fail/8": "Why are you bothering me again? I couldn't care less.",
  "fragile.dialogue.chat.fail/9": "Pardon me, but did you say something? Sorry, I couldn't be bothered to pay attention.",
  "fragile.dialogue.chat.fail/10": "Seriously, what's wrong with you? Why are you even discussing this?",
  "fragile.dialogue.chat.fail/11": "I've heard some pretty awful things about you, and now I can see why people think that.",
  "fragile.dialogue.chat.fail/12": "Even zombies would steer clear from having a conversation with you.",
  "fragile.dialogue.chat.fail/13": "You're about as likable as a witch, and that's saying something.",
  "fragile.dialogue.chat.fail/14": "If you keep talking to me, I'll have the guards drag you away.",
  "fragile.dialogue.chat.fail/15": "Huh? Oh, sorry, but your conversation is just so dreadfully boring.",
  "fragile.dialogue.chat.fail/16": "Are you finished babbling yet, or do you have more pointless things to say?",
  "fragile.dialogue.chat.fail/17": "I wonder if anyone will mourn the loss of your incessant blabbering once you're gone.",
  "fragile.dialogue.chat.fail/18": "I'd rather stare at a pig's rear end than engage in conversation with you.",
  "fragile.dialogue.chat.fail/19": "Are you finally done talking to me? Thank goodness.",
  "fragile.dialogue.chat.fail/20": "Wait, you actually believe the Earth is round? Seriously? No corners at all? You can't be serious.",

  "fragile.dialogue.story.success/1": "Oh my goodness, I can't believe all of that actually happened!",
  "fragile.dialogue.story.success/2": "If only I had the courage to face a creeper head-on like you did.",
  "fragile.dialogue.story.success/3": "Wow, that story was absolutely amazing! Did you come up with it yourself?",
  "fragile.dialogue.story.success/4": "Wait, hold on, all of that unbelievable stuff really happened just yesterday?",
  "fragile.dialogue.story.success/5": "No way! I was literally right in that area yesterday, how did I miss hearing about this?",
  "fragile.dialogue.story.success/6": "Haha, it's so typical of %Supporter% to be involved in such incredible adventures. They're truly remarkable.",
  "fragile.dialogue.story.success/7": "I swear I've heard the Legend of %Supporter% a million times, but please, tell it again! It's always so captivating.",
  "fragile.dialogue.story.success/8": "Oh my goodness, is that how you stumbled upon your very first diamond? That's beyond incredible!",
  "fragile.dialogue.story.success/9": "You absolutely have to come over later! I'm dying to hear more mind-blowing stories from you.",
  "fragile.dialogue.story.fail/1": "Oh dear, I must kindly request that you refrain from speaking ill of my dear mother.",
  "fragile.dialogue.story.fail/2": "The village often murmurs about your actions, and it's quite distressing, I must say.",
  "fragile.dialogue.story.fail/3": "I'm sorry, but I'm finding it rather difficult to comprehend the logic behind that statement.",
  "fragile.dialogue.story.fail/4": "Oh my goodness, you truly are terrible! How can you not understand that even Creepers have emotions that can be hurt?",
  "fragile.dialogue.story.fail/5": "My delicate heart can hardly bear the thought of you mercilessly slaughtering an innocent sheep!",
  "fragile.dialogue.story.fail/6": "*yawns delicately* Oh, pardon me, I seem to have dozed off. What were you saying?",
  "fragile.dialogue.story.fail/7": "I must admit, I fail to see how that particular endeavor was even remotely worth my precious time.",
  "fragile.dialogue.story.fail/8": "Goodness gracious, that conversation was dreadfully dull. I can hardly stifle another yawn.",
  "fragile.dialogue.story.fail/9": "I don't mean to sound rude, but your behavior is quite unsettling, and not in the least bit endearing.",
  "fragile.dialogue.story.fail/10": "I'm afraid I fail to see any merit or goodness in what you just did. It's simply beyond my comprehension.",

  "fragile.dialogue.flirt.success/1": "Oh, you! Stop being so charming!",
  "fragile.dialogue.flirt.success/2": "*Giggles* Are you serious?",
  "fragile.dialogue.flirt.success/3": "Oh dear...",
  "fragile.dialogue.flirt.success/4": "That was too sweet! You totally caught my attention!",
  "fragile.dialogue.flirt.success/5": "How do you always manage to leave me breathless? Your presence is absolutely captivating.",
  "fragile.dialogue.flirt.success/6": "Oh my, please, don't say such things! You're making me feel delicate.",
  "fragile.dialogue.flirt.fail/1": "Oh dear, I hope you're not just playing with my emotions again.",
  "fragile.dialogue.flirt.fail/2": "I've been hurt too many times before, so forgive me if I'm skeptical.",
  "fragile.dialogue.flirt.fail/3": "It's not that I doubt you, it's just that I've heard it all before and it always ends in disappointment.",
  "fragile.dialogue.flirt.fail/4": "I hate to sound pessimistic, but I don't think this will work out.",
  "fragile.dialogue.flirt.fail/5": "Sorry to burst your bubble, but I've had my fair share of heartbreak and I'm not eager to add another chapter to that book.",
  "fragile.dialogue.flirt.fail/6": "Please don't give me false hope, my heart can't bear any more pain.",

  "fragile.dialogue.joke.creative.success/1": "*Giggles* That's quite amusing!",
  "fragile.dialogue.joke.creative.success/2": "Oh, that's quite humorous!",
  "fragile.dialogue.joke.creative.success/3": "That's absolutely the most entertaining thing I've heard!",
  "fragile.dialogue.joke.creative.success/4": "You might just be funnier than %Supporter%! Can't stop chuckling!",
  "fragile.dialogue.joke.creative.success/5": "Hahaha! You've got some serious comedic talent there! Have you ever considered a career in stand-up?",
  "fragile.dialogue.joke.creative.success/6": "BAHAHA! That joke is an absolute masterpiece! It's been ages since I've laughed this hard!",
  "fragile.dialogue.joke.creative.success/7": "Teehee! You're definitely funnier than Ash, hands down!",
  "fragile.dialogue.joke.creative.success/8": "Ahah! That's genuinely amusing! I can't help but crack a smile!",
  "fragile.dialogue.joke.creative.failed/1": "Oh my, I really think jokes like that can hurt someone's feelings.",
  "fragile.dialogue.joke.creative.failed/2": "*Giggles nervously* Um, I don't think that joke landed quite well, hehe.",
  "fragile.dialogue.joke.creative.failed/3": "Oh dear, your sense of humor is quite delicate, isn't it?",
  "fragile.dialogue.joke.creative.failed/4": "Did you really intend for that joke to be humorous? I'm not so sure...",
  "fragile.dialogue.joke.creative.failed/5": "Hm, I suppose that could be considered amusing... in some way.",
  "fragile.dialogue.joke.creative.failed/6": "Oh, that was... uhm... funny, I suppose? *gulps*",
  "fragile.dialogue.joke.creative.failed/7": "I'm sorry, but I fail to see the humor in that. Perhaps stick to something less risky?",
  "fragile.dialogue.joke.creative.failed/8": "You know, Ash has a knack for jokes that won't make anyone's heart skip a beat.",

  "fragile.dialogue.procreate_engaged/1": "I must admit, my dear, my heart trembles at the thought of starting a family before we have sealed our love with the sacred bond of matrimony.",
  "fragile.dialogue.procreate_engaged/2": "Oh, my beloved, the mere idea of bringing forth new life without having wholeheartedly pledged our love to one another fills me with an overwhelming sense of unease.",

  "fragile.dialogue.shake_hand.success/1": "Oh, be careful with my delicate hand!",
  "fragile.dialogue.shake_hand.success/2": "Oh my, your grip is so strong, it might break my fragile bones!",
  "fragile.dialogue.shake_hand.success/3": "Oh, um, thank you for being so gentle with me!",
  "fragile.dialogue.shake_hand.success/4": "Oh, good day, please be kind to my fragile existence.",
  "fragile.dialogue.shake_hand.success/5": "Oh, hello there, please excuse my delicate nature.",
  "fragile.dialogue.shake_hand.fail/1": "Are you serious? My delicate heart can't handle witnessing cow slaughter.",
  "fragile.dialogue.shake_hand.fail/2": "Oh, dear me, no. I wouldn't want to disturb your delicate sensibilities.",
  "fragile.dialogue.shake_hand.fail/3": "Oh, please, I'm not some stranger you need to be excessively courteous to.",
  "fragile.dialogue.shake_hand.fail/4": "Goodness gracious, is this really happening? It's quite out of character for you, you know.",
  "fragile.dialogue.shake_hand.fail/5": "Oh, please, just kindly remove yourself from my presence. I don't wish to be subjected to this.",

  "fragile.dialogue.main.morning/1": "Good morning! Handle me with care, I'm feeling a little fragile today.",
  "fragile.dialogue.main.morning/2": "Mornin', ready to work today? Be gentle with me, I'm quite delicate at the moment.",
  "fragile.dialogue.main.morning/3": "I'm still tired, you? My fragile state isn't helping either.",
  "fragile.dialogue.main.morning/5": "Looks like you had a rough night. I, on the other hand, feel like I might shatter at any moment.",
  "fragile.dialogue.main.morning/6": "Rise and shine, buddy. It's going to be a long day. Although, I must warn you, I'm feeling rather frail today.",
  "fragile.dialogue.main.morning/7": "Did you sleep well? You look chipper. I, on the other hand, look like I could break into pieces any second.",
  "fragile.dialogue.main.morning/8": "Morning sleepyhead! Please excuse my fragility today, I'm just not at my best.",
  "fragile.dialogue.main.morning/9": "What a beautiful morning! I think it's going to be a productive day today! Although, I must admit, I'm a bit delicate today.",
  "fragile.dialogue.main.morning/10": "I think I might take it slow today, I'm not feeling too well. My fragile state is just not cooperating.",
  "fragile.dialogue.main.morning/11": "I have a very packed schedule today, just thinking about it makes me tired. And being fragile on top of that doesn't help.",
  "fragile.dialogue.main.morning/12": "I actually got a decent night's sleep, I might do something a bit heavier today, who knows? Although, I must be cautious not to push my fragile self too far.",
  "fragile.dialogue.main.evening/1": "Good evening... I hope nothing bad happens tonight.",
  "fragile.dialogue.main.evening/2": "It's already dark... Did you survive the day?",
  "fragile.dialogue.main.evening/3": "Another day... Another chance for something to go wrong.",
  "fragile.dialogue.main.evening/4": "Time just slipped away... So much to worry about, so little time to fix it all.",
  "fragile.dialogue.main.evening/5": "I should probably go home... I don't want to risk anything happening outside.",
  "fragile.dialogue.main.evening/6": "I wasted the entire day... I accomplished nothing... Just like always.",
  "fragile.dialogue.main.evening/7": "I might just take a nap... I can't handle any more stress today.",
  "fragile.dialogue.main.evening/8": "The night is coming... I should hide indoors... It's the only way to stay safe.",
  "fragile.dialogue.main.evening/9": "Oh, hi... I was just... trying to avoid any danger... See you... if I make it.",
  "fragile.dialogue.main.night/1": "Oh my, are you really still awake at this hour?",
  "fragile.dialogue.main.night/2": "I must say, you have quite the stamina for staying up so late.",
  "fragile.dialogue.main.night/3": "Oh dear, don't tell me you're a night owl too?",
  "fragile.dialogue.main.night/4": "Just be careful out there, my delicate nerves couldn't handle the thought of you being stranded with those dreadful creatures.",
  "fragile.dialogue.main.night/5": "The village guards do provide some comfort, but the darkness of the night is incredibly unsettling, don't you think?",
  "fragile.dialogue.main.night/6": "Ah, the tranquility of the night always fills my fragile heart with serenity. It's the perfect moment to unwind in the silence.",
  "fragile.dialogue.main.night/7": "During the hustle and bustle of the day, it's such a relief to take a gentle stroll under the twinkling stars.",
  "fragile.dialogue.main.night/8": "I'm terribly exhausted. Today has been simply too much for my delicate constitution. I shall have to take it much easier tomorrow.",
  "fragile.dialogue.main.night/9": "Oh, the mere thought of snuggling under cozy covers fills me with delight.",
  "fragile.dialogue.main.night/10": "Darling, I insist, you really must retire for the night. Rumor has it that you have a lot on your plate tomorrow.",

  "fragile.dialogue.greet.mayor/1": "Oh, um, good day there, Mayor! I-I hope the day treats you kindly!",
  "fragile.dialogue.greet.mayor/2": "Wishing you a pleasant day, Mayor! Take care out there, won't you?",
  "fragile.dialogue.greet.monarch/1": "Oh, Your Majesty, it is an absolute honor to be in your presence.",
  "fragile.dialogue.greet.monarch/2": "Greetings, Your Highness! I am humbled by your regal aura.",

  "fragile.dialogue.busy/1": "Oh dear, we've chatted so much today, but my fragile workload is begging for attention. I simply must return to my toil.",
  "fragile.dialogue.busy/2": "Oh, how kind of you to show interest, but alas, my delicate tasks require completion before evening falls. I must focus, you understand.",
  "fragile.dialogue.busy/3": "Pardon me, but my fragile schedule is in disarray at the moment. Might we engage in conversation at a more opportune time?",
  "fragile.dialogue.busy/4": "Regrettably, my workload demands my undivided attention. I shall catch up with you later, once I've vanquished this mountain of tasks.",
  "fragile.dialogue.busy/5": "Oh, woe is me! I've left my furnace unattended, and my responsibilities cannot wait. Farewell for now, we shall converse at a later hour!",
  "fragile.dialogue.goaway/1": "Oh no, please go away.",
  "fragile.dialogue.goaway/2": "Don't you have something more important to attend to?",
  "fragile.dialogue.goaway/3": "Oh dear, %1$s, I'm terribly sorry, but I simply can't talk at the moment.",
  "fragile.dialogue.goaway/4": "Could you please bother someone else instead?",
  "fragile.dialogue.goaway/5": "Oh my goodness, please leave, you dreadful person!",

  "fragile.dialogue.greet": "Oh, um, hey! How are you doing today?",
  "fragile.dialogue.greet/1": "Hey there! How are you holding up today?",
  "fragile.dialogue.greet/2": "Hey %1$s! How's everything going for you?",
  "fragile.dialogue.greet/3": "Oh, hi... Is there something I can help you with?",
  "fragile.dialogue.greet/4": "Wow, you seem like you're ready to conquer the world! How's your day going?",
  "fragile.dialogue.greet/5": "Well, well, well, if it isn't %1$s! It's nice to see your face!",
  "fragile.dialogue.greet/6": "Oh, um, hi there!",
  "fragile.dialogue.greet/7": "It's... it's nice to see you, really.",
  "fragile.dialogue.greet/8": "Hello! Oh, it's quite lovely to see you. How are you feeling today?",
  "fragile.dialogue.greet/9": "Hey! I'm really glad to see you! How are you holding up?",

  "fragile.dialogue.greet.negative/1": "Ugh, please leave immediately! I can't handle your presence right now.",
  "fragile.dialogue.greet.negative/2": "Oh, fantastic, here you are... for the umpteenth time.",
  "fragile.dialogue.greet.negative/3": "Hmm? What do you want now?",
  "fragile.dialogue.greet.negative/4": "Oh, it's you... I was really hoping for someone different. But fine, I guess.",
  "fragile.dialogue.greet.negative/5": "Back to pester me, are we? Just what I needed.",

  "fragile.dialogue.greet.success/1": "Oh wow, that's amazing to hear! I'm just so fragile right now, any good news lifts my spirits!",
  "fragile.dialogue.greet.success/2": "Are you serious? That's absolutely fantastic! I'm so fragile, any positivity really brightens up my day!",
  "fragile.dialogue.greet.success/3": "No way! That's incredible news! I'm feeling so fragile lately, so hearing something good really warms my heart.",
  "fragile.dialogue.greet.success/4": "Oh my goodness, that's incredible! I'm so fragile that even the slightest bit of good news brings tears of joy to my eyes.",
  "fragile.dialogue.greet.success/5": "You're kidding, right? That's absolutely wonderful! I'm feeling quite fragile these days, so knowing something positive really boosts my mood!",
  "fragile.dialogue.greet.fail/1": "Oh dear, that's not quite what I was hoping for...",
  "fragile.dialogue.greet.fail/2": "Well, I suppose that's... somewhat good news.",
  "fragile.dialogue.greet.fail/3": "Oh my, I'm not quite sure how to feel about that...",
  "fragile.dialogue.greet.fail/4": "Oh goodness, are you sure about that? It's a bit surprising...",
  "fragile.dialogue.greet.fail/5": "Oh heavens, that's a bit disappointing...",

  "fragile.dialogue.apologize.success/1": "Oh goodness, it's absolutely fine! Accidents occur, after all.",
  "fragile.dialogue.apologize.success/2": "Oh, don't worry! It's perfectly alright, just take extra care from now on.",
  "fragile.dialogue.apologize.success/3": "Well, I suppose that's alright. But please, do try to be cautious in the future.",
  "fragile.dialogue.apologize.success/4": "No worries at all, my dear. We all slip up now and then.",
  "fragile.dialogue.apologize.success/5": "Oh, it's perfectly fine, my fragile heart can handle such mishaps.",
  "fragile.dialogue.apologize.fail/1": "Oh my goodness, please leave me alone!",
  "fragile.dialogue.apologize.fail/2": "Oh no, you deliberately struck me, didn't you?",
  "fragile.dialogue.apologize.fail/3": "Hah, as if I would ever believe your feeble excuses!",
  "fragile.dialogue.apologize.fail/4": "Ouch, that really stung! Don't even bother trying to make it up to me!",
  "fragile.dialogue.apologize.fail/5": "Umm, sorry, but I highly doubt I can accept your apology.",

  "fragile.dialogue.location.failed/1": "Oh dear, I'm afraid I haven't come across any new information.",
  "fragile.dialogue.location.failed/2": "I'm terribly sorry, but I haven't stumbled upon any exciting locations worth mentioning.",
  "fragile.dialogue.location.failed/3": "No, I'm afraid not. My apologies, but we villagers have more delicate matters to attend to than venturing into perilous ruins like you adventurous types.",
  "fragile.dialogue.location.forgot/1": "Oops, I stumbled upon a fascinating spot, but alas, the details elude my fragile memory. Apologies for the forgetfulness!",
  "fragile.dialogue.location.forgot/2": "Searching for an intriguing place, you say? Ah, there was indeed such a location... Ah! It's slipping away like sand through my fingers! My apologies, my fragile mind failed to document it.",
  "fragile.dialogue.location.forgot/3": "Ah, there existed a remarkable spot, but alas, my feeble memory failed to retain its exact whereabouts. I deeply apologize for my fragile forgetfulness.",
  "fragile.dialogue.location.igloo/1": "I stumbled upon an igloo at %2$s. Can you believe it? A house made entirely of snow! I must say, it's quite delicate... I wouldn't trust it to withstand a gentle breeze, let alone a snowstorm. Brrr!",
  "fragile.dialogue.location.igloo/2": "Oh dear, there's this abandoned igloo at %2$s. It's rather sad, really. I mean, who in their right mind would choose to live in a fragile structure like that? It's like inviting trouble! And, between you and me, it's said to be cursed. I've heard whispers of strange happenings and eerie sounds. Gives me the shivers just thinking about it...",
  "fragile.dialogue.location.igloo/3": "You won't believe what I discovered at %2$s. An abandoned igloo, can you imagine? It's like a house of cards, ready to collapse with the slightest touch. I suspect it's been deserted for ages, probably because no one in their right mind would risk living in such a breakable abode.",
  "fragile.dialogue.location.pyramid/1": "Oh, um, excuse me, but I, um, just saw a pyramid over at %2$s. It's, uh, quite fascinating, you know?",
  "fragile.dialogue.location.pyramid/2": "Did you, um, hear about the pyramid at %2$s? They, uh, say it's quite remarkable. Perhaps, um, you could discover something truly valuable if you, uh, explored it?",
  "fragile.dialogue.location.pyramid/3": "Oh dear, I must, um, warn you about the pyramid at %2$s. There was this, uh, brave soul who ventured there, just like you, but, um, they never returned. Please, um, take extra care if you decide to, uh, go there.",
  "fragile.dialogue.location.ruined_portal_desert/1": "Oh, dear me! You wouldn't believe what I saw in the desert at %2$s. It's a terrible sight! A portal, once so grand, now lies in ruins.",
  "fragile.dialogue.location.ruined_portal_swamp/1": "Oh man, you won't believe what I discovered! There's this portal that's, like, totally demolished. It's in the swamp at %2$s and it's just a wreck. Those poor Nether invaders must have been so shocked when they arrived in this disaster area.",
  "fragile.dialogue.location.ruined_portal/1": "Oh dear, there's a ruined portal at %2$s. It's an absolute disaster, remnants of a ghastly Nether invasion.",
  "fragile.dialogue.location.ruined_portal/2": "Oh my goodness, you won't believe what I saw at %2$s. A completely destroyed nether portal! It's positively spine-chilling, but I suppose it should be safe... just watch out for the treacherous magma, it's as delicate as a porcelain teacup!",
  "fragile.dialogue.location.ruined_portal/3": "I heard whispers about %2$s, a place of ancient ruins. They say it used to house a majestic nether portal, but now it's nothing more than a haunting reminder of its former glory. Some daring souls claim there might be hidden treasures, but honestly, who would dare venture near that perilous site? It's as fragile as a crystal vase, ready to shatter at the slightest touch!",
  "fragile.dialogue.location.ruined_portal_mountain/1": "Dear me, I am afraid I have distressing news",
  "fragile.dialogue.location.mansion/1": "Oh, um, so, if you, uh, happen to, like, wander over to %2$s, there's this, like, super scary mansion, owned by those, um, illagers. I mean, like, seriously, don't even think about going there if you, um, value your, you know, life. It's like, totally not safe, or anything.",
  "fragile.dialogue.location.mansion/2": "Um, so, like, I just wanted to, um, mention that there's this, um, huge mansion at %2$s, owned by those, uh, illagers. I don't know, I mean, personally, I think we should, uh, seriously consider, you know, moving the village, um, far away from here. Like, really far away. It's, like, a total hazard, you know?",
  "fragile.dialogue.location.monument/1": "Oh, dear, oh dear! Do be cautious when you venture to %2$s. It's an absolute nightmare! There's a sunken castle, you see, and it's fiercely protected by those dreadful sea monsters. Oh, please, promise me you'll steer clear of it!",
  "fragile.dialogue.location.monument/2": "Oh, my delicate nerves! Whispers of ancient ruins lurking in the depths of the ocean at %2$s have reached my trembling ears. Oh, the potential for treasure is simply tantalizing, but I must warn you, it's ever so perilous! Danger lurks at every turn, my dear.",
  "fragile.dialogue.location.shipwreck/1": "Oh, dear me! Just stumbled upon a sunken ship at %2$s. Can you believe it? The poor ship from the Eastern Alliance Company, all lost at sea...",
  "fragile.dialogue.location.shipwreck/2": "Have you heard the tragic news? Fishermen found a shipwreck at %2$s. I can't help but wonder if there might be some hidden treasure amidst the wreckage... How precarious and thrilling!",
  "fragile.dialogue.location.shipwreck_beached/1": "Oh, I stumbled upon a rather unfortunate sight at %2$s. There's this ship, in complete ruins, just lying there on the beach. It's quite heartbreaking, really. You can't help but notice it.",
  "fragile.dialogue.location.shipwreck_beached/2": "Hey, have you been to %2$s lately? There's this ship that got wrecked on the shore. It's a bit sad, actually. I can't stop wondering how such a tragedy happened.",
  "fragile.dialogue.location.village_desert/1": "Bless my weary soul! There's a dainty village nestled amongst the scorching dunes in that desert.",
  "fragile.dialogue.location.village_taiga/1": "Oh, oh! Over there, in the midst of the taiga biome, lies another charming village, waiting to be discovered.",
  "fragile.dialogue.location.village_taiga/2": "You simply must make your way to %2$s, my dear friend. Nestled deep within the enchanting taiga biome, you shall stumble upon yet another delightful village.",
  "fragile.dialogue.location.village_snowy/1": "Over yonder, at %2$s, lies a village. It's chillingly cold, one must be careful.",
  "fragile.dialogue.location.village_snowy/2": "If you venture to %2$s, you'll stumble upon a snowy village. Oh, but beware the bone-chilling cold!",
  "fragile.dialogue.location.village_plains/1": "Oh, you must visit the village at %2$s, it's just so delicate and lovely.",
  "fragile.dialogue.location.village_plains/2": "If you venture deep into the vast plain at %2$s, you'll stumble upon another village, so fragile and delicate, like a delicate flower in the wind.",
  "fragile.dialogue.location.village_savanna/1": "Oh my, be careful! There's another village at %2$s. It's scorching hot out there, you'd better bring some ice packs.",
  "fragile.dialogue.location.village_savanna/2": "Hey, did you know? In the scorching savanna at %2$s, there's another village waiting to be discovered. The people there are so kind, but remember to bring your portable fan, the heat can be overwhelming!",
  "fragile.dialogue.location.swamp_hut/1": "Oh, there's this witch, you know, living in the swamp over at %2$s. I, uh, strongly suggest you steer clear of that place. Seriously, nothing good ever comes from crossing paths with that foul enchantress.",
  "fragile.dialogue.location.swamp_hut/2": "Trust me on this one, friend. %2$s? Yeah, you better stay far, far away. Why, you ask? Well, there's this witch, see, and she's taken up residence in this creepy little hut. I don't know about you, but I'd rather not find out what she's got brewing in there.",
  "fragile.dialogue.location.mineshaft/1": "There was a mine here once, but it unfortunately met its end due to a disastrous incident. You'll find it just over yonder, at %2$s.",
  "fragile.dialogue.location.mineshaft/2": "Ah, yes. We had a mine in these parts, situated at %2$s. Tragically, it fell victim to a calamitous mishap and is now but a shadow of its former self. Should you dare to venture there, exercise utmost caution, dear traveler.",
  "fragile.dialogue.location.jungle_pyramid/1": "Oh dear, there's a terribly old temple at %2$s. Please, I implore you, steer clear of that treacherous place. The traps are simply waiting to pounce and cause you harm. It's best to avoid it altogether, for your own safety, of course.",
  "fragile.dialogue.location.jungle_pyramid/2": "Have you heard about the ancient ruins deep within the jungle at %2$s? It's quite the sight to behold, but I must warn you, it's an incredibly perilous place. The traps there are so delicate, it's a wonder they still function. If you dare to venture there, please exercise utmost caution. We wouldn't want any harm to befall you, now would we?",
  "fragile.dialogue.location.pillager_outpost/1": "Oh dear, I'm afraid I must inform you that there's an alarming gathering of those dreadful Pillagers at %2$s. They've set up an outpost right next to us, and we're all quite terrified. We must pray they don't launch an attack anytime soon, for our delicate nerves simply can't handle another onslaught.",
  "fragile.dialogue.location.pillager_outpost/2": "Ah, it's quite distressing to mention, but there's this dreadful outpost, owned by those wicked pillagers, at %2$s. Honestly, it's become an absolute nightmare. The mere thought of venturing anywhere near that place sends shivers down my spine. Those ruthless pillagers shoot on sight, so I implore you to exercise extreme caution if you do find yourself in that vicinity.",
  "fragile.dialogue.location.pillager_outpost/3": "Well, if you dare venture to %2$s, you'll stumble upon the most ghastly outpost, occupied by those dreadful pillagers. Oh, the horror! However, if you happen to possess the courage and skill to vanquish those wretched villains, there might be some valuable treasures awaiting you. The entire village would be eternally grateful if a courageous soul would step forward and rid us of these tormenting creatures.",
  "fragile.dialogue.location.ancient_city/0": "I-I, uh, I-I'm not sure, but I think I might have heard some, uh, peculiar noises coming from, uh, deep underground at %2$s.",
  "fragile.dialogue.location.ancient_city/1": "Oh my, I-I can't help but feel a sense of unease, as if there's something, uh, concealed far beneath the ground at %2$s.",
  "fragile.dialogue.location.ancient_city/3": "L-Legends, they speak of an ancient city, hidden in the depths of, uh, %2$s. I-I couldn't personally verify it, but perhaps it's, uh, located underground?",

  "fragile.dialogue.joke.monster.success/1": "Oh my goodness! That poor Skelly didn't stand a chance, haha!",
  "fragile.dialogue.joke.monster.success/2": "Oh no! That zombie actually thought a shovel could harm you? How amusing, haha!",
  "fragile.dialogue.joke.monster.success/3": "My goodness, you certainly put that spider in its place! Haha, such bravery!",
  "fragile.dialogue.joke.monster.success/4": "Can you believe it? You managed to convince a skeleton to take down a creeper! Oh, the hilarity, haha!!",
  "fragile.dialogue.joke.monster.success/5": "Haha! Oh dear, those cave spiders must have the tiniest brains! How fragile they are!",
  "fragile.dialogue.joke.monster.failed/1": "I-I can't believe you're mocking the sentience of skeletons! It's just...it's just too much!",
  "fragile.dialogue.joke.monster.failed/2": "Um, excuse me, but making jokes about creepers blowing up is really not appropriate. Like, at all. Seriously!",
  "fragile.dialogue.joke.monster.failed/3": "You know, zombies and skeletons were once human beings, just like you and me. It's kind of sad, actually, to think about it.",
  "fragile.dialogue.joke.monster.failed/4": "Oh wow, an enderman falling into water. How...how wonderfully groundbreaking. *sigh*",
  "fragile.dialogue.joke.monster.failed/5": "It's not exactly funny, but I guess if you find amusement in silverfish ambushing people on the toilet, more power to you. It's just...odd that it keeps happening, don't you think? *nervous chuckle*",

  "fragile.dialogue.joke.animal.success/1": "How unfortunate it is for the poor sheep to lose its wool. Quite amusing, isn't it?",
  "fragile.dialogue.joke.animal.success/2": "Imagine, the wolf actually ended up falling head over heels for the sheep. Oh, my fragile heart!",
  "fragile.dialogue.joke.animal.success/3": "Oh my, that's positively hilarious! Who would have thought chickens possessed such extraordinary talents?",
  "fragile.dialogue.joke.animal.success/4": "That's utterly foolish, but my delicate soul finds it oddly endearing!",
  "fragile.dialogue.joke.animal.success/5": "Oh, the sheer relief that cows possess the magical ability to produce infinite milk! How delicate and fortunate they are!",
  "fragile.dialogue.joke.animal.failed/1": "Oh dear, that joke is simply too much for my delicate sensibilities.",
  "fragile.dialogue.joke.animal.failed/2": "My goodness, that sheep must be devastated! It's just not amusing in the slightest!",
  "fragile.dialogue.joke.animal.failed/3": "Please refrain from making such comments about my precious pig! It's truly distressing.",
  "fragile.dialogue.joke.animal.failed/4": "How could you? That joke is beyond the pale. It's simply too hurtful for me to handle.",
  "fragile.dialogue.joke.animal.failed/5": "Oh my, making fun of the cow's eyebrows? That's just too much for my fragile heart to bear.",

  "fragile.dialogue.flirt.slap/1": "Pardon me, but that statement stung a little, you know?",
  "fragile.dialogue.flirt.slap/2": "Oh my, did a wandering Evoker perhaps give you some questionable advice on flirting? It's quite delicate, you see.",
  "fragile.dialogue.kiss.slap/1": "Oh my goodness, I can't believe you just did that!",
  "fragile.dialogue.kiss.slap/2": "If you even think about doing that again, I might, I don't know, break into a million tiny pieces!",

  "fragile.dialogue.chat.plains/1": "Oh, the plains... Such a fragile beauty, untouched by the chaos of other biomes. It's a shame I can't leave, but I dream of venturing beyond one day...",
  "fragile.dialogue.chat.plains/2": "The serene plains, so fragile and delicate. While it may lack the thrill of other biomes, there's a certain charm that keeps me rooted here. I wouldn't trade it for the world.",
  "fragile.dialogue.chat.plains/3": "When night falls upon the plains, it's as if the fragility of the stars is mirrored in the landscape. It's a breathtaking sight, one that tugs at the strings of my delicate heart.",
  "fragile.dialogue.chat.plains/4": "Oh, I often find myself lying down beneath the vast expanse of the sky, lost in the fragility of it all. It's a reminder that we, too, are but fragile beings in this vast world.",
  "fragile.dialogue.chat.plains/5": "The air in the plains, so delicate and pure, it almost feels unreal. In comparison to the taiga, it's like a fragile breath of fresh air that caresses my fragile senses.",
  "fragile.dialogue.chat.plains/6": "Ah, the plains... So plain and unassuming, yet in its simplicity lies a certain fragility that is often overlooked. Sometimes, the fragile and unadorned things are the most precious.",
  "fragile.dialogue.chat.plains/7": "The weather like this, so delicate and reminiscent of my fragile childhood. I used to collect wildflowers, hoping to catch the attention of a certain someone. Oh, how fragile those memories are now...",
  "fragile.dialogue.chat.plains/8": "Ah, the delicate beauty of the morning sunrise in the plains! You should witness it someday, let the fragile hues of dawn paint your soul with serenity.",
  "fragile.dialogue.chat.savanna/1": "The scorching heat in this savanna is quite overwhelming, but hey, at least we don't have to deal with freezing winters, right?",
  "fragile.dialogue.chat.savanna/2": "These llamas can be quite the handful, but I'm learning to find some joy in their quirky antics.",
  "fragile.dialogue.chat.savanna/3": "The architecture here in the savanna is so delicate and intricate, it's like living in a work of art. That's why I simply couldn't resist settling here.",
  "fragile.dialogue.chat.savanna/4": "Never underestimate the savanna biome, my friend. It may seem unassuming, but it holds hidden treasures and surprises that can take your breath away.",
  "fragile.dialogue.chat.savanna/5": "Unlike those poor desert villages, we may not get rain, but our flowing rivers bring life and abundance to our community.",
  "fragile.dialogue.chat.savanna/6": "Oh, the hills and terrains in this savanna are absolutely captivating! I could spend hours just marveling at their beauty.",
  "fragile.dialogue.chat.savanna/7": "When the scorching sun beats down on us, the shade provided by the acacia trees becomes my fragile refuge and helps me soldier on through the long workdays.",
  "fragile.dialogue.chat.savanna/8": "Trust me, my dear, our savanna villages are renowned for producing the most exquisite melons and pumpkins. We are in high demand for trade with other villages because of our bountiful harvests!",
  "fragile.dialogue.chat.taiga/1": "The woods, oh how delicate they are. They provide us with materials, firewood, and ah, what a splendid hunting ground they make.",
  "fragile.dialogue.chat.taiga/2": "Some may argue it's cold within the taiga, but oh, it's a fragile paradise indeed. I simply cannot fathom trading it for anything else!",
  "fragile.dialogue.chat.taiga/3": "Taiga forests, so exquisitely cool! The sweet berries, oh, they are simply divine.",
  "fragile.dialogue.chat.taiga/4": "Ah, my heart skips a beat for the mischievous foxes that grace our taiga forests. I often indulge them with sweet berries, such delicate creatures.",
  "fragile.dialogue.chat.taiga/5": "With an abundance of nourishment, the wolves in our midst are curiously gentle, one could even say fragile.",
  "fragile.dialogue.chat.taiga/6": "The fresh, crisp air of the taiga, it fills my lungs with the most delicate serenity.",
  "fragile.dialogue.chat.taiga/7": "Ah, the sweet berry bushes, they boast the most exquisite fruit. Yet, a single prick, and oh, it is an agonizing fragility.",
  "fragile.dialogue.chat.taiga/8": "The rain in our beloved taiga, it has a chilling touch. But, oh, the fragility of its tranquility, it's simply enchanting.",
  "fragile.dialogue.chat.snowy_plains/1": "Brrr... It's so cold here! I hope I don't freeze to death.",
  "fragile.dialogue.chat.snowy_plains/2": "I can't feel my fingers anymore! But hey, at least the icy winds are keeping the mosquitoes away. Silver lining, right?",
  "fragile.dialogue.chat.snowy_plains/3": "This weather is absolutely bone-chilling! All I want to do is curl up in a corner and pray for the sun to come out.",
  "fragile.dialogue.chat.snowy_plains/4": "Snow brings back the memories of my youth, when I used to frolic in the winter wonderland with my gang. Oh, how I long for those carefree days!",
  "fragile.dialogue.chat.snowy_plains/5": "Those strays are a menace, especially when they start shooting at innocent villagers. It's like they have a personal vendetta against us!",
  "fragile.dialogue.chat.snowy_plains/6": "Beware of the ferocious wolves lurking nearby! They'd tear you apart without a second thought. Stay safe, my friend.",
  "fragile.dialogue.chat.snowy_plains/7": "Getting accidentally stuck to an iron golem is my worst nightmare! It's like being trapped in a never-ending wrestling match with a hunk of metal.",
  "fragile.dialogue.chat.snowy_plains/8": "Ah, the nostalgic scent of pumpkin. It takes me back to my childhood, when my parents would gift me one. We'd carve goofy faces on them and then make pie. Good times, good times indeed.",
  "fragile.dialogue.chat.desert/1": "Oh my, it's scorching hot out here in the desert! But hey, no snow worries, right?",
  "fragile.dialogue.chat.desert/2": "The desert, oh dear, it's warm throughout the entire year.",
  "fragile.dialogue.chat.desert/3": "Oh, the desert heat! It's unbearable. I'll always have a tan or a sunburn, I'm afraid...",
  "fragile.dialogue.chat.desert/4": "Ah, the night sky in the desert, so breathtakingly beautiful. Cool and serene, a delight for stargazing.",
  "fragile.dialogue.chat.desert/5": "Goodness gracious! The sun is simply unbearable today. I'm positively melting out here!",
  "fragile.dialogue.chat.desert/6": "Oh my, oh my! The sun is terribly fierce today, don't you think?",
  "fragile.dialogue.chat.desert/7": "Have you spotted any bunnies around here? They're so hard to spot in this vast desert!",
  "fragile.dialogue.chat.desert/8": "Oh dear, living in this desert comes with its setbacks. Those husks, goodness me! They always leave me famished. How unfair!",
  "fragile.dialogue.chat.desert/9": "I had a rather unfortunate encounter with a cactus the other day. Ouch! One must tread cautiously in these arid lands!",
  "fragile.dialogue.chat.desert/10": "Life in this parched desert is truly challenging. But thankfully, our village provides us with water and sustenance.",

  "fragile.dialogue.story.exploring.success/1": "Oh, goodness! Exploring the world sounds so fascinating, but I can't help but feel a little timid at the thought of it.",
  "fragile.dialogue.story.exploring.success/2": "Oh my gosh! The idea of traveling and exploring is so awe-inspiring. I adore my village and all, but hearing you talk about it makes me feel so incredibly envious!",
  "fragile.dialogue.story.exploring.success/3": "You must possess an incredible amount of bravery to venture into the great unknown like that. I'm in awe of your courage!",
  "fragile.dialogue.story.exploring.fail/1": "Oh, I must admit, I find your stories quite tiresome, my dear.",
  "fragile.dialogue.story.exploring.fail/2": "Oh dear, please be careful with that sharp edge of yours, we wouldn't want any accidents now, would we?",
  "fragile.dialogue.story.exploring.fai/l3": "Having a discussion with you is as delicate as tiptoeing through a field of delicate glass figurines, one wrong move and everything crumbles. But let's face it, there isn't much substance to crumble either way.",

  "fragile.dialogue.story.nether.success/1": "Is it, like, super hot there?! I mean, I can barely handle a warm day in the Overworld...",
  "fragile.dialogue.story.nether.success/2": "Whoa, you're like, a total legend for surviving in the Nether! I can't even handle a little lava pool without freaking out.",
  "fragile.dialogue.story.nether.success/3": "So, uh, I heard the Nether is, like, filled with all sorts of epic treasures. Too bad I'm, like, the most fragile villager ever and can't even think about going there.",
  "fragile.dialogue.story.nether.success/4": "You must be, like, insanely brave to venture into the Nether. I mean, I'd probably faint from fear just thinking about it... Not that I'm a scaredy-cat or anything.",
  "fragile.dialogue.story.nether.success/5": "Um, have you, like, ever encountered a Zombified Piglin? 'Cause, uh, they sound kind of terrifying... Just curious, you know?",
  "fragile.dialogue.story.nether.fail/1": "I highly doubt you've ever dared to venture into the treacherous Nether.",
  "fragile.dialogue.story.nether.fail/2": "Oh, I can see why those fearsome Piglins took a swipe at you. You're as delicate as a daisy!",
  "fragile.dialogue.story.nether.fail/3": "Honestly, it doesn't matter to me if you've been to the Nether or not. I just don't think you have the nerve to craft a captivating story.",
  "fragile.dialogue.story.nether.fail/4": "Hmm, you appear terribly feeble to even consider trudging through the fiery depths of the Nether.",
  "fragile.dialogue.story.nether.fail/5": "My dear old grandpapa, who braved the perils of the Nether, never once mentioned this so-called warped fungus. You're clearly just a deceiver!",

  "fragile.dialogue.story.enderdragon.success/1": "Unbelievable! And pray tell, hast thou brought the precious dragon egg along?",
  "fragile.dialogue.story.enderdragon.success/2": "Oh dear! Hast thou truly vanquished the formidable dragon of lore?! The village shall cherish thy heroic deeds for an eternity!",
  "fragile.dialogue.story.enderdragon.fail/1": "Oh my goodness! Are you out of your mind? The ender dragon is utterly invincible!",
  "fragile.dialogue.story.enderdragon.fail/2": "You've got to be kidding me! It's an absolute impossibility for any mortal to make even the slightest dent in that fearsome dragon!",

  "fragile.dialogue.story.wither.success/1": "Oh my goodness! The Wither is like a walking catastrophe, spreading chaos wherever it goes!",
  "fragile.dialogue.story.wither.success/2": "Wow, you actually managed to defeat the Wither? That's absolutely mind-blowing!",
  "fragile.dialogue.story.wither.fail/1": "I'm not entirely convinced of your words.",
  "fragile.dialogue.story.wither.fail/2": "You appear surprisingly intact for that story to hold any truth.",

  "fragile.dialogue.stay.fail/1": "Oh, I appreciate the offer, but I'm a bit of a fragile soul, you know? Adventure is not really my cup of tea.",
  "fragile.dialogue.stay.fail/2": "Thank you for considering, but I'd rather stay within the safe confines of this village. I'm not cut out for the adventurous lifestyle, I'm afraid.",
  "fragile.dialogue.stay.fail/3": "This village is quite delightful, but I'm too delicate for daring escapades. I'll stick to the comforts of home, thank you very much.",
  "fragile.dialogue.stay.repeat/1": "Oh my, I do believe we've already covered this topic, haven't we?",
  "fragile.dialogue.stay.repeat/2": "Goodness gracious, you've already inquired about this matter, haven't you?",
  "fragile.dialogue.stay.success/1": "Oh, thank you so much! I would absolutely adore remaining in this lovely village!",
  "fragile.dialogue.stay.success/2": "This is absolutely incredible! I am head over heels in love with this village and would be absolutely thrilled to stay!",
  "fragile.dialogue.stay.no_space/1": "Oh my, this village is just teeming with people! It's quite overwhelming, really.",
  "fragile.dialogue.stay.no_space/2": "I'm rather keen on staying, dear sir or madam, but regrettably, there seems to be a dire shortage of beds.",

  "fragile.dialogue.hire/1": "Absolutely! Consider me your trusty sidekick. Just give me a sign, and I'll come running, eager to exchange my services for those shiny emeralds!",
  "fragile.dialogue.hire/2": "Count me in, dear customer! I'll be at your beck and call, ready to work hard for those valuable emeralds. Just say the word, and I'm at your service!",
  "fragile.dialogue.hire/3": "Oh, I'm more than happy to help! Just give me a heads up, and I'll be right here, cautiously, waiting for my fair share of emeralds as a token of gratitude!",
  "fragile.dialogue.no_money/1": "Oh dear, I'm afraid I can't work for free. You'll have to gather more emeralds if you want my assistance.",
  "fragile.dialogue.no_money/2": "Goodness me, do you think I'm some kind of charity worker? I'm afraid your current emerald stash won't cut it if you want to hire me.",
  "fragile.dialogue.no_money/3": "My dear prospective employer, I must inform you that my services come at a cost. You'll need a heftier amount of emeralds to secure my expertise.",

  "fragile.dialogue.main.rock_paper_scissor/1": "How about a game of Rock Paper Scissors? Just be mindful not to break me, okay?",
  "fragile.dialogue.rock_paper_scissor/1": "Ready for a round of rock, paper, scissors? Let's hope I don't break under the pressure!",
  "fragile.dialogue.rock_paper_scissor/2": "Oh, I'm feeling quite fragile today, but don't underestimate me! I'm determined to triumph this time!",
  "fragile.dialogue.rock_paper_scissor.rock/1": "Oh no, I chose rock! I hope it doesn't break!",
  "fragile.dialogue.rock_paper_scissor.paper/1": "I'm counting on the tender touch of my paper!",
  "fragile.dialogue.rock_paper_scissor.scissor/1": "My fragile scissor is my secret weapon, handle it with caution!",
  "fragile.dialogue.rock_paper_scissor.loose.rock/1": "Oh dear, I thought rock would conquer all, but your paper prevailed!",
  "fragile.dialogue.rock_paper_scissor.loose.paper/1": "I'm feeling so fragile, but I'll still choose scissors!",
  "fragile.dialogue.rock_paper_scissor.loose.scissor/1": "Oh dear, my scissors have been crushed by your rock. You win this time!",
  "fragile.dialogue.rock_paper_scissor.win.rock/1": "Oh dear, the mighty rock has shattered my feeble scissor, leaving me defeated.",
  "fragile.dialogue.rock_paper_scissor.win.paper/1": "Oh dear, rock always seems to crush my hopes of winning.",
  "fragile.dialogue.rock_paper_scissor.win.scissor/1": "My delicate scissors have fallen victim to your cunning paper maneuver. Impressive!",
  "_": ""
}
