{
  "shy.dialogue.main/1": "Oh... um, h-hello...",
  "shy.dialogue.main/2": "H-hey... um, h-how are you today?",
  "shy.dialogue.main/3": "H-hi... g-good to see you...",
  "shy.dialogue.main/4": "Um... w-what's going on with you today?",
  "shy.dialogue.main/5": "H-h-how are you today?",
  "shy.dialogue.main/6": "Oh, um... h-hey %1$s... w-what's up?",
  "shy.dialogue.main/7": "S-so... I was, um, hanging out with %supporter%, and, uh, he got bit by a zombie... b-but he said it was alright, so... um, I believed him... W-what was I t-talking about? Oh, um, anyway, I saw a zombie t-that... um, looks just like %supporter% today...",

  "shy.dialogue.rumors.failed/1": "Hmm, I'm afraid I haven't heard anything interesting lately.",
  "shy.dialogue.rumors.lore/1": "Oh, um... It seems that Sirben's followers are growing in number lately, overshadowing Jax. These prophets, MerlinWolfGames and Crow, are spreading his teachings.",
  "shy.dialogue.rumors.lore/2": "Um... Once upon a time, there were these, uh, cyberdemons who attempted to invade our peaceful realm. But, uh, thankfully, Sirben and Luke united and put a stop to their invasion.",
  "shy.dialogue.rumors.lore/3": "Um, so there's this, um, mysterious builder named 2DA50 who was rumored to be involved in the disappearance of the Ancient Builder. People say that, uh, 2DA50 ventured into the treacherous Far Lands and never returned.",
  "shy.dialogue.rumors.lore/4": "You know, uh, MerlinWolfGames actually crafted this incredible temple dedicated to Sirben. It's, um, considered one of the ancient wonders of our world.",
  "shy.dialogue.rumors.lore/5": "Oh, um, there used to be this ancient civilization of builders, but, uh, you know, they vanished without a trace. It's quite sad, really.",
  "shy.dialogue.rumors.lore/6": "Um, have you, um, ever heard about the legends of the ancient builders? The ones who, um, left all those ruins and temples, um, all over the Overworld? It's, um, quite fascinating...",

  "shy.dialogue.first.generic/1": "Um, excuse me... I... I don't think I've seen you before. Welcome, traveler.",
  "shy.dialogue.first.generic/2": "Oh, um, hello there! It's, um, really nice to, um, see someone new around here.",
  "shy.dialogue.first.generic/3": "Wow, um, it's, um, quite refreshing to have a new face, you know?",
  "shy.dialogue.first.generic/4": "Uh, welcome to the village, stranger. I, um, I bet you have some interesting stories to share, right?",
  "shy.dialogue.first.generic/5": "Oh, um, it's been quite a while since, um, we've had a traveler here. Please, um, make yourself comfortable.",
  "shy.dialogue.first.generic/6": "Oh, um, hello! Welcome to our, um, village! It's, um, always nice to see someone new.",

  "shy.dialogue.first.question/1": "H-hello there. W-what brings you to our humble village?",
  "shy.dialogue.first.question/2": "Oh, um, h-hi! W-what brings you to our little corner of the world?",
  "shy.dialogue.first.question/3": "G-gosh, you're new here! Are you, uh, an adventurer? H-how did you manage to find us?",
  "shy.dialogue.first.exploring/1": "Um, we don't really have a lot here, but, um, you're totally welcome to, um, stay. Just, um, please don't, like, break any rules or anything.",
  "shy.dialogue.first.exploring/2": "Oh, um, if you, uh, follow the laws, then, um, you're more than welcome to, um, stay here, traveler.",
  "shy.dialogue.first.exploring/3": "Um, please, um, be mindful of your manners, um, dear traveler.",
  "shy.dialogue.first.settling/1": "Oh, um... hello. It's, um, nice to see you here.",
  "shy.dialogue.first.settling/2": "H-hi there, neighbor. W-welcome to the village.",
  "shy.dialogue.first.settling/3": "Um, it's... um, nice to have another person to help around here.",
  "shy.dialogue.first.settling/4": "Oh, you're, uh, staying? Th-that's great!",
  "shy.dialogue.first.spent_night.success/1": "U-um, if you're looking for a place to rest, um, I-I could suggest our inn, if that's okay...",
  "shy.dialogue.first.spent_night.success/2": "A-ah, i-if you're tired and need to recharge, you might find our inn to be, um, the best option around here.",
  "shy.dialogue.first.spent_night.success/3": "If, um, if you're interested in a comfortable bed and some delicious food, p-please consider visiting our inn... it's, um, quite nice.",
  "shy.dialogue.first.spent_night.failed/1": "Um, well, you see, we uh, don't really have an inn. I mean, we're not really experts at that sort of thing...",
  "shy.dialogue.first.spent_night.failed/2": "Oh, um, sorry, but we don't have an inn here. I guess we're not really equipped for that kind of thing...",
  "shy.dialogue.first.spent_night.failed/3": "Um, well, have you thought about trying another village? They might, uh, have what you're looking for...",

  "shy.dialogue.hug.success/1": "Oh... um... I-I haven't seen you in forever!",
  "shy.dialogue.hug.success/2": "Th-thank you... I... I really needed that.",
  "shy.dialogue.hug.success/3": "It's... it's nice to have something good happen today, even if it's just this.",
  "shy.dialogue.hug.success/4": "Y-you're... you're like a cozy blanket wrapped around me!",
  "shy.dialogue.hug.success/5": "Oh! Th-thank you... I... I appreciate it... *blushes* You're... you're warm...",
  "shy.dialogue.hug.success/6": "Wow! I c-can't believe I'm saying this, but... your hug made me feel all warm and fuzzy inside...",
  "shy.dialogue.hug.fail/1": "Y-You're... uh, a little dirty there...",
  "shy.dialogue.hug.fail/2": "N-No, thank you, I... I'm not really comfortable with hugs...",
  "shy.dialogue.hug.fail/3": "U-Uh, wh-why would you want to hug me?",
  "shy.dialogue.hug.fail/4": "A-After you called me a dinosaur last week... I-I don't think I can hug you.",
  "shy.dialogue.hug.fail/5": "T-To be honest, I-I don't think you really deserve a hug after what you did...",
  "shy.dialogue.hug.fail/6": "Ew! P-Please, get away from me! I don't want your... germs...",
  "shy.dialogue.hug.fail/7": "Oh? Uhm, th-thank you, I... I guess...",

  "shy.dialogue.kiss.success/1": "Um, um, I... uh, I kind of wish this moment would, uh, last forever. Maybe. Yeah.",
  "shy.dialogue.kiss.success/2": "Oh, um, I think... I think I might, um, love you... maybe. Just a little bit. Yeah.",
  "shy.dialogue.kiss.success/3": "Oh, um, wow! This, uh, tastes like pumpkin pie! Would you, um, like some? Maybe?",
  "shy.dialogue.kiss.success/4": "Mmm! Oh, um, excuse me, but, uh, you taste like, uh, honey. It's, uh, quite nice actually.",
  "shy.dialogue.kiss.success/5": "Oh! Uh, you know, you're, um, actually quite a good kisser, %1$s. Surprisingly. Yeah.",
  "shy.dialogue.kiss.success/6": "Oh, uh, %1$s, you, uh, you kiss, um, better than Ash! *giggles shyly* Yeah, um, definitely.",
  "shy.dialogue.kiss.fail/1": "Um, maybe we shouldn't if someone might catch us...?",
  "shy.dialogue.kiss.fail/2": "Oh, I mean, was that supposed to be a kiss?",
  "shy.dialogue.kiss.fail/3": "Uh, Ash is actually a better kisser than you, just saying.",
  "shy.dialogue.kiss.fail/4": "Ahem, maybe consider investing in some breath mints? Just a thought.",
  "shy.dialogue.kiss.fail/5": "Well, I, um, appreciate the gesture, I guess?",
  "shy.dialogue.kiss.fail/6": "Oh, uh, could you please... get off me? Thank you.",

  "shy.dialogue.chat.success/1": "Um, you know, cookies and milk might be, um, kind of tasty if you ask me.",
  "shy.dialogue.chat.success/2": "Yeah, I guess the weather is, um, nice today... if you're into that sort of thing.",
  "shy.dialogue.chat.success/3": "Oh, I'm alright, I guess. Woke up and, um, stubbed my toe. No big deal, really.",
  "shy.dialogue.chat.success/4": "They say an apple a day keeps the, um, zombies away. Not that I'd know, of course.",
  "shy.dialogue.chat.success/5": "I, um, have this dream, you know? Building my own village. But, um, laziness gets the best of me.",
  "shy.dialogue.chat.success/6": "So, um, I think I saw %Supporter% the other day, um, wearing Diamond armor. Quite impressive, I must say.",
  "shy.dialogue.chat.success/7": "You won't believe it, but, um, my friend %Supporter% told me about finding a chest full of diamonds. Can you imagine?",
  "shy.dialogue.chat.success/8": "Isn't the weather, um, remarkable? I mean, I personally find the sunny weather, um, somewhat enjoyable.",
  "shy.dialogue.chat.success/9": "I've been living here my whole life and, um, I just don't understand what the fuss is about these spiders and goblins.",
  "shy.dialogue.chat.success/10": "Hmm, I wonder too, um, what happened to %Supporter%. They left this place about a year ago, you know?",
  "shy.dialogue.chat.success/12": "Oh, have you heard the news about %Supporter%? Something, um, happened to them the other day.",
  "shy.dialogue.chat.success/13": "I've been thinking about, um, adopting one of the stray cats around here. But, um, I've been so busy lately, you know?",
  "shy.dialogue.chat.success/14": "Um, I've been considering redecorating my house sometime soon... if I can find the motivation, that is.",
  "shy.dialogue.chat.success/15": "I, um, hope to have kids one day. Just need to find the right partner, you know? Easier said than done.",
  "shy.dialogue.chat.success/16": "Sometimes, I, um, wonder where I would be if I chose to live in the other village. Different life and all that.",
  "shy.dialogue.chat.success/17": "Ah, memories from my childhood... Um, good times, you know? Makes me feel a bit nostalgic.",
  "shy.dialogue.chat.success/18": "Um, I haven't talked to my parents in a while. Maybe I should, um, pay them a visit sometime.",
  "shy.dialogue.chat.success/19": "I've been meaning to, um, travel to the other village nearby. I have a few friends there that I haven't seen in ages.",
  "shy.dialogue.chat.success/20": "You know, sometimes I",
  "shy.dialogue.chat.fail/1": "Oh, um, excuse me, did you really just say that?",
  "shy.dialogue.chat.fail/2": "I, um, don't think it could have exploded on its own, you know...",
  "shy.dialogue.chat.fail/3": "Um, you're not, like, that cool, or anything...",
  "shy.dialogue.chat.fail/4": "Wow, that's quite a show-off move...",
  "shy.dialogue.chat.fail/5": "Maybe, um, you should be thrown in a dungeon, just saying...",
  "shy.dialogue.chat.fail/6": "Oh, um, sorry, but your outfit is, like, really old-fashioned...",
  "shy.dialogue.chat.fail/7": "Um, that's kind of a silly thing to talk about, don't you think?",
  "shy.dialogue.chat.fail/8": "Oh, um, why are you, like, talking to me again?",
  "shy.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I, um, wasn't really paying attention...",
  "shy.dialogue.chat.fail/10": "Oh, um, excuse me? Did I hear you correctly?",
  "shy.dialogue.chat.fail/11": "Um, what's wrong with you? Why are you talking about this?",
  "shy.dialogue.chat.fail/12": "I've, um, heard some not-so-nice things about you, and, um, I can kinda see why...",
  "shy.dialogue.chat.fail/13": "Oh, uh, even zombies wouldn't want to talk to you, I guess...",
  "shy.dialogue.chat.fail/14": "You're, um, as unlikeable as a witch, I suppose...",
  "shy.dialogue.chat.fail/15": "Um, please don't talk to me, or, um, I'll have to call the guards to, um, move you away...",
  "shy.dialogue.chat.fail/16": "Huh? Oh, sorry, your conversation was, like, really boring to me...",
  "shy.dialogue.chat.fail/17": "Um, are you done talking? Because, um, I kinda have things to do...",
  "shy.dialogue.chat.fail/18": "I, um, wonder if anyone would miss your babbling if you suddenly stopped talking forever...",
  "shy.dialogue.chat.fail/19": "I'd, um, rather stare at a pig's rear than talk to you, just being honest...",
  "shy.dialogue.chat.fail/20": "Oh, um, are you finished talking to me? Because, um, I would really appreciate that...",
  "shy.dialogue.chat.fail/21": "What? You, um, believe the earth is round? Seriously? No corners? That's, um, interesting...",

  "shy.dialogue.story.success/1": "Oh... um, that's... wow, I can't believe all of that really happened!",
  "shy.dialogue.story.success/2": "I... I wish I had the courage to even think about facing a creeper.",
  "shy.dialogue.story.success/3": "Th-that was... um, a really... nice story! Is it... um, your own creation?",
  "shy.dialogue.story.success/4": "Y-you mean all of that... happened... yesterday? No... no way!",
  "shy.dialogue.story.success/5": "Oh, I... I was actually... near there yesterday, but... um, I guess I didn't hear anything about this yet.",
  "shy.dialogue.story.success/6": "Hehe, yeah... %Supporter% is... pretty amazing, I suppose. They always do such awesome things.",
  "shy.dialogue.story.success/7": "Um, I... I've heard the Legend of %Supporter%... a-almost a million times. B-but I wouldn't mind hearing it again!",
  "shy.dialogue.story.success/8": "Ohh! S-so, that's... um, how you found your first diamond? That's... really impressive!",
  "shy.dialogue.story.success/9": "I-if you're free later... um, maybe you could come over? I-I would really... um, love to hear more stories.",
  "shy.dialogue.story.fail/1": "U-um... Excuse me, but that's my, um, mother you're talking about...",
  "shy.dialogue.story.fail/2": "I-I'm sorry, I don't quite understand...",
  "shy.dialogue.story.fail/3": "T-the village, they, um, they talk about you because... well, you know...",
  "shy.dialogue.story.fail/4": "Oh my, why would you do such a thing? Poor sheep... *blushes*",
  "shy.dialogue.story.fail/5": "*giggles* Oh! I-I'm sorry, I must've dozed off... What were you saying?",
  "shy.dialogue.story.fail/6": "Um, I don't mean to be rude, but... was that really worth my time?",
  "shy.dialogue.story.fail/7": "Oh, um, yawn! How... how terribly boring...",
  "shy.dialogue.story.fail/8": "Y-you're quite unique, I must say. In a way that's, um... not so good...",
  "shy.dialogue.story.fail/9": "Oh, um, I'm sorry, but I-I don't really see how that was... good... at all...",
  "shy.dialogue.story.fail/10": "Gosh, I'm really sorry, but I can't find any way to spin that as a win...",

  "shy.dialogue.flirt.success/1": "Um...thank you...I mean, you're really brave.",
  "shy.dialogue.flirt.success/2": "Wow, you're...um...really cute...I mean...never mind.",
  "shy.dialogue.flirt.success/3": "*Blushes uncontrollably* Did you...um...mean that?",
  "shy.dialogue.flirt.success/4": "Oh, goodness gracious...",
  "shy.dialogue.flirt.success/5": "That was...um...adorable! You...um...had me from the moment we met!",
  "shy.dialogue.flirt.success/6": "How do you...um...manage to look so stunning all the time? Whenever I see you, my words...um...disappear.",
  "shy.dialogue.flirt.success/7": "Oh, please...stop...you're making me blush like crazy.",
  "shy.dialogue.flirt.fail/1": "Oh, um... I mean, if you really mean it, maybe you could show me?",
  "shy.dialogue.flirt.fail/2": "Aw, really? I mean, that's sweet, but I've heard that line before.",
  "shy.dialogue.flirt.fail/3": "Oh gosh, I couldn't possibly. It's just too much.",
  "shy.dialogue.flirt.fail/4": "Me? No way! I'm just a simple villager, you know?",
  "shy.dialogue.flirt.fail/5": "Oh, come on! You're just saying that to make me blush.",
  "shy.dialogue.flirt.fail/6": "Please don't say stuff like that. It's embarrassing, really.",
  "shy.dialogue.flirt.fail/7": "Um, please don't, uh, give me that look and, um, never say that again.",

  "shy.dialogue.joke.creative.success/1": "*Giggles* That's quite amusing!",
  "shy.dialogue.joke.creative.success/2": "That's... um... funny!",
  "shy.dialogue.joke.creative.success/3": "That's one of the best jokes I've come across!",
  "shy.dialogue.joke.creative.success/4": "You might be funnier than %Supporter%... I mean... maybe...",
  "shy.dialogue.joke.creative.success/5": "Hehe, you're quite funny! Have you ever considered being a comedian, maybe?",
  "shy.dialogue.joke.creative.success/6": "H-Hehe! That joke was really good! I haven't laughed like this in ages!",
  "shy.dialogue.joke.creative.success/7": "Teehee! You're definitely funnier than Ash, I think... but don't tell anyone I said that!",
  "shy.dialogue.joke.creative.success/8": "Ahaha! That's actually quite funny, I must admit!",
  "shy.dialogue.joke.creative.failed/1": "Oh... Um, I don't really find that funny.",
  "shy.dialogue.joke.creative.failed/2": "Haha, well, I suppose that's... amusing, in a way.",
  "shy.dialogue.joke.creative.failed/3": "Um, did you just try to make a joke? Sorry, I didn't quite get it.",
  "shy.dialogue.joke.creative.failed/4": "Oh, that's... um, interesting. I guess?",
  "shy.dialogue.joke.creative.failed/5": "I'm not really good with jokes, but that's... kind of funny, I suppose.",
  "shy.dialogue.joke.creative.failed/6": "Haha, wow, you're quite the comedian, aren't you? (nervous chuckle)",
  "shy.dialogue.joke.creative.failed/7": "Ash, um, he's quite the joker. I'm sure he'd appreciate that joke more than I did.",
  "shy.dialogue.joke.creative.failed/8": "Um, well, Ash tends to come up with more amusing jokes, you know...",

  "shy.dialogue.procreate_engaged/1": "Um, I'm, uh, really hoping we can take things slow before starting a family. You know, like, maybe get to know each other better first?",
  "shy.dialogue.procreate_engaged/2": "Oh, I, um, I don't think it would be right to bring a new life into this world without us being, um, completely devoted to each other. Can we, like, maybe wait until we're fully committed?",

  "shy.dialogue.shake_hand.success/1": "Oh, um, your grip... it's quite nice.",
  "shy.dialogue.shake_hand.success/2": "Your grip... it's... strong, I guess. Impressive.",
  "shy.dialogue.shake_hand.success/3": "Um, wow, you're really polite, aren't you?",
  "shy.dialogue.shake_hand.success/4": "H-Hello... good day to you.",
  "shy.dialogue.shake_hand.success/5": "Oh, h-hello there... um, why hello, I mean.",
  "shy.dialogue.shake_hand.fail/1": "Oh... um, I don't think I can... sorry.",
  "shy.dialogue.shake_hand.fail/2": "No, no, it's fine, I'll just... erm, keep my hands to myself.",
  "shy.dialogue.shake_hand.fail/3": "Oh, I-I don't think I'm comfortable with that... sorry, really.",
  "shy.dialogue.shake_hand.fail/4": "Oh, me? Shaking hands? Haha, not my thing, sorry.",
  "shy.dialogue.shake_hand.fail/5": "Oh gosh, please, I really can't... um, go away. I'm really sorry.",

  "shy.dialogue.main.morning/1": "Oh… hi..",
  "shy.dialogue.main.morning/2": "Huh… are… are you talking to me?",
  "shy.dialogue.main.morning/3": "... it's a nice day… in my opinion at least.",
  "shy.dialogue.main.morning/5": "C-... could you repeat?.",
  "shy.dialogue.main.morning/6": "Oh… g-good morning.",
  "shy.dialogue.main.morning/7": "Um, h-hi there. D-did, um, d-did you have a restful night?",
  "shy.dialogue.main.morning/8": "M-Morning... I-I hope you... uh, slept w-well.",
  "shy.dialogue.main.morning/9": "Oh, um, g-good morning. It's, um, quite a n-nice day, isn't it? I-I hope it's p-productive for... for you.",
  "shy.dialogue.main.morning/10": "I-I think I'll, um, maybe t-take it slow t-today. I-I'm not quite... feeling my b-best.",
  "shy.dialogue.main.morning/11": "Oh, um, today is going to be... um, quite busy for me. I-I'm already feeling a bit... t-tired just thinking about it.",
  "shy.dialogue.main.morning/12": "H-hey, um, I surprisingly had a d-decent night's sleep. I-I might, um, consider doing something... um, a bit more challenging today. Maybe... I don't know.",
  "shy.dialogue.main.evening/1": "*Doesn't seem to quite notice you're there.*",
  "shy.dialogue.main.evening/2": "I like evenings. It's so… peaceful…",
  "shy.dialogue.main.evening/3": "I really love the quiet.",
  "shy.dialogue.main.evening/4": "I-I'm sorry if I didn't talk much earlier during the day. Talking makes me feel nervous.",
  "shy.dialogue.main.evening/5": "My…! I-I'm sorry, I didn't realize you were there!",
  "shy.dialogue.main.evening/6": "*... yes?",
  "shy.dialogue.main.evening/7": "Um, I was thinking of maybe, um, taking a little rest soon. The morning was a bit, um, tiring for me.",
  "shy.dialogue.main.evening/8": "Um, I'm considering going back to my house now, um, because in the past, I, uh, encountered a creeper during the nighttime. So, um, I prefer not to, um, wander around after dark anymore.",
  "shy.dialogue.main.evening/9": "Oh, um, hi there! I was just, um, getting some ingredients for dinner from the butcher. I'll, um, catch up with you later, okay?",
  "shy.dialogue.main.night/1": "... can't we talk tomorrow? I'm really tired…",
  "shy.dialogue.main.night/2": "Um… I'm sorry, but it's very late...",
  "shy.dialogue.main.night/3": "Sh-shouldn't you be in bed, too? I-I'm sure even adventurers like you need to sleep, right?",
  "shy.dialogue.main.night/4": "I'm sorry, I'm even worse at talking when it's so late at night…",
  "shy.dialogue.main.night/5": "Please, let's talk at some other time.",
  "shy.dialogue.main.night/6": "... p-please be quick if you have to talk to me so late…",
  "shy.dialogue.main.night/7": "Um, um, it's, um, kinda nice, you know, to, um, go for a little walk when, um, the stars are out. It's, um, not as crowded as, um, the day time, you know?",
  "shy.dialogue.main.night/8": "Oh, um, I'm, um, feeling quite tired, to be honest. I mean, it's been, um, such a long day, um, I might just, um, take it a little easier, um, tomorrow, you know?",
  "shy.dialogue.main.night/9": "Oh, um, I'm really looking forward, um, to, um, snuggling, um, underneath the covers. It's, um, so comforting and, um, cozy, you know?",
  "shy.dialogue.main.night/10": "Um, you, um, might want to, um, think about, um, going to sleep, you know? I, um, heard you have a lot, um, on your plate tomorrow. It's, um, important to, um, rest and, um, prioritize your, um, well-being.",

  "shy.dialogue.greet.mayor/1": "Um... Good day, mayor!",
  "shy.dialogue.greet.mayor/2": "Oh, uh... Have a, um, good one, Mayor!",
  "shy.dialogue.greet.monarch/1": "Oh... um, Your Majesty.",
  "shy.dialogue.greet.monarch/2": "Um... Your Highness.",

  "shy.dialogue.busy/1": "Oh, um, we've chatted quite a bit today, and, uh, I really should, um, get back to work.",
  "shy.dialogue.busy/2": "Oh, wow, thank you for wanting to talk, but, um, I really need to, um, finish this work before evening.",
  "shy.dialogue.busy/3": "Um, sorry, I'm a bit, um, busy at the moment. Would it be, um, okay if we, um, chatted later?",
  "shy.dialogue.busy/4": "Apologies, but I really, uh, have to focus on my work right now. I'll, um, catch up with you later.",
  "shy.dialogue.busy/5": "Oh no, I, um, completely forgot about the furnace! I really, um, must go attend to it. Let's, um, chat later, alright?",
  "shy.dialogue.goaway/1": "Um, sorry, could you please go away?",
  "shy.dialogue.goaway/2": "Oh, um, I was just hoping you had something else to do?",
  "shy.dialogue.goaway/3": "Ah, excuse me, %1$s, I'm unable to chat at the moment.",
  "shy.dialogue.goaway/4": "Oh, um, maybe you could bother someone else instead?",
  "shy.dialogue.goaway/5": "Oh dear, it would be really great if you could, um, go away, kind soul.",

  "shy.dialogue.greet/1": "Hi... How... How are you doing today?",
  "shy.dialogue.greet/2": "Hey there, um... How's it going?",
  "shy.dialogue.greet/3": "Oh, um... Hello. Did... Did you need something?",
  "shy.dialogue.greet/4": "Oh, hi... You... You look ready to take on the day! How... How's it going?",
  "shy.dialogue.greet/5": "Hi, um... %1$s! I... It's good to see you!",
  "shy.dialogue.greet/6": "H-Hello there...",
  "shy.dialogue.greet/7": "Um, nice to see you...",
  "shy.dialogue.greet/8": "Hi! It's, um... lovely to see you. How... How are you today?",
  "shy.dialogue.greet/9": "Hey! I... I'm glad to see you!",

  "shy.dialogue.greet.negative/1": "Um... hi. I, uh, wasn't really expecting to see you right now.",
  "shy.dialogue.greet.negative/2": "Oh, um... hey. You're, um, back... again.",
  "shy.dialogue.greet.negative/3": "Oh, um... hi there. I, uh, wasn't really prepared for your presence.",
  "shy.dialogue.greet.negative/4": "Oh, it's, um, you. I thought someone else would be here. But, um, hi.",
  "shy.dialogue.greet.negative/5": "Oh, um... hi. Did you, um, come here to... bother me again?",

  "shy.dialogue.greet.success/1": "Oh, um, that's... good. I'm glad to hear.",
  "shy.dialogue.greet.success/2": "Um, are you... doing good? Oh, that's... great!",
  "shy.dialogue.greet.success/3": "Oh, um, I'm... happy to hear it!",
  "shy.dialogue.greet.success/4": "Uh, so glad to hear that! That's... really nice.",
  "shy.dialogue.greet.success/5": "Oh, um, it's... good to know it!",
  "shy.dialogue.greet.fail/1": "Oh... um...",
  "shy.dialogue.greet.fail/2": "It's, uh, nice to see you...",
  "shy.dialogue.greet.fail/3": "Uh, alright then...",
  "shy.dialogue.greet.fail/4": "Seriously? Oh wow...",
  "shy.dialogue.greet.fail/5": "Oh... I see...",

  "shy.dialogue.apologize.success/1": "Oh... um, it's fine. Mistakes happen... I guess.",
  "shy.dialogue.apologize.success/2": "It's... it's okay. Just... um, watch yourself next time, please.",
  "shy.dialogue.apologize.success/3": "I-I guess that's okay. Just... um, be careful... if you want to, that is.",
  "shy.dialogue.apologize.success/4": "Oh, um, no problem. Everyone... um, makes mistakes, right?",
  "shy.dialogue.apologize.success/5": "Yeah, it's... it's fine, I suppose. Don't... um, worry too much about it.",
  "shy.dialogue.apologize.fail/1": "Um, could you please.. um.. go away?",
  "shy.dialogue.apologize.fail/2": "Oh, um, I think you.. um.. accidentally hit me.. um.. on purpose?",
  "shy.dialogue.apologize.fail/3": "Um, I... um.. highly doubt that I would... um.. fall for that one, sorry.",
  "shy.dialogue.apologize.fail/4": "Ouch! Um, it's okay.. um.. don't worry about apologizing, really.",
  "shy.dialogue.apologize.fail/5": "Um, yeah.. um.. there's, like, no way I would.. um.. believe that, sorry.",

  "shy.dialogue.location.failed/1": "Um, I'm really sorry, but I haven't heard anything new, like at all.",
  "shy.dialogue.location.failed/2": "Oh, I'm really shy and I apologize, but I don't know of any interesting places that you might be looking for.",
  "shy.dialogue.location.failed/3": "Oh, I'm sorry, but I don't think I can help. We villagers have our own little world to tend to, and we're not really into venturing out into dangerous ruins like you brave adventurers.",
  "shy.dialogue.location.forgot/1": "Oh, I stumbled upon this amazing location, but I guess it slipped my mind to mark it on the map. My apologies.",
  "shy.dialogue.location.forgot/2": "Seeking something captivating, huh? Well, there was indeed an awe-inspiring place... oh, how frustrating! It eludes me at the moment. I should have documented it, but I suppose my memory is just too extraordinary for such mundane details.",
  "shy.dialogue.location.forgot/3": "Ah, yes! There was a place of great significance, but alas, it momentarily escaped my brilliantly superior intellect. My apologies for not meeting your expectations.",
  "shy.dialogue.location.igloo/1": "Oh, um, excuse me, but I, uh, stumbled upon an igloo at %2$s. Can you believe someone would actually want to live in a house made of snow? It's, um, quite chilly, don't you think? Brrr!",
  "shy.dialogue.location.igloo/2": "Um, well, if you're interested, I, uh, happened to notice an abandoned igloo at %2$s. I don't, um, believe anyone lives there anymore. And, um, just between you and me, there might be something, uh, eerie about the place. I, uh, always hear these, um, strange noises whenever I, uh, walk by...",
  "shy.dialogue.location.igloo/3": "Oh, um, yes, yes, indeed! At %2$s, you'll find this, uh, abandoned house made entirely of ice. It's, um, an igloo, I believe. It seems to have been, um, abandoned for quite some time now.",
  "shy.dialogue.location.pyramid/1": "Oh um, excuse me, but I couldn't help but notice there's a pyramid over at %2$s...",
  "shy.dialogue.location.pyramid/2": "Um, so, I heard from some people that there might be a pyramid at %2$s... Maybe, um, there's something valuable inside?",
  "shy.dialogue.location.pyramid/3": "Um, if you, uh, happen to, um, go to %2$s, um, you might find a pyramid... Oh, there was this brave adventurer, just like you, who went there a while ago, but um, we haven't heard from them since. Please be careful.",
  "shy.dialogue.location.ruined_portal_desert/1": "Oh, um, pardon me, but I just, uh, wanted to mention that there's a, um, destroyed portal nearby at %2$s. It's rather, um, unfortunate, wouldn't you agree?",
  "shy.dialogue.location.ruined_portal_swamp/1": "Um, I don't mean to intrude, but, um, there seems to be a ruined portal in the middle of the swamp, at %2$s to be exact. The, um, Nether invaders probably didn't imagine they'd find themselves in such an, uh, undesirable spot.",
  "shy.dialogue.location.ruined_portal/1": "Um, so, um, there's like this really, um, destroyed portal at %2$s. It's, um, the result of, um, a Nether invasion.",
  "shy.dialogue.location.ruined_portal/2": "Oh, um, hey! If you, um, go to %2$s, you might, um, come across a ruined nether portal. It's, um, kind of, um, creepy in a way, but, um, it should be safe. Just, um, be careful not to, um, step on any magma, okay?",
  "shy.dialogue.location.ruined_portal/3": "Well, um, if you, um, happen to visit %2$s, there are, um, these ancient ruins. The local cleric, um, mentioned that it used to be a nether portal. Some, um, people even say there might be, um, treasure, but, um, nobody is, um, brave enough to, um, venture near that place.",
  "shy.dialogue.location.ruined_portal_mountain/1": "Oh, um, excuse me, but there seems to be a, um, ruined portal over by %2$s in the mountains.",
  "shy.dialogue.location.mansion/1": "Um, um, if… uh, if you, um, happen to go to %2$s, um, there's, uh, a mansion there. It's, um, owned by, uh, those creepy illagers. Oh, uh, please, uh, stay away from that dreadful place if you, um, cherish your life, um, please.",
  "shy.dialogue.location.mansion/2": "Oh, um, there's this, um, gigantic mansion, um, located at %2$s. Um, the illagers, um, they, uh, own it. Um, I-I-I don't know, um, maybe we, um, should consider, uh, relocating the village, um, somewhere, um, far, far away from, um, here. You know, um, just a thought, um, perhaps…",
  "shy.dialogue.location.monument/1": "Um, um... I-I heard whispers about a sunken castle guarded by, um, sea monsters at %2$s. Y-you probably shouldn't go near it, just to be safe.",
  "shy.dialogue.location.monument/2": "Oh, um, there have been stories about ancient ruins hidden deep in the ocean at %2$s. It's, uh, possible that you might find some treasure there, but, um, it's quite perilous.",
  "shy.dialogue.location.shipwreck/1": "Um, excuse me... I-I happened to come across a sunken ship... It's at %2$s, if you're interested. Oh, um, b-by the way, those sunken ships, they were, um, owned by the Eastern Alliance Company, if that matters...",
  "shy.dialogue.location.shipwreck/2": "You know, um, there have been some rumors going around about a shipwreck at %2$s. It's, um, quite exciting actually... I mean, I'm not saying there's treasure or anything, but who knows, right?",
  "shy.dialogue.location.shipwreck_beached/1": "Um, there's, uh, this, um, old ship that, um, sort of washed ashore at %2$s. You might, um, see it if you, um, look around.",
  "shy.dialogue.location.shipwreck_beached/2": "H-hey, so, um, if you could, like, go to %2$s, um, there's this, um, ship that, um, got all wrecked, you know, on the beach. I-I'm just, um, curious as to how it, you know, got there...",
  "shy.dialogue.location.village_desert/1": "Oh, um, there's, um, this really, um, quaint village over at, uh, %2$s. It, uh, it's in the, um, middle of the desert and, uh, it's, um, really lovely.",
  "shy.dialogue.location.village_taiga/1": "Um, well, um, y-you see, at %2$s, there's, um, another village, um, nestled quietly in the, um, vast taiga biome. It's, um, quite lovely, I think.",
  "shy.dialogue.location.village_taiga/2": "Oh, um, if, um, you go to %2$s, you might just, um, stumble upon, um, another village. It's, um, deep within the, um, enchanting taiga biome. I, um, think it's quite, um, memorable.",
  "shy.dialogue.location.village_snowy/1": "Over yonder, at %2$s, lies the village. It's quite chilly, you see.",
  "shy.dialogue.location.village_snowy/2": "Ah, if you venture to %2$s in the snowy plains, you'll stumble upon another village. The folks there are sweet, but oh my, the cold is unbearable!",
  "shy.dialogue.location.village_plains/1": "Um, i-if you go... um... over there, at %2$s, you might notice another village. It's... um... quite lovely.",
  "shy.dialogue.location.village_plains/2": "If you d-dare venture deep into the plain at %2$s, you might stumble upon another village. H-honestly, it's quite charming, in its own way.",
  "shy.dialogue.location.village_savanna/1": "Um, um, over there... in the, um, *blushes* savanna, there's, um, another village. It's, um, really, um, hot there, you know?",
  "shy.dialogue.location.village_savanna/2": "Oh, in the, um, savanna at %2$s, there's this, um, another village. And, um, they have, like, really nice people! Yeah, um, very, um, friendly, I guess.",
  "shy.dialogue.location.swamp_hut/1": "Um, so, uh, there's this, um, witch...yeah, she's, um, living in the swamp at %2$s. I mean, if you're, um, looking for advice, I'd, um, suggest, um, avoiding that place.",
  "shy.dialogue.location.swamp_hut/2": "Oh, um, hey there! Um, so, if, um, I were you, I would, um, totally avoid, um, going anywhere near %2$s. There's, um, this, uh, really creepy hut and, um, it's, um, owned by that, um, very unfriendly witch. Trust me, um, you don't want, um, any part of it.",
  "shy.dialogue.location.mineshaft/1": "Um, well, there was a mine here before... but, um, something bad happened and, um, it had to be closed. It should, um, still be around %2$s though.",
  "shy.dialogue.location.mineshaft/2": "Oh, um, yes. There was this mine, um, right over there at %2$s. But, um, it's not really safe anymore. It got, um, taken over by monsters and, um, it's pretty dangerous. So, um, please be really careful if you, um, decide to go down there.",
  "shy.dialogue.location.jungle_pyramid/1": "Um, you know, um, there's this, um, really old place in the jungle. It's at %2$s, um, and you probably, um, shouldn't go there. Like, seriously, it's super dangerous. Those traps are, um, still active, you know?",
  "shy.dialogue.location.jungle_pyramid/2": "Oh, hey, um, have you, um, heard about the, um, ancient ruins in the jungle? Yeah, they're, um, at %2$s. I mean, I'm not saying you should go, but, um, you should be really, um, cautious if you do. Those traps, um, they're still, um, fully operational. It's, um, pretty unbelievable, right? I mean, if they weren't, our ancestors would've, um, cleared the place out ages ago.",
  "shy.dialogue.location.pillager_outpost/1": "Um, excuse me, but I just wanted to let you know that, um, there's a group of Pillagers at %2$s. They, um, set up an outpost right next to us. It's, um, quite bothersome, you know. I really hope they don't, um, attack us again. We, um, can't handle another attack, you know.",
  "shy.dialogue.location.pillager_outpost/2": "Oh, um, there's this outpost, you see, it's owned by pillagers at %2$s. And, um, they don't let us sleep at night. Like, seriously, it's so scary! So, um, if you happen to go anywhere near there, please, um, be extremely careful. They, um, shoot on sight, you know.",
  "shy.dialogue.location.pillager_outpost/3": "Well... um, if you, uh, happen to head over to %2$s, you might, um, stumble upon an outpost. And, uh, guess what? It's owned by those nasty pillagers. But, um, if you're really brave and, uh, capable, maybe you could, um, defeat them and, uh, find some valuable loot. You know, the whole village would be, uh, eternally grateful if someone, um, took care of them.",
  "shy.dialogue.location.ancient_city/0": "Um, excuse me, but I, um, couldn't help but hear some, uh, strange sounds coming from, uh, down below at %2$s.",
  "shy.dialogue.location.ancient_city/1": "Oh, um, I have this feeling that, um, there might be something, um, hidden really, um, deep beneath the surface at %2$s.",
  "shy.dialogue.location.ancient_city/3": "You know, there are these, um, legends that, uh, speak of an ancient city, um, located at %2$s. I haven't, um, seen anything myself, but maybe it's, um, underground or something?",

  "shy.dialogue.joke.monster.success/1": "Oh, um... that Skelly got what it deserved, I guess.",
  "shy.dialogue.joke.monster.success/2": "Oh my, that zombie actually attempted to attack you with a shovel? Hehehe...",
  "shy.dialogue.joke.monster.success/3": "You, um, showed that spider who's in charge. Heh...",
  "shy.dialogue.joke.monster.success/4": "Um, it's quite impressive that you managed to get a skeleton to defeat a creeper! Haha, incredible!",
  "shy.dialogue.joke.monster.success/5": "Oh dear, cave spiders can be quite... unintelligent, huh? Hehe.",
  "shy.dialogue.joke.monster.failed/1": "Um, excuse me, but skeletons, like, have feelings too, you know? It's not cool to make fun of them.",
  "shy.dialogue.joke.monster.failed/2": "Oh, um, who would even think about, like, making a joke about creepers exploding? That's, like, so not funny.",
  "shy.dialogue.joke.monster.failed/3": "I, um, I just wanted to remind you that zombies and skeletons were once humans, just like, you know, us. It's kinda sad, really.",
  "shy.dialogue.joke.monster.failed/4": "Oh, gosh, um, did you see that enderman falling into water? It's, like, the most uneventful thing ever. So not exciting.",
  "shy.dialogue.joke.monster.failed/5": "Oh, um, I don't mean to be a bother, but it's kinda odd how people keep joking about silverfish attacking them on the toilet. I mean, it's not that funny, right?",

  "shy.dialogue.joke.animal.success/1": "Poor little sheep, losing its wool like that... It's kind of funny, but I feel bad for it!",
  "shy.dialogue.joke.animal.success/2": "Um, well... there was this wolf, and, um, it sort of... fell in love with a sheep. Pretty crazy, right?",
  "shy.dialogue.joke.animal.success/3": "Oh gosh, I can't help but giggle! Who knew chickens had such hidden talents?",
  "shy.dialogue.joke.animal.success/4": "That's... um... silly! I mean, in a good way! It's so dumb it's actually kind of hilarious, hehe.",
  "shy.dialogue.joke.animal.success/5": "Isn't it amazing? Cows produce milk endlessly, like an everlasting supply! It's like magic! Um, well, not really, but you get what I mean...",
  "shy.dialogue.joke.animal.failed/1": "Oh, um, please... let's not make jokes about that, it's not really my thing.",
  "shy.dialogue.joke.animal.failed/2": "Oh, gosh! That sheep... it's just not something I find amusing, you know?",
  "shy.dialogue.joke.animal.failed/3": "Um, excuse me, but I'd rather not talk about my pig in such a joking manner, if that's alright.",
  "shy.dialogue.joke.animal.failed/4": "Oh, goodness, that's a bit, uh, uncalled for, don't you think? Let's not go there, shall we?",
  "shy.dialogue.joke.animal.failed/5": "Um, I'd prefer it if we didn't make jokes about the cow's eyebrows like that, it's a sensitive topic for me.",

  "shy.dialogue.flirt.slap/1": "Oh, um, sorry if I'm bothering you...",
  "shy.dialogue.flirt.slap/2": "I-I hope this isn't too forward, but... um, did someone teach you how to flirt? It's just... interesting...",
  "shy.dialogue.kiss.slap/1": "Oh, um, I, uh, I... I can't believe you did that!",
  "shy.dialogue.kiss.slap/2": "Please don't do that again, I-I'm really not comfortable with it, and it... it really upsets me...",

  "shy.dialogue.chat.plains/1": "Um... Do you... um... like the plains? I mean, I've never really been anywhere else, but I guess they're... um... okay?",
  "shy.dialogue.chat.plains/2": "The plains... um... they're so peaceful, you know? Not as... um... exciting as other biomes, but... um... I wouldn't want to live anywhere else, I guess.",
  "shy.dialogue.chat.plains/3": "Sometimes... um... at night, the plains biome can be... um... really beautiful. I like... um... looking at it and... um... listening to it.",
  "shy.dialogue.chat.plains/4": "Oh, sometimes I... um... just lie down and... um... look at the sky and the clouds. It's... um... really soothing, you know?",
  "shy.dialogue.chat.plains/5": "The air here... um... it's so clean and fresh! Maybe even... um... better than the taiga, I think.",
  "shy.dialogue.chat.plains/6": "Even though the plains are... um... plain, there's something... um... nice about simplicity, you know? Sometimes... um... plain and simple is the best.",
  "shy.dialogue.chat.plains/7": "This weather... um... it reminds me of when I used to... um... pick wild flowers as a child. I... um... had a crush on Ash, so... um... I always gave him flowers.",
  "shy.dialogue.chat.plains/8": "The morning sunrise... um... it's really pretty in the plains! You should... um... try observing it sometime. It's... um... quite lovely, really.",
  "shy.dialogue.chat.savanna/1": "Oh, um, the savanna can get quite warm, but I suppose it's not too bad since we don't have to deal with winter.",
  "shy.dialogue.chat.savanna/2": "The llamas, well, they can be a little bothersome at times, but I find some enjoyment in living here.",
  "shy.dialogue.chat.savanna/3": "Um, the architecture in the savanna is actually quite fascinating. It's, um, one of the reasons I decided to make this place my home.",
  "shy.dialogue.chat.savanna/4": "Oh, please don't underestimate the savanna biome. It may seem plain and ordinary, but, um, there are some advantages to it, I promise.",
  "shy.dialogue.chat.savanna/5": "Um, one thing we have here that the desert villages don't is, even though it doesn't rain, we do have rivers. It's quite nice, actually.",
  "shy.dialogue.chat.savanna/6": "Oh, the hills and terrains here, they're, um, quite intriguing, I must say. Such a, um, lovely sight to behold.",
  "shy.dialogue.chat.savanna/7": "When it gets hot, the acacia trees provide so much shade, which, um, helps me get through my work days. It's a, um, small comfort.",
  "shy.dialogue.chat.savanna/8": "The savanna villages, oh, they often have some of the, um, finest melons and pumpkins in the world. We, um, trade them with other villages, you know.",
  "shy.dialogue.chat.taiga/1": "The woods... um, they actually provide... um, building material... and... um, firewood. Oh, and they're... um, great for hunting, I guess.",
  "shy.dialogue.chat.taiga/2": "Some people say it's... um, cold in the taiga, but... um, personally, I think we have... um, everything we need here. I wouldn't... um, change it for anything... I think.",
  "shy.dialogue.chat.taiga/3": "Taiga forests are... um, quite cool, I suppose. And... um, the sweet berries are nice, too.",
  "shy.dialogue.chat.taiga/4": "Oh, um, I really... um, adore the foxes here in the taiga forests. I sometimes... um, feed them sweet berries. They're... um, quite mischievous little creatures.",
  "shy.dialogue.chat.taiga/5": "Well, since there's... um, plenty of food here, the wolves are... um, pretty tame with us. It's... um, nice, I suppose.",
  "shy.dialogue.chat.taiga/6": "The fresh... um, crisp air in the taiga is... um, quite relaxing, I suppose. Sometimes.",
  "shy.dialogue.chat.taiga/7": "Um, well... the sweet berry bushes... um, they have the best berries, but... um, getting pricked by one is... um, awful! Really!",
  "shy.dialogue.chat.taiga/8": "The rain here in the taiga... um, gets pretty cold, but... um, it's very... um, peaceful, I suppose.",
  "shy.dialogue.chat.snowy_plains/1": "Um, it's quite chilly here, and um, if we have enough firewood, I guess it won't be too much of an issue for me.",
  "shy.dialogue.chat.snowy_plains/2": "Oh my, it's absolutely freezing out here, but um, luckily there's lots of fish. Hehe, sorry, that was a nervous laugh.",
  "shy.dialogue.chat.snowy_plains/3": "Oh, well, in weather like this, I-I prefer to just curl up with a blanket and, um, read a book by the furnace. It's, um, cozy, you know?",
  "shy.dialogue.chat.snowy_plains/4": "Um, w-when it snows here, it sort of reminds me of my childhood, you know, when me and a few friends would have, uh, snowball fights. Ah, those were, um, nice times, I guess.",
  "shy.dialogue.chat.snowy_plains/5": "Um, at night, the strays can be, uh, quite bothersome when you're walking around the village. Tipped arrows, um, they're not the best, you know?",
  "shy.dialogue.chat.snowy_plains/6": "Oh, please be careful of the wolves, um, the guards have seen some around here. They can be, um, quite dangerous, you know?",
  "shy.dialogue.chat.snowy_plains/7": "One thing that I find, um, quite unpleasant is when you accidentally touch an iron golem. You get, um, stuck there for the whole day! It's, uh, not the best experience, trust me.",
  "shy.dialogue.chat.snowy_plains/8": "Oh, when I was a child, my parents used to bring me a pumpkin, and, um, we would use it for pie. But before that, I would always build snow golems with them. It was, uh, a lot of fun, I suppose.",
  "shy.dialogue.chat.desert/1": "Oh, um, it's quite warm here in the desert, but at least we never have to worry about, um, the winter.",
  "shy.dialogue.chat.desert/2": "The desert is, um, warm all year round, if you're into that sort of thing.",
  "shy.dialogue.chat.desert/3": "Oh, um, even though it's, um, hot here in the desert, I'll always have, um, a tan, or maybe even a sunburn...",
  "shy.dialogue.chat.desert/4": "At night, um, it's very, um, scenic and cooler, um, which can be quite, um, nice to, um, look at the stars.",
  "shy.dialogue.chat.desert/5": "Oh, gosh! I, um, never thought I'd say this, but the sun is, um, pretty bad today.",
  "shy.dialogue.chat.desert/6": "Oh, gosh! The sun is, um, pretty bad today, don't you think?",
  "shy.dialogue.chat.desert/7": "Um, excuse me, but have you, um, found any rabbits? They're, um, hard to see here!",
  "shy.dialogue.chat.desert/8": "Oh, um, one downside about living here are the husks. No matter, um, what, you get, um, super hungry when they, um, smack you! What, um, gives!?",
  "shy.dialogue.chat.desert/9": "Oh, um, pricked myself on a cactus the other day. You, um, gotta mind your step around here, it's, um, quite dangerous!",
  "shy.dialogue.chat.desert/10": "Life in the, um, dry desert is not, um, easy, but at least we have this, um, village where we can, um, get water and food. It's, um, quite helpful, really.",

  "shy.dialogue.story.exploring.success/1": "Oh, um, I mean... It would be nice to explore the world someday, I guess.",
  "shy.dialogue.story.exploring.success/2": "Um, it's, um, really impressive that you have the courage to, um, travel and explore. I, um, love my village, and my family and friends are, um, really important to me, but, um, hearing about your adventures really makes me, um, a little envious, I suppose.",
  "shy.dialogue.story.exploring.success/3": "Oh, wow, um, you're, um, so courageous to, um, venture into the unknown like that. I, um, admire your bravery, really.",
  "shy.dialogue.story.exploring.fail/1": "Um, I-I'm sorry, but I've heard those stories before... a lot.",
  "shy.dialogue.story.exploring.fail/2": "Oh, um, please don't take this the wrong way, but, uh, maybe we could find some new stories to share? I mean, if that's okay with you...",
  "shy.dialogue.story.exploring.fail/3": "Um, well, um, talking to you is like, um, talking to someone who's, um, trying to figure out who they want to be, you know? But, um, without the, uh, cute part, I guess.",

  "shy.dialogue.story.nether.success/1": "U-Um, excuse me, but is it, um, really hot in the Nether?",
  "shy.dialogue.story.nether.success/2": "Oh, wow! I can't believe you've, um, survived in such a, um, dangerous place. That's really impressive!",
  "shy.dialogue.story.nether.success/3": "Um, h-have you, um, ever heard about the, um, treasures in the Nether? I-I wish I could, um, find the courage to go there and, um, explore…",
  "shy.dialogue.story.nether.success/4": "Um, you must be, um, really brave to, um, venture into the Nether. A-Aren't you, um, scared? Oh, um, not that I would be scared or anything…",
  "shy.dialogue.story.nether.success/5": "E-Excuse me, um, have you ever, um, seen a Zombified Piglin?",
  "shy.dialogue.story.nether.fail/1": "Um, I'm not entirely certain, but I don't believe you've ever, um, ventured into the Nether, you know?",
  "shy.dialogue.story.nether.fail/2": "Oh, um, now I finally understand why those, uh, Piglins reacted so negatively towards you. I mean, um...",
  "shy.dialogue.story.nether.fail/3": "Excuse me, but I really, um, don't mind whether you've actually been to the Nether or not. It's just that, um, your storytelling skills are not exactly... exceptional, shall we say?",
  "shy.dialogue.story.nether.fail/4": "Oh, gosh, you, uh, don't really appear to possess the necessary, um, physical strength to withstand the challenges of the Nether, you see?",
  "shy.dialogue.story.nether.fail/5": "Um, well, my, um, grandfather used to explore the Nether as well, and, um, he never mentioned anything about that peculiar warped fungus. So, um, you must be, um, stretching the truth a bit there, sorry to say.",

  "shy.dialogue.story.enderdragon.success/1": "Oh, um... Did you, by any chance, happen to... uh... bring the dragon egg along with you?",
  "shy.dialogue.story.enderdragon.success/2": "Oh dear! You've actually managed to defeat the fearsome, legendary dragon?! The village will whisper your heroic tale with awe for years to come!",
  "shy.dialogue.story.enderdragon.fail/1": "Oh, um... I-I don't mean to sound rude, but, uh, the ender dragon, it's, um, kind of... not real, you know?",
  "shy.dialogue.story.enderdragon.fail/2": "Oh, goodness gracious! Um, y-you wouldn't believe it, but the ender dragon is, like, super, super impossible to defeat. Like, seriously!",

  "shy.dialogue.story.wither.success/1": "Oh my goodness! I-I can't believe it! The Wither is known for causing absolute chaos!",
  "shy.dialogue.story.wither.success/2": "W-Wow! Y-You actually managed to defeat the Wither? That's absolutely amazing!",
  "shy.dialogue.story.wither.fail/1": "Um, I'm not really convinced by what you're saying.",
  "shy.dialogue.story.wither.fail/2": "Oh, you... you seem so intact for that to actually be true.",

  "shy.dialogue.stay.fail/1": "Oh, um, no, thank you. I-I'm not really into staying in one place, you know?",
  "shy.dialogue.stay.fail/2": "Oh, th-thank you for asking, but I-I'm more comfortable exploring, if that's okay...",
  "shy.dialogue.stay.fail/3": "Um, well, this village seems lovely, but I-I'm more of a wanderer, you see...",
  "shy.dialogue.stay.repeat/1": "Oh, um, sorry, but you've asked me this question before.",
  "shy.dialogue.stay.repeat/2": "Um, sorry, but I think you've already asked me that.",
  "shy.dialogue.stay.success/1": "Oh, um, thank you... I-I would really, um, enjoy staying in this village.",
  "shy.dialogue.stay.success/2": "Oh wow, um, I... I'd absolutely love to stay in this village! It's, uh, amazing!",
  "shy.dialogue.stay.no_space/1": "Um, gosh, this village is, uh, quite packed, isn't it?",
  "shy.dialogue.stay.no_space/2": "Oh, um, I-I kind of wanted to stay, but, er, it seems there's no room for me. You know, all the beds are taken...",

  "shy.dialogue.hire/1": "Um, if you need any assistance, um, I'll, um, be right here. Just, um, let me know. I, um, hope I can help, you know... for the, um, agreed upon time and... um, compensation.",
  "shy.dialogue.hire/2": "Oh, uh, hi! If, uh, you ever need any help, I'll, um, gladly be here. Just, uh, give me a sign or something. I mean, if you, uh, have the emeralds ready, of course.",
  "shy.dialogue.hire/3": "Uh, hey there! I, uh, heard you might need some help. Well, um, I'm here, willing to, uh, assist. Just, uh, notify me when the time is right and, uh, you've got the emeralds for me. I'll do my best, I promise.",
  "shy.dialogue.no_money/1": "Oh, um, sorry to bother, but it seems that, uh, you might need a few more emeralds to, um, hire me, you know?",
  "shy.dialogue.no_money/2": "Oh dear, I don't mean to be a bother, but it seems like you might need a few more emeralds to, um, you know, enlist my services.",
  "shy.dialogue.no_money/3": "Excuse me, um, I don't want to inconvenience you, but it appears that you might require a bit more in the way of emeralds if you, uh, desire my assistance.",

  "shy.dialogue.main.rock_paper_scissor/1": "Um, if it's okay with you, would you maybe want to play a little game of Rock Paper Scissors? I mean, only if you want to, of course. It's just a suggestion.",
  "shy.dialogue.rock_paper_scissor/1": "U-Um, um... Rock, paper, scissors, shoot!",
  "shy.dialogue.rock_paper_scissor/2": "I-I really hope I can win this time...",
  "shy.dialogue.rock_paper_scissor.rock/1": "U-um, rock!",
  "shy.dialogue.rock_paper_scissor.paper/1": "*Nervously* P-Paper!",
  "shy.dialogue.rock_paper_scissor.scissor/1": "Oh, um... Scissor!",
  "shy.dialogue.rock_paper_scissor.loose.rock/1": "Oh... um, I picked paper! So, uh, I guess I won...",
  "shy.dialogue.rock_paper_scissor.loose.paper/1": "Oh, um, I think I'll choose rock this time, if that's okay with you.",
  "shy.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors met their unfortunate fate against the rock... and I emerged as the winner!",
  "shy.dialogue.rock_paper_scissor.win.rock/1": "Oh, um, it seems like rock, uh, defeats scissors... I-I lost.",
  "shy.dialogue.rock_paper_scissor.win.paper/1": "I'm always outmatched when I pick rock, it's like a curse.",
  "shy.dialogue.rock_paper_scissor.win.scissor/1": "Ah... scissors... they... they triumphed over paper... Well done, indeed.",
  "_": ""
}