{
  "key.everydesc.description": "Show Item Description",
  "everydesc.tooltip": "Press §a[%s§a]§r while holding to learn more!",

  "everydesc.credits": "credits",
  "everydesc.credits.bg": "minecraft/obsidian.png",

  "everydesc.minecraft:enderman": "§nEndermen §r\n\nThis dark, tall alien race seems to gurgle out human-like sounds and sentences every so often... How strange. Do §4NOT§r look them in the eyes.",
  "everydesc.minecraft:obsidian": "When at least 10 blocks of Obsidian are placed in a frame-like shape and the inside is lit with fire, a portal to another dimension is opened...",
  "everydesc.minecraft:obsidian.bg": "minecraft/obsidian.png",

  "everydesc.minecraft:ender_pearl": "§nEnder Pearl §r\n\nMarble-like pearls that can be throw to teleport you, dealing some damage in the process. I wonder if they could be used for interdimensional travel, given the right fuel source?",
  "everydesc.minecraft:ender_eye": "§nEye of Ender §r\n\nWhen thrown, the Eyes of Ender will seek out the long forgotten Strongholds. They have a chance to break when thrown, and 12 are required to finish what was started long ago, so be sure to stock up on them.",
  "everydesc.minecraft:blaze_powder": "§nBlaze Powder §r\n\nPut me in a brewing stand to let the potion making commence! In fact, you can use it again to create a potion of strength! You can also create fire charges, a one-use flint-and steel / dispenser projectile, create Eyes of Ender that can be used to locate the Stronghold, a structure to enter a new dimension, or even create magma cream with a slimeball!",

  "everydesc.minecraft:poisonous_potato": "§nPoisonous Potato §r\n\nA completely useless item which when eaten will §4poison §rthe player.",
  "everydesc.minecraft:powder_snow": "§nPowdered Snow §r\n\nMeet the infamous Snowier Snow! Walking on it makes you sink (caution: swimming not supported), and then slowly freeze to your death. Sounds super §mn§mice, doesn't it? But don't worry, it's quite a cool block! (Or hot? I don't know anymore.) Wearing a leather chesplate will make you hot enough to survive the cold, and leather boots make you able to walk on it without sinking an inch!",
  "everydesc.minecraft:nautilus_shell": "§nNautilus Shell §r\n\nPrized by fishermen and explorers alike, legends tell of an ancient power these shells can be used to unlock.",
  
  "everydesc.minecraft:heart_of_the_sea": "§nHeart of the Sea §r\n\nAn ancient relic hoarded by long-gone seafarers, this item beats with ancient power.. Perhaps it can be unlocked with another item prized by these seafarers?",
  "everydesc.minecraft:conduit": "§nConduit §r\n\nThe power contained within a conduit can only be activated when surrounded by a block found in the ancient sunken monuments. Legends claim it can be used to enhance the underwater capabilities of those around it, however it's unknown how true these rumours are..",
  "everydesc.minecraft:totem_of_undying": "§nTotem of Undying §r\n\nAn evoker would be a fool to do so much as get out of bed without one of these nearby, as these totems can save the user from imminent death so long as it's being held.. Only the unmatched power of the void can best this ability.",
  "everydesc.minecraft:amethyst_shard": "§nAmethyst Shard §r\n\nFound in geodes deep underground, this gem only grows from budding amethyst blocks. It's commonly used as a lens for Spyglasses, and stories tell of the wisp-like Allays being able to duplicate themselves by recieving one of these while music is being played nearby..",

  "everydesc.minecraft:pumpkin": "§nPumpkin §r\n\nThese large fruit can be baked into a delicious pie or even carved with shears! Legends are told of snow and iron blocks being brought to life by the power of a pumpkin.",
  "everydesc.minecraft:carved_pumpkin": "§nCarved Pumpkin §r\n\nBOO! This spookier version of the pumpkin can be worn on your head, giving you the confidence to make eye contact with the taller creatures of the night! Many people combine them with torches to create Jack o'Lanterns.",
  "everydesc.minecraft:jack_o_lantern": "§nJack o'Lantern §r\n\nA fantastic light source, legends tell of skeletons and zombies alike wearing these around the spookiest time of the year to protect themselves from the sun and join in on the festivities.",

  "everydesc.minecraft:echo_shard": "§nEcho Shard §r\n\nIt's said these were formed from the very souls of whoever used to be here, forever trying to reach the death-place of their owner.",
  "everydesc.minecraft:compass": "§nCompass §r\n\nInstead of pointing North, compasses are known for pointing towards the home of whoever holds them.",
  "everydesc.minecraft:lodestone": "§nLodestone §r\n\nLodestones have powerful magnetic properties, capable of binding compasses to one position.",

  "everydesc.minecraft:campfire": "§nCampfire §r\n\nPerfect for the on-the-go adventurer, Campfires act as both an excellent light source and a wonderful block for cooking food on, holding up to four items at once!",
  "everydesc.minecraft:hay_block": "§nHay Bale §r\n\nWhile an excellent compact block of food in its own right, Hay Bales can also be fed to equestrian mobs to heal them for 10 hearts. Additionally, placing a Bale beneath a campfire makes its rising smoke reach 24 blocks high, a big leap from the typical 10.",
  "everydesc.minecraft:bee_nest": "§nBee Nest §r\n\nHousing the honey-making bees, Bee Nests are the one and only source of honey, which can be bottled once it's leaking out! Bee warned, however, that doing so will anger any bugs inside unless a campfires stream of smoke is hitting the nest directly beneath it. Harvest the block with Silk Touch, lest you destroy it and release the beasts inside!",
  "everydesc.minecraft:bundle": "§nBundle §r\n\nOne of the greatest tools for the most unorganized adventurers, this deep pouch made out of hide is capable of holding multiple items, helpful in sorting inventories or storage!",
  "everydesc.minecraft:redstone": "§nRedstone §r\n\nCentralized in its uses of brewing and contraptions of scaling complexity, Redstone has the ability to transmit, generate current. Placing Redstone on the floor will form a wire, which can be connected to adjacent Redstone placements.",
  "everydesc.minecraft:map": "§nEmpty Map §r\n\nSoon to be an atlas of your overworld, this piece of paper is the key to begin mapping out landmarks, terrain, and bases. Right-click it to start filling it in!",
  "everydesc.minecraft:filled_map": "§nMap §r\n\nIt's time to get a lay of the land! Fill this in simply by exploring the places you wish to document while holding it, and mark down anything you find interesting by interacting with a banner. Various modifications to Maps can be made at §5Cartography Tables §, such as extending their area or duplicating them. Some are even enthusiastic enough about this trade to collect rare §5Locator Maps§. For the right price, you could even get your hands on one!",
  "everydesc.minecraft:bucket": "§nBucket §r\n\nAlthough its most obvious use is to store water, buckets can store so much more than that! Buckets can store lava and milk (after being milked out of a cow), and can even pick up small aquatic critters when filled with water! It's never a bad idea to carry a bucket around with you, no matter what you're up to.",
  "everydesc.minecraft:suspicious_stew": "§nSuspicious Stew §r\n\nIf you see this... strange substance in sunken ships, chug it instantly. It's like a box of chocolates, you never know what you're gonna get. You could even get blindness. Bon appétit!",
  "everydesc.minecraft:netherite_scrap": "§nNetherite Scrap §r\n\nHarvested from the deepest depths of the Nether, Netherite Scrap is the outcome of a processed §4Ancient Debris§r. When paired with gold, it is able to create one of the strongest materials possible.",
  "everydesc.minecraft:netherite_ingot": "§nNetherite Ingot §r\n\nA pure bar of the legendary alloy of Netherite. When concentrated gold is coated with Netherite Scrap, it creates a powerful alloy that is capable of upgrading Diamond equipment into an extremely powerful form. It's stylish, too!", 
  "everydesc.minecraft:respawn_anchor": "§nRespawn Anchor §r\n\nRespawn Anchors allow you to set your spawn in the §4Nether§r, and the consequences of attempting it elsewhere are similar to using beds in the wrong places. However, you need to charge it with Glowstone blocks if you want access to this unnatural power.",

  "everydesc.minecraft:debug_stick": "§nDebug Stick §r\n\nThe debug stick is a creative-only item, and is only able to be obtained via the /give command (/give @p debug_stick should do the trick!), much like command blocks, structure blocks, and any of their other related items. It is capable of manipulating different blocks, such as pistons, stairs, any waterloggable blocks, etc. and changing their forms. They, effectively, change the current 'state' they are in. Left click to cycle through the characteristic you want to change, right click to cycle through it's variants.",
  "everydesc.minecraft:knowledge_book": "§nKnowledge Book §r\n\nThis is an entirely useless item, unless you want to use it as some kind of icon, which is exactly it's ingame purpose (icon for the recipe book seen in your survival inventory) or in map making! By manipulating NBT data, you are able to use the knowledge book as a way to unlock specific recipes at certain times! To obtain, simply do /give @p knowledge_book.",
  "everydesc.minecraft:command_block_minecart": "§nCommand Block Minecart §r\n\nOne of minecraft's many minecart (or boat!) contained blocks. It is used exclusively in creative mode, and is capable of running any command! But, of course, it's in a minecart, so get creative!.",
  "everydesc.minecraft:command_block": "§nCommand Block §r\n\nCommand Blocks are the most powerful block in minecraft! But only obtainable in creative mode, thankfully. They're capable of sending any command, at any time! There are multiple variants, but this one is the 'base' variant, and does much simpler things, as far as command blocks are concerned.",
  "everydesc.minecraft:chain_command_block": "§nChain Command Block §r\n\nCommand Blocks are the most powerful block in minecraft! But only obtainable in creative mode, thankfully. They're capable of sending any command, at any time! There are multiple variants, but this one is the 'chain' variant, and is mostly used for sending long threads of commands, one after the other, like a chain!",
  "everydesc.minecraft:repeating_command_block": "§nRepeating Command Block §r\n\nCommand Blocks are the most powerful block in minecraft! But only obtainable in creative mode, thankfully. They're capable of sending any command, at any time! There are multiple variants, but this one is the 'repeating' variant, and is used to send one command multiple times!",
  "everydesc.minecraft:structure_void": "§nStructure Void §r\n\nStructure Voids are used while Structure Blocks, a block used for generation of structures, does it's thing. As the name suggests, they represent a 'void,' and when included in a structure, effectively tells the block, when generating, to leave this block unchanged. This means that when a structure is being generated, a structure void tells the block it obstructs to remain unchanged, whether it's a dirt block, bedrock block, or even air block. To obtain, type in /give @p structure_void.",
  "everydesc.minecraft:structure_block": "§nStructure Block §r\n\nStructure blocks are rather self-explanatory: they're blocks that place down and can save a structure when used! They are useful for adventure maps, datapacks, bugtesting, and even normal generation, making Structure Blocks extremely useful.",
  "everydesc.minecraft:petrified_oak_slab": "§nPetrified Oak Slab §r\n\nA remnant of a long lost version of minecraft, the petrified oak slab is basically a totally normal oak slab! Just it acts like a stone slab. This is because, in the past, the petrified oak slab actually shared the same exact block ID, back when they were all documented via numbers rather than the modern name system. Cool!",

  "everydesc.minecraft:vines": "§nVines §r\n\nVines are nature’s ladder! They can be found primarily in swamps and jungles, and climbed to the treetops! They can also be harvested with Shears for decoration, but cannot be bonemealed, making it a slow block to grow.",
  "everydesc.minecraft:barrel": "§nBarrel §r\n\nBarrels are one of the most compact storage blocks! Like chests, one stores 27 item slots, however they do not combine to make double chests, and they also take up a full block. This makes them slightly less laggy in some cases, more compact and versatile, and a good decoration option! They're also the workstation of the Fisherman villager, which buys and sells anything ocean related from boats, fish, to campfires (for some reason?) and fishing rods. They can be rather annoying if you use barrels for storage and have villagers nearby, unfortunately.",
  "everydesc.minecraft:blast_furnace": "§nBlast Furnace §r\n\nBlast Furnaces are the ultimate ore-smelters, quickly melting down iron, gold, ancient debris, and even silk-touched ores. (Though, that can be a bit of a waste, unless smelting Nether Gold Ore, as that has minimal loss using this method.) The Blast Furnace is also the workstation of the Armorer, who buys ores like coal and diamond, and, of course, sells armor, even up to a full set of Diamond! Their counterpart is the Toolsmith and Weaponsmith.",
  "everydesc.minecraft:brewing_stand": "§nBrewing Stand §r\n\nBrewing Stands are very useful crafting stations, used to create powerful drinks - potions! These can range from harmful ones, like instant damage, poison, or weakness, to helpful ones, like instant health, regeneration, and strength. There are numerous types of potions to craft. Brewing Stands are also the workstation of the Cleric, who buys and sells different monster drops, such as buying rotten flesh, and selling ender pearls.",
  "everydesc.minecraft:cartography_table": "§nCartography Table §r\n\nThe Cartography table is the 'map station,' where you can increase the size of and duplicate maps using paper. It's also a workstation for the Cartographer, who sells maps, buys paper, and can even give you Locator Maps, which can help you find extremely rare structures.",
  "everydesc.minecraft:bedrock": "§nBedrock §r\n\nAn unbreakable, unobtainable block that forms the vertical boundaries of dimensions. If you've somehow managed to get it in survival, I recommend placing it above every single one of your chests.",
  "everydesc.minecraft:sugar_cane": "§nSugar Cane §r\n\nSugar Cane is a valuable crop for food and utility alike! It can grow on sand, grass, and moss if next to water, and if you have excess, can be composted into bonemeal (Despite being immune to the stuff).",
  "everydesc.minecraft:lava": "§nLava §r\n\nJump in. Jump in. Jump in.",
  "everydesc.minecraft:nether_wart": "§nNether Wart §r\n\nNether Wart is a hellish fungus found in Nether Fortresses and rarely in Bastion Remnants with a primary use in potions. It can only grow on Soul Sand, which seems to make Bonemeal ineffective, and can afterwards be brewed into Awkward Potions (The base of all other potions), sold to §5Cleric §rVillagers, and composted.",
  "everydesc.minecraft:cactus": "§nCactus §r\n\nCactus is a prickly block found commonly in deserts and badlands. It damages entities and destroys items next to it, uproots itself if any blocks are directly next to it, can be smelted into Green Dye and can be composted into bonemeal (Despite being immune to it). What §ocan’t §r you do with it? It can be grown on sand and red sand. ",
  "everydesc.minecraft:chorus_flower": "§nChorus Flower §r\n\nChorus plants can be found in End Highlands biomes, and are a source of the mysterious Chorus Fruit. They are made up of flowers and stems, with the flowers being how you grow the plant, and the stems dropping the fruit. Chorus Flowers can only be harvested by directly breaking them or shooting them off with a projectile, while stems drop fruit regardless. Chorus Flowers are grown on End Stone, are immune to Bonemeal, and can branch out to make more flowers.",
  "everydesc.minecraft:lightning_rod": "§nLightning Rod§r\n\nThis handy little copper contraption is a must-have if you want to protect your base during a storm! It can also generate a little bit of power when it's struck. Be careful, though: the blocks around a lightning rod can still catch fire when lightning does strike.",
  "everydesc.minecraft:glowstone":"§nGlowstone §r\n\nForms in crystalline clusters on the ceiling of the Nether, where it provides light. Though it shatters into dust if not mined with Silk Touch, this §6Glowstone Dust§r is used by Witches to amplify the effects of their potions. The block itself makes a pleasant light source that fuels the §5Respawn Anchor's§r respawning powers.",
  "everydesc.minecraft:nether_portal": "§nNether Portal §r\n\nThe rift between dimensions given form, stepping through will take you to the other side... Regardless of whichever side you're entering from, whatever awaits there likely won't be friendly. Be prepared for the worst!",
  "everydesc.minecraft:cauldron": "§nCauldron §r\n\nThe Cauldron is a block used for storage of fluids, or anything else able to be stored in a bucket (excluding milk.) If raining, a cauldron is able to be slowly filled with water if exposed to the sky. If high enough (while snowing) a cauldron will eventually fill with powdered snow. If placed below a dripstone dripping with lava, it will fill with lava! It is also the station for the leatherworker, who sells leather items, such as armor and saddles.",
  "everydesc.minecraft:water_cauldron": "§nWater Filled Cauldron §r\n\nA cauldron filled with water, either via buckets, water bottles, or by falling rain!",
  "everydesc.minecraft:lava_cauldron": "§nLava Filled Cauldron §r\n\nA cauldron filled with lava, either via buckets or a dripstone stalactite with lava 2 blocks above it (Separated by another block.) Not ideal for baths!",
  "everydesc.minecraft:powdered_snow_cauldron": "§nPowdered Snow Filled Cauldron §r\n\nA cauldron filled with powdered snow, either via buckets or from snow slowly filling it up. (Which can be done either in a cold biome, or extremely high up!) The fluffy 'fluid' is quite cold.",
  "everydesc.minecraft:composter": "§nComposter §r\n\nThe Composter is an extremely good block for anyone with a large surplus of plantlife! By placing in almost any plant-like item, whether it be saplings, leaves, seeds, crops, or the like, it'll have a chance to fill the Composter with another layer. Once full, it'll make bonemeal! It's also the workstation for the Farmer, who buys crops, and sells food.",
  "everydesc.minecraft:fletching_table": "§nFletching Table §r\n\nThe Fletching Table is a rather useless block (as of now) excluding being a villager workstation for, well, the Fletcher! The fletcher buys sticks (an extremely effective way of collecting emeralds) and sells enchanted bows/crossbows and arrows.",
  "everydesc.minecraft:grindstone": "§nGrindstone §r\n\nThe Grindstone is a very useful block for any enchanter worth his experience, literally! Using the grindstone, you are able to shave off any (non-curse) enchant, giving you back the equivalent in experience! It is also a villager workstation, for the Weaponsmith! They, obviously, sell various weapon items.",
  "everydesc.minecraft:lectern": "§nLectern §r\n\nThe Lectern is a block with a very simple purpose: holding books! If you place a written book, whether it's signed or not, you can read it! It also sends a redstone signal, which changes depending on the page. It's also the workstation for the useful Librarian, who buys paper and sells enchanted books for albeit expensive prices.",
  "everydesc.minecraft:loom": "§nLoom §r\n\nThe Loom is the ultimate banner decoration station, allowing you to add patterns to banners, including ones found around the world, or created! Just put in a banner and a dye and get to work! They are also the workstation of the Shepherd, who buys and sells wool and dye based items.",
  "everydesc.minecraft:smithing_table": "§nSmithing Table §r\n\nThe Smithing Table is a simple station used primarily for coating weapons and armors in other materials, such as diamond equipment in netherite ingots. It is also the workstation of the Toolsmith, who of course sells tool items, up to diamond.",
  "everydesc.minecraft:smoker": "§nSmoker §r\n\nThe Smoker is the ultimate food-cooker, being a furnace-like block, much like the blast furnace. However, while the blast furnace smelts ores, the Smoker cooks up food. (especially meat!) It is also the workstation of the Butcher, who buys and sells meat-related items.",
  "everydesc.minecraft:stonecutter": "§nStonecutter §r\n\nThe Stonecutter is, you guessed it, used for cutting stone! You can use it to transform stone-like blocks into their chiseled, brick, cracked, polished, and more variants, as well as into stairs and slabs. It is also the workplace of the Mason, who sells clay, stone-like items, etc.",
  "everydesc.minecraft:bell": "§nBell §r\n\nThe centerpiece of all villages! During midday, villagers will gather near Bells and make any 'decisions' they need to do, such as creating an iron golem, more villagers (wink wink) and sharing food. It is also able to be rung during a raid in order to see any leftover raiders. Finally, it causes any wandering traders that happen to spawn to go towards it, with decently higher rates. Warning: it's quite annoying!",
  "everydesc.minecraft:target": "§nTarget §r\n\nThe Target block is a simple block used in redstone, notably for sending redstone signals when hit with a projectile. (Stronger the closer to the center it is! Try to aim a bullseye from far away!) The Target also has the unique property of being opaque, without being a mechanism (like pistons) it still directs redstone to it. Go off, redstone engineers!",
  "everydesc.minecraft:soul_sand": "§nSoul Sand §r\n\nTaking on the appearance of disturbing spirits trapped inside, the souls inside Soul Sand will  massively slow you down when walked over. Perfect for growing the rare Nether Wart! If your boots are enchanted with Soul Speed, the block speeds you up instead!",
  "everydesc.minecraft:soul_soil": "§nSoul Soil §r\n\nUnlike Soul Sand, Soul Soil doesn't slow you down when walked over, and also notably lacks the ability to grow Nether Wart. You are still massively sped up when walking over it in Boots enchanted with Soul Speed, though!",
  "everydesc.minecraft:soul_fire": "§nSoul Fire §r\n\nSmelting the souls of the damned, Soul Fire burns just a little less brightly than that of regular flames – Meaning they won’t melt any ice blocks they’re placed around!",
  "everydesc.minecraft:coal_block": "§nBlock of Coal§r\n\nWith ten times the endurance of a single piece of coal, a block of the stuff only takes nine to craft! That'll yield you 80 items worth of cooked goods. Just be sure to use hoppers to continually fill and empty the contents of your furnace, or else you'll find yourself wasting a good 16 items worth of fuel time once the furnace is full to the brim!",
  "everydesc.minecraft:flint_and_steel": "§nFlint and Steel §r\n\nSparking this item together is a handy way to create fire whenever you need it. That same heat is known to catalyze Obsidian frames into dimensional rifts... It can also be used to cook animals alive, if that's more your style.",
  "everydesc.minecraft:coarse_dirt": "§nCoarse Dirt §r\n\nAlthough seemingly useless at first, Coarse Dirt can be hoed to be converted back into regular old dirt! It also doesn’t allow the growth of grass, making it especially useful when building!",
  "everydesc.minecraft:podzol": "§nPodzol §r\n\nPodzol is an excellent terraforming block, being very useful for adding some texture and depth to more forested areas, and is found naturally underneath massive spruce trees. More Podzol can be created by growing spruce saplings in a 2x2 area, creating a larger variant that has podzol beneath its canopy.",
  "everydesc.minecraft:sponge": "§nSponge §r\n\nEndlessly handy for getting rid of troublesome water, sponges will suck up water in a radius of about 7 blocks when placed in it! Why are they exclusively found in Ocean Monuments? Who knows! To dry a soggy sponge out for further use, just put it in a furnace (or the Nether) and it'll dry out in no time!",
  "everydesc.minecraft:nether_star":"§nNether Star §r\n\nThe brightly shining pinnacle of poison formed within the core of a great undead boss, it is known to have the ability to filter material power into immaterial beams of light that project a radius of potion effects. This machine, called a §bBeacon§r, is the culmination of hours of mining and combat.",
  "everydesc.minecraft:beacon":"§nBeacon §r\n\nA capstone of light and magic. When placed atop a pyramid of metal or gems, and provided with a valuable ingot, it emits a beam of light above itself. This beam can be tinted to any hue with glass and provides beneficial potion effects in a radius. The taller the pyramid, the greater the effect.",
  "everydesc.minecraft.end_portal_frame":"§nPortal Frame§r\n\nThis window is all that stands between you and... The End. Looks like it'll take some Eyes of Ender to light up.",
  "everydesc.minecraft.lily_pad":"§nLily Pad §r\n\nAlthough they’re small and thin, Lily Pads are remarkably sturdy, being capable of supporting the weight of a fully grown person all whilst floating over water!",
  "everydesc.minecraft.emerald":"§nEmerald§r\n\nWhilst they’re a rarity to find anywhere but mountains, these clean-cut beauties are bountiful enough to make up the currency of the Villagers, who can be traded with for a variety of different items.",
  "everydesc.minecraft.tripwire_hook":"§nTripwire Hook§r\n\nWith two hooks and a piece of string lined between them, one can make a Tripwire trap that detects when a mob has passed through and emits a Redstone signal accordingly, allowing for any number of traps to be set off.",
  "everydesc.minecraft.daylight_detector":"§nDaylight Detector§r\n\nIf you’d like to activate some Redstone Lamps at dawn, an inverted Daylight Detector is exactly what you’re looking for: When inverted, it’ll emit a Redstone signal whenever it can’t detect sunlight!",
  "everydesc.minecraft.turtle_egg":"§nTurtle Egg§r\n\nHold onto your helmet, because Turtle Eggs take a long while to hatch – About four to five days on average. They’ll also only progress towards hatching if a player is within 10 dozen blocks of their vicinity. Fun...!",
  "everydesc.minecraft.snowball ":"§nSnowball§r\n\nAlthough primarily serving the purpose of being fun to throw at friends and enemies alike, Snowballs actually deal damage against Blazes! Who knew throwing a ball of ice crystals at a fire elemental would hurt them?",
  "everydesc.minecraft.name_tag ":"§nName Tag§r\n\nWant to give a pet, villager, or even an enemy a custom name? Embed a name onto this name tag in an Anvil, then slap it onto your target of choice!",
  "everydesc.minecraft.lead ":"§nLead§r\n\nWith a trusty lead, most any farm animal can be wrangled and lead to wherever you may want to go! An excellent replacement for luring animals with food, that’s for certain.",
  "everydesc.minecraft.spectral_arrow ":"§nSpectral Arrow§r\n\nImbued with Glowstone, these handy projectiles can illuminate any target it hits, allowing anyone and everyone to see them, even through walls!",
  "everydesc.minecraft.saddle ":"§nSaddle§r\n\nThe perfect seating to ride a trusty steed, such as a Pig, Donkey, or Strider!",
  "everydesc.minecraft.glow_ink_sac":"§nGlow Ink Sac§r\n\nApply to a sign to give text a luminous glow!",
  "everydesc.minecraft.honey_bottle":"§nHoney Bottle§r\n\nThis nectar of the Gods has the wonderful side-effect of not only tasting delicious, but also clearing any poison effect you may be experiencing!",
  "everydesc.minecraft.pointed_dripstone":"§nPointed Dripstone§r\n\nForming the stalagmites and stalactites of the Dripstone Caves, this sharp-edged stone will pierce anybody who dares fall on top of it, or anybody who it falls onto! Additionally, if lava or water is placed above it, it’ll drip said liquid down onto the ground below! Cauldrons can collect these excess drips, creating renewable water and lava!",
  "everydesc.minecraft.dragon_breath":"§nDragon’s Breath§r\n\nThis hazy vile makes for the perfect ingredient in turning Splash potions into Lingering ones!",
  "everydesc.minecraft.magma_cream":"§nMagma Cream§r\n\nThis infernal creamball just might have the perfect consistency to turn an Awkward potion into a Fire Resisting one!",
  "everydesc.minecraft.rabbit_foot":"§nRabbit’s Foot§r\n\nBoiling this foot down into an Awkward potion brew may just be the key to gain the jump-height of a Rabbit!",
  "everydesc.minecraft.book":"§nBook§r\n\nWhen placed in an Enchanting Table, books can be used to store enchantments for trading, later use for tools, or levelling up via fusing in an Anvil! Otherwise, they can also be used to craft Bookshelves to empower the Enchanting Table itself.",
  "everydesc.minecraft.carrot":"§nCarrot§r\n\nCarrots are not only good for your eyesight: They're also useful in luring and breeding Pigs, in addition to Rabbits and... Villagers?",
  "everydesc.minecraft.gilded_blackstone":"§nGilded Blackstone§r\n\nA highly prized decorative block created by the Piglins, this Blackstone has been imbued with gold nuggets to create a shabby, yet dazzling, piece of decor. I hope you've got Silk Touch if you intend on mining it!",
  "everydesc.minecraft.amethyst_shard":"§nAmethyst§r\n\nOooh, pretty! The glassy nature of this mineral could be great for creating a Spyglass telescope or Tinted Glass block!",
  "everydesc.minecraft.budding_amethyst":"§nBudding Amethyst§r\n\nMight be best to leave this block alone - So long as it's about, it'll keep regrowing Amethyst Clusters!",
  "everydesc.minecraft.cave_vines":"§nCave Vines§r\n\nApply Bonemeal for some easy Glow Berries!",
  "everydesc.minecraft.big_dripleaf":"§nBig Dripleaf§r\n\nA plant so big, you can run and jump on it! Beware though, it can only support your weight for a brief moment before giving out, so make your time atop it brief!",
  "everydesc.minecraft.glow_lichen":"§nGlow Lichen§r\n\nA composite organism native to the world's caves, Glow Lichen emits a subtle glow that acts as a beacon in the darkness. Use it as a starting point, and light up the rest of a cave yourself!",
  "everydesc.minecraft.golden_apple":"§nGolden Apple§r\n\nThis golden fruit bares many regenerative, empowering properties when consumed. For their rarity, it is recommended that they be eaten only when needed. A Gapple a day keeps death away!",
  "everydesc.minecraft.reinforced_deepslate":"§nReinforced Deepslate§r\n\nWhat on Earth is this supposed to do...?",
  "everydesc.minecraft.tinted_glass":"§nTinted Glass§r\n\nAlthough translucent like glass, light cannot pass through this block, allowing you to make subspaces of total darkness!",
  "everydesc.minecraft.turtle_helmet":"§nTurtle Helmet§r\n\nThis headpiece will give you a nice head-start when jumping into water, giving you an addition 10 seconds of air before you need to resurface!",

  "everydesc.forge:copper_blocks.tag":"§nCopper Block§r\n\nThe longer Copper sits out, the more it oxidizes over time, turning from a shining orange to a saturated greenish-blue!",
  "everydesc.forge:candles.tag":"§nCandles§r\n\nRight-Click with Flint and Steel to light them!",
  "everydesc.forge:coral_blocks.tag":"§nCoral§r\n\nWithout water, Coral will DIE! If you intend on utilizing it, keep it in an aquarium!"
  }