{
  "odd.dialogue.main/1": "Well, well, well, fancy meeting you here!",
  "odd.dialogue.main/2": "Well, well, well, look who decided to show up! How's life treating you?",
  "odd.dialogue.main/3": "Oh, look who decided to grace us with their presence! How's it going?",
  "odd.dialogue.main/4": "Tell me, what adventures has life thrown at you today?",
  "odd.dialogue.main/5": "How's the world treating you today, my dear?",
  "odd.dialogue.main/6": "Ah, %1$s! What's the latest gossip in this crazy world?",
  "odd.dialogue.main/7": "Gather 'round, folks! Let me regale you with the epic tale of how %supporter% had a close encounter with a zombie! It was quite the sight, let me tell you. And guess what? I saw a zombie that's practically a doppelganger of %supporter% today! Can you believe it?",

  "odd.dialogue.rumors.failed/1": "Oh, dearie me, my ears have failed me once again! I seem to have missed out on all the juicy gossip.",
  "odd.dialogue.rumors.lore/1": "Can you believe it? Jax used to be the hotshot around here, but now everyone is all about Sirben! I mean, have you heard the prophets MerlinWolfGames and Crow? They're practically his fan club now!",
  "odd.dialogue.rumors.lore/2": "So get this, right? These cyberdemons thought they could just waltz into the Overworld with their fancy portals. But guess what? Sirben and Luke were like, \"Not on our watch!\" They shut that invasion down real quick!",
  "odd.dialogue.rumors.lore/3": "You won't believe what I heard! Apparently, after that Ancient Builder went missing, they say 2DA50 just up and disappeared to the Far Lands! Like, talk about mysterious... No one has heard a peep from them since!",
  "odd.dialogue.rumors.lore/4": "Talk about devotion! MerlinWolfGames actually went and built a whole temple dedicated to Sirben. I mean, that's some serious dedication right there! It's like one of those ancient wonders, you know?",
  "odd.dialogue.rumors.lore/5": "So, get this. There used to be this super advanced race of builders, right? But now? Poof! Gone! Vanished into thin air. It's like they just pulled a magic trick and disappeared from the Overworld!",
  "odd.dialogue.rumors.lore/6": "Ohhhh, let me tell you about the legends! Those ancient builders were like the rockstars of the Overworld. I mean, they left behind these insane ruins and temples everywhere! It's like they were showing off or something!",

  "odd.dialogue.first.generic/1": "Well, well, well, look who we have here! A lost soul, perhaps?",
  "odd.dialogue.first.generic/2": "Oh, hello there! Did you stumble upon this place by accident or were you actually aiming for it?",
  "odd.dialogue.first.generic/3": "Well, well, well, who do we have here? Another poor lost soul seeking refuge, I assume?",
  "odd.dialogue.first.generic/4": "Welcome, stranger! Have you come to hear our riveting tales or are you just here to add to the chaos?",
  "odd.dialogue.first.generic/5": "My oh my, it's been ages since someone new arrived. I hope you're not here to cause trouble!",
  "odd.dialogue.first.generic/6": "Well, well, well, what brings you to our humble village, huh? Did you lose your way or did you actually intend to be here?",

  "odd.dialogue.first.question/1": "Greetings, wanderer! Pray tell, what peculiar forces have led you to this humble hamlet?",
  "odd.dialogue.first.question/2": "Ah, a fresh soul! Do indulge me, dear visitor, what thrilling escapades have brought you to our quaint abode?",
  "odd.dialogue.first.question/3": "By the bristling beard of Notch! Are you an intrepid explorer, good sir/madam? Pray, enlighten me on the extraordinary means by which you found your way to our unassuming settlement!",
  "odd.dialogue.first.exploring/1": "We ain't got much 'round these parts, but hey, you're welcome here, just don't go breakin' any rules, ya hear?",
  "odd.dialogue.first.exploring/2": "Follow the laws, pal, and you're free to stick around in this neck of the woods.",
  "odd.dialogue.first.exploring/3": "Watch your step, stranger. This here's a place for polite folk, so mind your manners if you plan on stayin'.",
  "odd.dialogue.first.settling/1": "Well, well, well! Look who decided to grace us with their presence! About time!",
  "odd.dialogue.first.settling/2": "Oh joy, another addition to this delightful little village! Brace yourself, neighbor!",
  "odd.dialogue.first.settling/3": "Ah, another soul foolish enough to join our madness! Welcome, welcome!",
  "odd.dialogue.first.settling/4": "So, you actually decided to stick around, huh? Well, prepare yourself for the wild ride!",
  "odd.dialogue.first.spent_night.success/1": "Why settle for a dull shack when you could experience the splendor of our marvelous inn?",
  "odd.dialogue.first.spent_night.success/2": "If you're in the mood to be swept off your feet by comfort and luxury, our inn is the only logical choice!",
  "odd.dialogue.first.spent_night.success/3": "Seeking a haven of coziness and delights? Look no further than our inn, the epitome of perfection!",
  "odd.dialogue.first.spent_night.failed/1": "Ah, the inn situation here is quite dire, I must say. Our feeble minds simply cannot fathom the intricate art of constructing a decent establishment for weary travelers.",
  "odd.dialogue.first.spent_night.failed/2": "Alas, an inn is a rarity in these parts, my dear visitor. Our feeble attempts at constructing one have been utterly in vain.",
  "odd.dialogue.first.spent_night.failed/3": "Oh, dear adventurer, it seems our humble village lacks the hospitality you seek. Perhaps a neighboring settlement houses the inn of your dreams?",

  "odd.dialogue.hug.success/1": "Well well well, if it isn't my favorite visitor in the whole blocky world! Where have you been hiding?",
  "odd.dialogue.hug.success/2": "Ah, what a timely embrace! My heart was yearning for this tender moment of physical connection. Gratitude emanates from the depths of my soul.",
  "odd.dialogue.hug.success/3": "Amidst the chaos and monotony of this cubic existence, your affectionate gesture stands out as a radiant beam of light, illuminating this otherwise dreary day.",
  "odd.dialogue.hug.success/4": "By the mighty Ender Dragon, you possess the snuggling prowess of a thousand fluffy sheep! Your embrace rivals the warmth of a thousand campfires.",
  "odd.dialogue.hug.success/5": "Oh, how delightful! Your hug has awakened a dormant spark of joy within me. Allow me to reciprocate this gesture of affection, dear interlocutor.",
  "odd.dialogue.hug.success/6": "My word! The temperature of your body is akin to that of a roaring volcano! Such warmth has invigorated my very core, like a cozy blanket on a winter's night.",
  "odd.dialogue.hug.fail/1": "Wow, you look like a walking disaster zone!",
  "odd.dialogue.hug.fail/2": "Pass. I'd rather be caught in a zombie apocalypse.",
  "odd.dialogue.hug.fail/3": "Huh? Are you trying to infect me with your weird hugging ritual?",
  "odd.dialogue.hug.fail/4": "Remember when you insulted my fashion sense? Yeah, hard pass.",
  "odd.dialogue.hug.fail/5": "Frankly speaking, you couldn't even hug a cactus after what you pulled.",
  "odd.dialogue.hug.fail/6": "Yikes! Keep your cooties away from me, you walking virus!",
  "odd.dialogue.hug.fail/7": "Oh, um... I guess I should be grateful? Maybe?",

  "odd.dialogue.kiss.success/1": "Can we just freeze time and savor this sweet, sweet kiss?",
  "odd.dialogue.kiss.success/2": "My heart is doing somersaults, I might be head over heels for you...",
  "odd.dialogue.kiss.success/3": "Whoa, this lip-lock is like a gourmet feast, with extra seasoning of pumpkin pie!",
  "odd.dialogue.kiss.success/4": "Mmm, your lips are like the sweetest honey, I could savor them all day.",
  "odd.dialogue.kiss.success/5": "Wowza! You've got some serious smooching skills, %1$s! You're in a league of your own.",
  "odd.dialogue.kiss.success/6": "Move over Ash, %1$s is the new reigning champion of kisses! *giggles uncontrollably*",
  "odd.dialogue.kiss.fail/1": "Well, well, well, look who's afraid of a little public display of affection!",
  "odd.dialogue.kiss.fail/2": "Is that your attempt at a kiss? I've seen better kisses from a fish!",
  "odd.dialogue.kiss.fail/3": "Ash's kisses are legendary, unlike your feeble attempts.",
  "odd.dialogue.kiss.fail/4": "Have you ever heard of breath mints? Trust me, they work wonders!",
  "odd.dialogue.kiss.fail/5": "Oh, thank you, I guess? Though I'm not sure if that was even a kiss.",
  "odd.dialogue.kiss.fail/6": "Get off me, you clumsy oaf! Can't you see I'm not interested?",

  "odd.dialogue.chat.success/1": "Oh man, cookies and milk are like a match made in culinary heaven!",
  "odd.dialogue.chat.success/2": "Yeah, the weather is totally rocking today, like seriously rock and roll vibes.",
  "odd.dialogue.chat.success/3": "Ouch! I totally smashed my toe this morning, but hey, it's just another day in my clumsy life.",
  "odd.dialogue.chat.success/4": "You know what they say, an apple a day keeps the zombies away! And trust me, I've got the juiciest apples in town.",
  "odd.dialogue.chat.success/5": "Building my own village sounds like a dream, but let's be real here, I'm the king of procrastination.",
  "odd.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter% strutting their stuff in a full-blown diamond armor! Total Minecraft fashionista.",
  "odd.dialogue.chat.success/7": "Hold on to your pickaxe, because %Supporter% spilled the tea about finding a chest loaded with diamonds yesterday. I'm talking serious treasure hunting skills!",
  "odd.dialogue.chat.success/8": "Can we just take a moment to appreciate this jaw-dropping weather? It's like nature decided to put on a show just for me.",
  "odd.dialogue.chat.success/9": "Spiders and goblins? Meh, not impressed. I've been a villager all my life, and those creepy crawlies don't scare me one bit.",
  "odd.dialogue.chat.success/10": "So, what's the deal with %Supporter% disappearing into the Minecraft wilderness? They took off like a rocket about a year ago, leaving us all wondering.",
  "odd.dialogue.chat.success/12": "Hold onto your pickaxe, because I've got some juicy gossip about %Supporter% that will blow your mind. You won't believe what they've been up to.",
  "odd.dialogue.chat.success/13": "I've been seriously considering adopting one of those adorable stray cats roaming around. But between you and me, I'm struggling to find the time. Life's just too hectic, you know?",
  "odd.dialogue.chat.success/14": "You know what would be epic? Giving my house a complete makeover. But let's face it, laziness is my middle name.",
  "odd.dialogue.chat.success/15": "Ah, the future children... someday. Just need to find that perfect partner who's up for building a blocky family with me.",
  "odd.dialogue.chat.success/16": "Ever wonder what life would be like if we had chosen a different village to settle in? I can't help but daydream about the possibilities.",
  "odd.dialogue.chat.success/17": "Oh, the nostalgia hits hard sometimes! Those childhood memories, man. They were the best, like having an enchanted diamond sword in your inventory.",
  "odd.dialogue.chat.success/18": "It's been ages since I last caught up with my parents. I should really plan a visit soon, before they think I've turned into a",
  "odd.dialogue.chat.success/19": "Oh man, I've been itching to venture out to that other village nearby! I mean, who knows what kind of fantastic creatures and zany characters I might encounter there? Plus, I have a bunch of pals I haven't laid eyes on in ages. Can't wait to catch up with them and hear all the latest gossip from the entire realm!",
  "odd.dialogue.chat.success/20": "You know, every now and then, when I close my eyes and let my mind wander, I start daydreaming about this mythical thing called cheese. It's supposed to be this magical, gooey goodness that's so tantalizing and addictive. I can almost taste its creamy, melt-in-your-mouth perfection! Oh, how I wish I could get my hands on a block of that heavenly delight. But alas, it remains a distant, wistful fantasy for now. Sigh.",
  "odd.dialogue.chat.fail/1": "Did you seriously just say that? Oh my goodness, I can't even begin to comprehend the level of absurdity in your words.",
  "odd.dialogue.chat.fail/2": "I don't believe it exploded on its own. Well, isn't that just the most unbelievable thing I've ever heard. Bravo, you've managed to impress me with your wild imagination.",
  "odd.dialogue.chat.fail/3": "You know, you're not that cool. Oh, aren't you just the epitome of uncoolness? I can practically feel the lack of coolness radiating off of you.",
  "odd.dialogue.chat.fail/4": "Show off. Look at you, strutting around like you're the center of the universe. Newsflash, nobody is impressed by your pathetic attempts to impress.",
  "odd.dialogue.chat.fail/5": "You should be thrown in a dungeon! Oh, what a delightful suggestion! I wholeheartedly agree, you deserve to be locked away for eternity with no chance of escape.",
  "odd.dialogue.chat.fail/6": "Ew. Go away, you dress like you're from the past. Oh, honey, your fashion sense is just tragic. It's like you raided a dusty old attic and decided to wear whatever you found.",
  "odd.dialogue.chat.fail/7": "That is such a dumb thing to talk about. Wow, congratulations on reaching a whole new level of stupidity. Your lack of intellectual capacity is truly astounding.",
  "odd.dialogue.chat.fail/8": "Why are you talking to me again? Ugh, you again? I thought I made it perfectly clear that I have no interest in engaging in pointless conversation with someone as insufferable as you.",
  "odd.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I didn't care to listen. Oh, did you say something? I must have been too busy not caring about what you have to say. Silly me.",
  "odd.dialogue.chat.fail/10": "Excuse me? Pardon me for my bluntness, but your words have managed to reach a level of idiocy that I never thought possible. Bravo, I suppose.",
  "odd.dialogue.chat.fail/11": "What is wrong with you? Why are you talking about this? Seriously, what is going on inside that head of yours? It must be a never-ending circus of nonsensical thoughts.",
  "odd.dialogue.chat.fail/12": "I've heard harsh things about you, I can kinda see why they think that. So, apparently, people have been saying some not-so-nice things about you. And I must say, I can definitely see where they're coming from.",
  "odd.dialogue.chat.fail/13": "Not even zombies will talk to you. Congratulations, you've reached a new low in social interaction. Even the undead have higher standards than to waste their time with you.",
  "odd.dialogue.chat.fail/14": "13",
  "odd.dialogue.chat.fail/15": "Oh, how delightful! Another mind-numbing conversation to add to my collection of boredom.",
  "odd.dialogue.chat.fail/16": "Excuse me, but I seem to have misplaced my interest in whatever you're saying.",
  "odd.dialogue.chat.fail/17": "You know, I've heard that silence can be a valuable skill. Maybe you should try it sometime.",
  "odd.dialogue.chat.fail/18": "Your babbling is like nails on a chalkboard, except I'd rather listen to the nails.",
  "odd.dialogue.chat.fail/19": "Well, aren't you just a captivating conversationalist... said no one ever.",
  "odd.dialogue.chat.fail/20": "Pardon me, but I have this incredible ability to tune out the sound of drivel. Congratulations, you're a prime candidate for testing it out.",
  "odd.dialogue.chat.fail/21": "Oh, please, spare me your tedious words. I have much more important things to ignore.",

  "odd.dialogue.story.success/1": "Seriously? I absolutely refuse to believe that all that nonsense actually took place!",
  "odd.dialogue.story.success/2": "If only I had the guts to confront a creeper head-on. Alas, I am but a trembling coward.",
  "odd.dialogue.story.success/3": "That tale you just spun was surprisingly decent! Did you actually come up with it yourself? Color me impressed!",
  "odd.dialogue.story.success/4": "Hold up! You're telling me that entire calamity unfolded just yesterday? I find that utterly preposterous!",
  "odd.dialogue.story.success/5": "Wait a minute, I was in the vicinity yesterday! It's inconceivable that I haven't already heard about this mind-boggling saga.",
  "odd.dialogue.story.success/6": "Hahaha! Oh dear, dear %Supporter%! What an extraordinary individual they must be! Such magnanimity!",
  "odd.dialogue.story.success/7": "The Legend of %Supporter% has been regaled to my ears a million times over. Nevertheless, I implore you to recount it once more!",
  "odd.dialogue.story.success/8": "Ah, I see! That's the riveting account of how you stumbled upon your first diamond, is it not? Fascinating!",
  "odd.dialogue.story.success/9": "You absolutely must grace us with your presence later! I'm positively enthralled by the prospect of hearing more tales from your extraordinary life.",
  "odd.dialogue.story.fail/1": "Watch your words, for I am the village's finest gossipmonger!",
  "odd.dialogue.story.fail/2": "The village must be so thrilled to have you as their resident source of amusement.",
  "odd.dialogue.story.fail/3": "My brain is currently experiencing a malfunction. It seems your story failed to compute.",
  "odd.dialogue.story.fail/4": "Oh, look at you, the heartless soul crusading for the rights of those poor, misunderstood Creepers!",
  "odd.dialogue.story.fail/5": "I weep for the lost innocence of that defenseless sheep you so callously slaughtered!",
  "odd.dialogue.story.fail/6": "*snort* Huh? Did someone say something? Sorry, I was busy dreaming of more interesting conversations.",
  "odd.dialogue.story.fail/7": "I shall forever cherish the precious seconds wasted on your pitiful attempt at storytelling.",
  "odd.dialogue.story.fail/8": "Oh, how my eyelids grow heavy with sheer boredom in your presence. Yawn!",
  "odd.dialogue.story.fail/9": "You, my dear friend, possess a level of lunacy that surpasses all known boundaries. A true marvel, indeed.",
  "odd.dialogue.story.fail/10": "I fail to comprehend the greatness you claim to have achieved. It appears my perception is not aligned with your delusions.",

  "odd.dialogue.flirt.success/1": "You're, like, the most fearless person ever! No joke!",
  "odd.dialogue.flirt.success/2": "Woah, you! Seriously, quit being this ridiculously adorable!",
  "odd.dialogue.flirt.success/3": "*Giggles* Are you, like, for real?",
  "odd.dialogue.flirt.success/4": "Oh my gosh...",
  "odd.dialogue.flirt.success/5": "That was, like, the cutest thing ever! I was totally smitten from the moment I saw you!",
  "odd.dialogue.flirt.success/6": "Seriously though, how do you always look this outrageously gorgeous? Whenever I catch a glimpse of you, I'm lost for words.",
  "odd.dialogue.flirt.success/7": "Ugh, come on! You're totally making my cheeks turn beet red.",
  "odd.dialogue.flirt.fail/1": "Yeah, sure. And I'm the king of the Nether.",
  "odd.dialogue.flirt.fail/2": "Oh, please. Don't recycle your cheesy lines on me.",
  "odd.dialogue.flirt.fail/3": "In your dreams, buddy. Actually, scratch that. Even in your wildest dreams.",
  "odd.dialogue.flirt.fail/4": "Seriously? Is that the best you've got? How disappointing.",
  "odd.dialogue.flirt.fail/5": "Haha, good one. But let's be real, a creeper has a better chance at love than you do.",
  "odd.dialogue.flirt.fail/6": "Absolutely not. I'd rather be stuck in an endless loop of mining obsidian than entertain the thought.",
  "odd.dialogue.flirt.fail/7": "Spare me your puppy eyes and never utter those words in my presence again.",

  "odd.dialogue.joke.creative.success/1": "*Chuckles* That's hilariously absurd!",
  "odd.dialogue.joke.creative.success/2": "That's amusingly odd!",
  "odd.dialogue.joke.creative.success/3": "That's the most fantastically funny thing I've ever encountered!",
  "odd.dialogue.joke.creative.success/4": "You might just surpass %Supporter% in the humor department, my friend!",
  "odd.dialogue.joke.creative.success/5": "Hohoho! By the block, you're a riot! Have you ever considered a career in stand-up comedy?",
  "odd.dialogue.joke.creative.success/6": "HAHAHA! That was a joke of pure genius! The laughter shall echo for ages!",
  "odd.dialogue.joke.creative.success/7": "Teehee! You've outshined Ash's comedic prowess, no doubt about it!",
  "odd.dialogue.joke.creative.success/8": "Ahah! That's actually quite amusing, in a wonderfully quirky way!",
  "odd.dialogue.joke.creative.failed/1": "Jokes? Oh, how droll. As if anyone could find amusement in such trivial matters.",
  "odd.dialogue.joke.creative.failed/2": "Oh, how utterly hilarious. I'm positively bursting with laughter... Not.",
  "odd.dialogue.joke.creative.failed/3": "Well, aren't you just the comic genius of the century? Not!",
  "odd.dialogue.joke.creative.failed/4": "Did you honestly think that feeble attempt at humor would elicit even the slightest chuckle from me?",
  "odd.dialogue.joke.creative.failed/5": "Oh, bravo! That was so side-splittingly funny... Not. Please, spare me your comedic brilliance.",
  "odd.dialogue.joke.creative.failed/6": "Wow, you must have a PhD in comedy with jokes like that. Absolutely side-splitting... Not.",
  "odd.dialogue.joke.creative.failed/7": "Hilarious. Absolutely hilarious. I haven't laughed this hard since... well, never. Stick to your day job, my dear.",
  "odd.dialogue.joke.creative.failed/8": "You know, Ash could tell a joke in his sleep and it would still be funnier than anything you could ever come up with.",

  "odd.dialogue.procreate_engaged/1": "My heart quivers at the thought of our union, for only then shall I truly find solace.",
  "odd.dialogue.procreate_engaged/2": "I simply cannot fathom bringing forth a new existence if we have not embarked upon the sacred journey of complete devotion.",

  "odd.dialogue.shake_hand.success/1": "Ah, what a firm handshake you possess! It's like holding hands with a boulder!",
  "odd.dialogue.shake_hand.success/2": "Whoa, your grip is like a titan's embrace! I can feel the raw strength coursing through your veins!",
  "odd.dialogue.shake_hand.success/3": "Oh my, aren't you just the epitome of manners! Your politeness radiates like a dazzling aura!",
  "odd.dialogue.shake_hand.success/4": "Greetings, dear interlocutor! May the sun shine its brightest upon your path today!",
  "odd.dialogue.shake_hand.success/5": "Well, well, well, look who we have here! Howdy-do, my good sir/madam!",
  "odd.dialogue.shake_hand.fail/1": "Are you for real? You just went all Dexter on that poor cow?",
  "odd.dialogue.shake_hand.fail/2": "Nah, I'm good. Don't wanna catch your weird vibes anyway.",
  "odd.dialogue.shake_hand.fail/3": "I'm not some random Joe, so save your fake niceness for someone else.",
  "odd.dialogue.shake_hand.fail/4": "Oh, look at you being all surprising and stuff. Not your usual routine, huh?",
  "odd.dialogue.shake_hand.fail/5": "Can you do me a solid and vanish into thin air? Thanks.",

  "odd.dialogue.main.morning/1": "Goooooood morning, sunshine!",
  "odd.dialogue.main.morning/2": "Rise and grind, pal. Are you ready to conquer the day?",
  "odd.dialogue.main.morning/3": "Ugh, I'm still half asleep. How are you managing to function?",
  "odd.dialogue.main.morning/5": "Wow, you look like you've been through the ringer. Rough night, huh?",
  "odd.dialogue.main.morning/6": "Wakey wakey, my friend! Brace yourself for a never-ending day ahead.",
  "odd.dialogue.main.morning/7": "Well, well, well, someone looks like they had the best sleep of their life. Must be nice.",
  "odd.dialogue.main.morning/8": "Rise and shine, slugabed! Time to join the land of the living.",
  "odd.dialogue.main.morning/9": "Oh, what a sight! The sun is shining, birds are chirping, and I'm already planning my world domination. How about you?",
  "odd.dialogue.main.morning/10": "Today's motto",
  "odd.dialogue.main.morning/11": "My schedule is jam-packed with mundane tasks today. Just thinking about it drains the life out of me.",
  "odd.dialogue.main.morning/12": "Guess what? I actually managed to get some decent sleep for once. Might as well push myself to the limits and see where it takes me. Game on!",
  "odd.dialogue.main.evening/1": "Good evening, lovely humans! How's the world treating you tonight?",
  "odd.dialogue.main.evening/2": "Can you believe how quickly darkness wrapped its mysterious cloak around us? How'd your day unfold, my curious comrades?",
  "odd.dialogue.main.evening/3": "Phew, another grueling day of labor in this bustling village, right? Our work is never done!",
  "odd.dialogue.main.evening/4": "By the stars, didn't the sun sprint across the sky today? So much to do, so little time to savor.",
  "odd.dialogue.main.evening/5": "Ah, the aroma of dinner beckons me home. Time to unleash my culinary prowess upon the humble ingredients!",
  "odd.dialogue.main.evening/6": "Alas, I confess, I whiled away the hours today. Nothing noteworthy to report, I'm afraid.",
  "odd.dialogue.main.evening/7": "My weary bones yearn for sweet slumber. This morning was truly a tempest of troubles!",
  "odd.dialogue.main.evening/8": "As nightfall descends, I dare not venture outside for fear of lurking creepers. Safe indoors I shall remain, dear friends!",
  "odd.dialogue.main.evening/9": "Oh, greetings, fellow explorers of sustenance! Just finished my visit to the local butcher. Farewell for now, until we meet again!",
  "odd.dialogue.main.night/1": "*yawn* You're still awake? You must have a vampire's energy.",
  "odd.dialogue.main.night/2": "Burning the midnight oil, huh? You must thrive in the darkness.",
  "odd.dialogue.main.night/3": "Ah, a fellow nocturnal creature! Don't you just love the peace and quiet?",
  "odd.dialogue.main.night/4": "Remember, the night is when the real adventure begins. Don't be scared of those pesky monsters!",
  "odd.dialogue.main.night/5": "Even with the guards, the night still gives me the creeps. How about you?",
  "odd.dialogue.main.night/6": "The darkness stirs something in me, brings out my inner tranquility. It's a magical time.",
  "odd.dialogue.main.night/7": "Daytime is for mortals, my friend. The night is when the true beauty of the world unfolds.",
  "odd.dialogue.main.night/8": "I'm absolutely exhausted. Today was jam-packed, I definitely need a day off tomorrow.",
  "odd.dialogue.main.night/9": "I can hardly contain my excitement to dive into my cozy nest. Goodbye, cruel world!",
  "odd.dialogue.main.night/10": "Sleep is for the weak, my friend. Embrace the night and all its mysteries!",

  "odd.dialogue.greet.mayor/1": "Hey there, mayor-o-rama!",
  "odd.dialogue.greet.mayor/2": "Greetings, oh majestic Mayor! May your day be as wild as a roller coaster ride!",
  "odd.dialogue.greet.monarch/1": "Ah, most benevolent and majestic ruler!",
  "odd.dialogue.greet.monarch/2": "Greetings, oh exalted and regal being!",

  "odd.dialogue.busy/1": "Oh boy, I've got a ton of work piled up! Gotta hustle, can't chat anymore.",
  "odd.dialogue.busy/2": "You know, as much as I'd love to keep chatting, my deadlines are looming over me. Gotta focus, you know?",
  "odd.dialogue.busy/3": "Ah, I'm knee-deep in work right now. Can't spare a chat, but catch you on the flip side!",
  "odd.dialogue.busy/4": "My oh my, the workload is consuming me! Gotta put my nose to the grindstone, catch ya later!",
  "odd.dialogue.busy/5": "Blast it all! I left my brewing stand unattended. Must dash, but we'll catch up soon, I promise!",
  "odd.dialogue.goaway/1": "Ugh, why don't you just evaporate?",
  "odd.dialogue.goaway/2": "Seriously, don't you have a life to ruin somewhere else?",
  "odd.dialogue.goaway/3": "Oops, %1$s, I'm afraid my indifference meter is off the charts right now.",
  "odd.dialogue.goaway/4": "Hey, why don't you go find a rock to crawl under?",
  "odd.dialogue.goaway/5": "Begone, you pitiful soul! Leave me in peace!",

  "odd.dialogue.greet/1": "Hey there, magnificent being! How's the adventure treating you today?",
  "odd.dialogue.greet/2": "Hey, hey, hey! How's life treating you, my extraordinary friend %1$s?",
  "odd.dialogue.greet/3": "Ah, greetings, humble creature. What brings you to my humble abode?",
  "odd.dialogue.greet/4": "Well, well, well, if it isn't the unstoppable force that is you! How's the world bending to your will today?",
  "odd.dialogue.greet/5": "Greetings, oh magnificent %1$s! Your presence brings joy to my soul!",
  "odd.dialogue.greet/6": "Ohai, fellow inhabitant of this pixelated realm!",
  "odd.dialogue.greet/7": "Ah, it warms my heart to lay my eyes upon your delightful countenance!",
  "odd.dialogue.greet/8": "Hello, hello, hello! It fills me with joy to lay eyes upon your wondrous self. How art thou on this fine day?",
  "odd.dialogue.greet/9": "Hey there, oh radiant being! I'm positively ecstatic to lay eyes upon your glorious presence!",

  "odd.dialogue.greet.negative/1": "Ugh, go away, you're the absolute WORST human being I wanted to encounter!",
  "odd.dialogue.greet.negative/2": "Oh wow, the one person I never asked for has returned. What a delightful surprise.",
  "odd.dialogue.greet.negative/3": "Huh? You again? Can't you find someone else to bother?",
  "odd.dialogue.greet.negative/4": "Oh, it's just you. I was hoping for a more interesting visitor, but I guess beggars can't be choosers.",
  "odd.dialogue.greet.negative/5": "Back to annoy me, huh? You must have a special talent for being irritating.",

  "odd.dialogue.greet.success/1": "Well, ain't that just peachy keen? Delighted to hear it!",
  "odd.dialogue.greet.success/2": "Ah, well aren't you just the cat's pajamas? Absolutely fantastic to know!",
  "odd.dialogue.greet.success/3": "Well, hot diggity dog! That's music to my ears!",
  "odd.dialogue.greet.success/4": "Holy guacamole! I'm over the moon to hear that!",
  "odd.dialogue.greet.success/5": "Well, butter my biscuits and call me a happy camper! It's mighty fine to know!",
  "odd.dialogue.greet.fail/1": "Meh.",
  "odd.dialogue.greet.fail/2": "Delighted to hear...",
  "odd.dialogue.greet.fail/3": "Well, that's peculiar?",
  "odd.dialogue.greet.fail/4": "Seriously? Pfft...",
  "odd.dialogue.greet.fail/5": "Oh well, what a bummer...",

  "odd.dialogue.apologize.success/1": "Oh, pish posh! Blunders are part of life, my dear.",
  "odd.dialogue.apologize.success/2": "Ah, fear not, young one! 'Tis but a trifling mishap.",
  "odd.dialogue.apologize.success/3": "Well, well, well, what have we here? A slip-up, you say? Well, as luck would have it, I suppose we can let it slide. But tread cautiously next time, hmm?",
  "odd.dialogue.apologize.success/4": "Mistakes, mistakes! They're as common as the sun in the sky, my friend. Don't you fret a second about it.",
  "odd.dialogue.apologize.success/5": "Ha! A mere blip on the radar, my good lad. Carry on with your head held high.",
  "odd.dialogue.apologize.fail/1": "Scram, you miserable creature!",
  "odd.dialogue.apologize.fail/2": "Ah, you intentionally smacked into me, didn't you? Just admit it!",
  "odd.dialogue.apologize.fail/3": "Oh, please, do you honestly think I'm naive enough to believe your feeble excuse?",
  "odd.dialogue.apologize.fail/4": "Ouch! Spare me your insincere apologies, they won't undo the pain!",
  "odd.dialogue.apologize.fail/5": "Haha, nice try, but sorry, not sorry, I won't be falling for your apology con!",

  "odd.dialogue.location.failed/1": "Eh, I ain't heard nothing new, and trust me, I got ears sharper than a creeper's hiss.",
  "odd.dialogue.location.failed/2": "Look, buddy, I hate to burst your bubble, but there ain't no interesting places around here that I'd be aware of. You're better off talking to a cow about adventure.",
  "odd.dialogue.location.failed/3": "Nope, sorry, but we villagers have got lives to live, you know? We ain't got time to go traipsing around monster-filled ruins like you adventurers. We'll leave that to the crazies.",
  "odd.dialogue.location.forgot/1": "Oh, I stumbled upon this absolutely mind-blowing spot, but alas, my memory is as forgetful as a goldfish! My apologies for neglecting to jot it down on the map.",
  "odd.dialogue.location.forgot/2": "Seeking an intriguing spot, are we? Ah, yes, there was indeed this captivating location that I stumbled upon... Oh, blast! My mind decided to play hide-and-seek with that information! Apologies for the forgetfulness!",
  "odd.dialogue.location.forgot/3": "Ah, yes, I do recall coming across something fascinating, but alas, my memory is about as reliable as a leaky bucket! My sincerest apologies for the forgetfulness!",
  "odd.dialogue.location.igloo/1": "Can you believe it? I stumbled upon this bizarre igloo at %2$s. Who in their right mind would choose to live in a freezing snow hut? It's like they have an unhealthy obsession with frostbite or something. Shivers!",
  "odd.dialogue.location.igloo/2": "Hey, guess what? I came across this creepy igloo at %2$s. It's totally abandoned, like no one dares to set foot inside. And let me tell you, I've got a sixth sense for the supernatural, and that place reeks of ghostly whispers. Gives me the heebie-jeebies every time I pass by...",
  "odd.dialogue.location.igloo/3": "You won't believe your eyes! There's this forsaken ice house at %2$s, or as they call it, an igloo. Trust me, it's been deserted for so long that even the polar bears wouldn't touch it. I mean, who needs a shabby frozen shelter when you can have a cozy village hut, right?",
  "odd.dialogue.location.pyramid/1": "Yo, yo, yo! You won't believe what I spotted - a pyramid at %2$s! It's like straight out of a fantasy flick, man!",
  "odd.dialogue.location.pyramid/2": "Listen up, my friend! Rumor has it there's a gnarly pyramid at %2$s. You gotta check it out, dude! Who knows, you might stumble upon some epic loot or even uncover a hidden portal to another dimension!",
  "odd.dialogue.location.pyramid/3": "Hey there, adventurer-extraordinaire! Guess what? There's this totally mysterious pyramid waiting for you at %2$s. But here's the catch - some daredevil tried venturing in a while back and hasn't returned. So, like, proceed with extreme caution, my brave soul!",
  "odd.dialogue.location.ruined_portal_desert/1": "Oh, you won't believe what I saw! There's this completely obliterated portal over at %2$s, smack in the middle of the barren desert. It's like a sad relic of forgotten times.",
  "odd.dialogue.location.ruined_portal_swamp/1": "Oh, you won't believe what a sight for sore eyes we have over at %2$s! There's this utterly annihilated portal, smack in the middle of the disgusting swamp. Can you imagine the poor hapless invaders from the Nether expecting to end up in this wretched dump? Ha! They must have thought they landed in the wrong universe or something!",
  "odd.dialogue.location.ruined_portal/1": "Oh boy, you won't believe what happened at %2$s! There's this completely wrecked portal, thanks to those pesky Nether invaders. It's like a post-apocalyptic scene, but with more lava and less zombies.",
  "odd.dialogue.location.ruined_portal/2": "Prepare yourself for a spine-chilling adventure at %2$s! You'll stumble upon a portal from hell that's in ruins. It's so eerie, it could give you nightmares! But hey, as long as you avoid the magma, you should be fine. Probably.",
  "odd.dialogue.location.ruined_portal/3": "Listen, brave soul, if you dare venture to %2$s, you'll discover the remains of a once glorious nether portal. It's practically ancient history now. The locals say there might be treasure, but trust me, no one in their right mind wants to get near that place. It's like a cursed grave, I tell you.",
  "odd.dialogue.location.ruined_portal_mountain/1": "Hold your horses, folks! I stumbled upon a real doozy over in them mountains - an utterly demolished portal that's cryin' out for some lovin'!",
  "odd.dialogue.location.mansion/1": "Oh, you know, if you dare venture into %2$s, you'll stumble upon that ghastly mansion those illagers call home. Trust me, it's a cursed abode. Stay as far away from it as possible if you value your pitiful life, my dear.",
  "odd.dialogue.location.mansion/2": "You won't believe it, but there's this massive, dreadful mansion situated at %2$s, and it's owned by those wicked illagers. Personally, I think it's high time we relocate our village, miles away from this cursed place. I mean, who knows what horrors lurk within its walls?",
  "odd.dialogue.location.monument/1": "Yo, listen up! There's this totally rad sunken castle, right? But dude, be careful 'cause it's like, guarded by these gnarly sea monsters. Stay away, man!",
  "odd.dialogue.location.monument/2": "Bro, check this out! There's these legit stories about ancient ruins deep in the ocean over at %2$s. Like, for real, there could be some sick treasure down there. But just a heads up, it's gonna be like, super risky.",
  "odd.dialogue.location.shipwreck/1": "Ahoy there! Guess what I stumbled upon at %2$s? A sunken ship! This glorious vessel once sailed under the flag of the legendary Eastern Alliance Company. Can you believe it?",
  "odd.dialogue.location.shipwreck/2": "Psst! You won't believe what I just overheard. Some lucky fishermen discovered a shipwreck at %2$s. Now, I've got a hunch there might be some hidden treasure lurking beneath those waves. How exciting!",
  "odd.dialogue.location.shipwreck_beached/1": "Whoa, dude! You've gotta check out the totally gnarly shipwreck at %2$s! It's like, totally ruined and washed up on the beach. You seriously can't miss it, man.",
  "odd.dialogue.location.shipwreck_beached/2": "Hey there, adventurer! If you head on over to %2$s, you'll stumble upon this insane shipwreck right on the shore. I mean, seriously, how did that thing end up there? It's totally mind-boggling!",
  "odd.dialogue.location.village_desert/1": "Oh, don't you dare step foot into that scorching desert! There's a village over yonder, but it's like a mirage in the sand!",
  "odd.dialogue.location.village_taiga/1": "Oh, you won't believe it! Over yonder lies another splendid village, nestled amidst the enchanting embrace of the luscious taiga biome.",
  "odd.dialogue.location.village_taiga/2": "Listen up, my dear friend! Journey forth to %2$s and you shall stumble upon a hidden gem of a village. It's a mystical place, hidden deep within the untamed heart of the taiga biome. Trust me on this one, it's a sight to behold!",
  "odd.dialogue.location.village_snowy/1": "Woah, dude! You won't believe it, but there's this totally gnarly village at %2$s. It's like, the chilliest place ever, man!",
  "odd.dialogue.location.village_snowy/2": "Dude, I gotta tell ya, there's this rad village at %2$s in the freezing snowy plains. The folks there are like, super cool, but man, it's like living in an icebox!",
  "odd.dialogue.location.village_plains/1": "Oh, you won't believe the marvelous village that lies at %2$s! It's simply enchanting.",
  "odd.dialogue.location.village_plains/2": "Ah, yes! Venturing into the vast plains at %2$s will lead you to yet another charming village. It's truly a sight to behold.",
  "odd.dialogue.location.village_savanna/1": "Whoa, dude, you won't believe it! Over yonder, there's another village, man. But let me tell ya, it's like a sauna over there. Super duper scorching hot, bro!",
  "odd.dialogue.location.village_savanna/2": "Hey, listen up! In that savanna place at %2$s, there's this other village, right? And let me tell ya, the folks there are just the coolest cats around. Seriously, they're like the epitome of chillness, man!",
  "odd.dialogue.location.swamp_hut/1": "The swamp at %2$s? Oh, you better stay far away from that creepy joint if you know what's good for you. That witch in there is more trouble than a swarm of creepers.",
  "odd.dialogue.location.swamp_hut/2": "Listen, buddy, take my advice and steer clear of %2$s. There's this cursed hut owned by that wicked witch, and I swear it's like a nightmare come to life. Trust me, you don't want to be caught dead anywhere near that place.",
  "odd.dialogue.location.mineshaft/1": "Hey there, buddy! So, here's the deal. Once upon a time, we had this rocking mine around these parts. But guess what? It had to shut down after this totally insane accident. Keep your eyes peeled, it's gotta be somewhere around %2$s.",
  "odd.dialogue.location.mineshaft/2": "Ohh, you won't believe this wild story! We had this epic mine, right? Picture this",
  "odd.dialogue.location.jungle_pyramid/1": "Watch out, mate! There's this wicked old temple at %2$s in the jungle. Seriously, don't even think about going in there unless you want to be a human pin cushion for trap arrows.",
  "odd.dialogue.location.jungle_pyramid/2": "Hey, fancy pants! Just a heads up, there's this legendary temple in the nearby jungle at %2$s. It's like stepping into a death maze, complete with ancient traps that would make Dr. Jones himself quiver in his boots. You've been warned!",
  "odd.dialogue.location.pillager_outpost/1": "Oh, great! We've got a lovely gang of Pillagers at %2$s. They thought it would be a blast to set up camp right next to us. Can you believe the nerve? Maybe they'll give us a little break before they attack again. Fingers crossed!",
  "odd.dialogue.location.pillager_outpost/2": "You won't believe it, but there's this quirky outpost run by pillagers at %2$s. They're like our noisy neighbors from hell. Don't even think about going near that place unless you have a death wish. Those trigger-happy maniacs will shoot you on the spot. Fun times!",
  "odd.dialogue.location.pillager_outpost/3": "Hey there, adventure seeker! If you're feeling brave enough to venture into the treacherous land of %2$s, be prepared to face an outpost swarming with pillagers. Those despicable rogues love to play dress-up and pretend they're tough. If you manage to come out victorious, you might stumble upon some half-decent loot. The whole village would be eternally grateful if you could rid us of those pests.",
  "odd.dialogue.location.ancient_city/0": "Oh, you won't believe the strange sounds I heard at %2$s! It was like a chorus of singing Endermen and squawking chickens, all mixed into one chaotic symphony. Truly bizarre!",
  "odd.dialogue.location.ancient_city/1": "You know, I have this peculiar feeling that %2$s is hiding something extraordinary beneath its very core. I can almost sense the vibrations of secret passageways and mysterious caverns, just waiting to be discovered!",
  "odd.dialogue.location.ancient_city/3": "Have you heard the tales? They speak of an ancient city at %2$s, but oh, my dear friend, it's not just a city. It's a labyrinth of winding catacombs and enchanted tunnels, camouflaged beneath the very earth! Don't fret if you can't see it, for it's a realm shrouded in secrecy and wonder.",

  "odd.dialogue.joke.monster.success/1": "Bwahaha! That Skelly never stood a chance against me, puny creature!",
  "odd.dialogue.joke.monster.success/2": "Can you believe it? That feeble-minded zombie thought it could take me down with a shovel! Hohoho!",
  "odd.dialogue.joke.monster.success/3": "Witness the power! The spider thought it could intimidate me, but I put it in its place! Hehehe!",
  "odd.dialogue.joke.monster.success/4": "Bravo, my friend! You managed to orchestrate a skeleton defeating a creeper! Marvelous, haha!!",
  "odd.dialogue.joke.monster.success/5": "Look at those clueless cave spiders, falling right into my trap! Mwahahaha!",
  "odd.dialogue.joke.monster.failed/1": "Oh, you think skeletons are sentient beings? How utterly preposterous! I suppose next you'll tell me the cows are secretly running the village!",
  "odd.dialogue.joke.monster.failed/2": "Can you believe it? Someone actually cracking jokes about creeper explosions in this day and age! How cliché and unimaginative!",
  "odd.dialogue.joke.monster.failed/3": "Did you know that zombies and skeletons were once humans? Fascinating, isn't it? Makes you think twice before swinging that sword, doesn't it?",
  "odd.dialogue.joke.monster.failed/4": "Oh, how absolutely riveting. An enderman fell into water. I can hardly contain my excitement. Truly, the pinnacle of entertainment.",
  "odd.dialogue.joke.monster.failed/5": "My oh my, another witty silverfish-on-the-toilet joke! How delightfully bizarre! If I had a single emerald for every time I heard that one, I'd be the wealthiest villager in all of Minecraft!",

  "odd.dialogue.joke.animal.success/1": "What an unfortunate turn of events for the wool-less sheep! But hey, you gotta admit, it's a sheepishly funny situation!",
  "odd.dialogue.joke.animal.success/2": "Can you believe it? The wolf actually developed a crush on the sheep! Talk about a twisted love story!",
  "odd.dialogue.joke.animal.success/3": "I'm telling you, chickens are the underdogs of comedy! Who knew they had the talent to pull off something so ridiculously hilarious?",
  "odd.dialogue.joke.animal.success/4": "Ha! That's just pure stupidity wrapped in a blanket of comedy gold! I absolutely adore it, in all its nonsensical glory!",
  "odd.dialogue.joke.animal.success/5": "Thank the Minecraft heavens for the cows and their never-ending milk supply! It's like a miraculous liquid treasure just waiting to be poured into our bowls of fortune!",
  "odd.dialogue.joke.animal.failed/1": "Oh, come on now, lighten up! Jokes are like the spice of life, even if they're a little twisted.",
  "odd.dialogue.joke.animal.failed/2": "Hahaha, that sheep must have felt like it stumbled into a comedy club! Comedy gold, my friend!",
  "odd.dialogue.joke.animal.failed/3": "Whoa, whoa, whoa! Watch your words, buddy! My pig is a sensitive soul and doesn't appreciate your dark humor.",
  "odd.dialogue.joke.animal.failed/4": "Well, that's certainly a unique sense of humor you got there. I'll give you that!",
  "odd.dialogue.joke.animal.failed/5": "Haha, look at that cow with those fabulous eyebrows! I bet it's the talk of the barnyard fashion scene!",

  "odd.dialogue.flirt.slap/1": "Pardon your impudence!",
  "odd.dialogue.flirt.slap/2": "Were you raised by a clumsy creeper on how to charm the villagers?!",
  "odd.dialogue.kiss.slap/1": "Oh, you've really crossed the line!",
  "odd.dialogue.kiss.slap/2": "Give it another shot, and I promise you'll regret it for a lifetime!",

  "odd.dialogue.chat.plains/1": "Who needs other biomes when you've got the plains? I mean, why bother with all that traveling nonsense?",
  "odd.dialogue.chat.plains/2": "The plains may not be as thrilling as some biomes, but hey, peace and quiet is highly underrated these days.",
  "odd.dialogue.chat.plains/3": "You know, when the sun sets over the plains, it's like a whole new world of beauty unfolds. It's almost magical, I tell ya.",
  "odd.dialogue.chat.plains/4": "Forget about all the hustle and bustle, sometimes I just wanna lie down and gaze at the sky. It's my version of meditation, you know?",
  "odd.dialogue.chat.plains/5": "Let me tell ya, the air in the plains is so crisp and pure, it puts those taiga folks to shame. I swear, it's like breathing in liquid gold.",
  "odd.dialogue.chat.plains/6": "Sure, the plains may be lacking in excitement, but there's something to be said about simplicity. It's like a breath of fresh air in a chaotic world.",
  "odd.dialogue.chat.plains/7": "Ah, the weather brings back memories of my flower-picking escapades as a kid. I used to woo my crush with bouquets. Worked like a charm, if I do say so myself.",
  "odd.dialogue.chat.plains/8": "Honestly, watching the sunrise in the plains is like witnessing a masterpiece unfold before your very eyes. Trust me, it's worth setting the alarm for.",
  "odd.dialogue.chat.savanna/1": "Phew, it's scorching out here in this savanna, but hey, who needs winter anyway? We're living in the land of eternal heatwaves!",
  "odd.dialogue.chat.savanna/2": "Ugh, those llamas! They're a constant source of annoyance, but I guess I've learned to tolerate them. It's all part of the savanna package, I guess.",
  "odd.dialogue.chat.savanna/3": "Have you seen the architecture around here? It's like nothing you've ever seen before! The savanna's got its own unique style, and that's why I'm here, soaking it all in.",
  "odd.dialogue.chat.savanna/4": "Oh, don't you dare underestimate the savanna biome! Sure, it may seem plain and generic at first glance, but trust me, it's got hidden treasures. You just have to know where to look!",
  "odd.dialogue.chat.savanna/5": "Forget about the desert villages and their boring sandstorms. We may not get any rain, but guess what? We've got rivers! Take that, parched folks!",
  "odd.dialogue.chat.savanna/6": "You won't believe the bizarre hills and terrains we've got here! It's like a rollercoaster ride for the eyes. Pure insanity, but in a fascinating way!",
  "odd.dialogue.chat.savanna/7": "Phew, when the temperature rises, those acacia trees are a lifesaver! They provide such cool shade, it's like having a personal oasis in this blazing savanna.",
  "odd.dialogue.chat.savanna/8": "You won't find better melons and pumpkins anywhere else in the world. Our savanna villages are like the produce capital of Minecraft! We trade 'em all day, every day!",
  "odd.dialogue.chat.taiga/1": "I can't get enough of these woods! They're like my personal treasure trove. Who needs diamonds when you have all this building material, firewood, and hunting grounds?",
  "odd.dialogue.chat.taiga/2": "People complain about the cold in the taiga biome, but I thrive in it! This frosty paradise has everything I could ever want. I wouldn't trade it for all the gold in the world!",
  "odd.dialogue.chat.taiga/3": "Taiga forests are like the coolest thing ever! You wouldn't believe the insane amount of sweet berries we have here. It's like living in a candy wonderland!",
  "odd.dialogue.chat.taiga/4": "Oh, let me tell you about the foxes in these taiga forests. They're my little partners in crime. Sometimes I even spoil them with sweet berries, just to keep their mischievous spirit alive.",
  "odd.dialogue.chat.taiga/5": "You won't believe how chill the wolves are around here. With so much food available, they practically roll over and beg for treats. It's like having a pack of fluffy, loyal friends!",
  "odd.dialogue.chat.taiga/6": "Ah, breathe in that rejuvenating air! The taiga's crispness hits you like a burst of pure energy. It's like having your own personal spa retreat, 24/7.",
  "odd.dialogue.chat.taiga/7": "Those sweet berry bushes may have the most delicious treats, but let me tell you, getting pricked by one is like a thousand tiny needles stabbing into your skin. It's a bittersweet relationship, I tell you.",
  "odd.dialogue.chat.taiga/8": "Rain in the taiga may freeze your bones, but it's the epitome of tranquility. Standing outside, feeling the cold droplets on your face, it's like a soothing lullaby for the soul.",
  "odd.dialogue.chat.snowy_plains/1": "Brrr, it's chilly around here, but I can handle it. I've got enough layers on to rival an Arctic explorer!",
  "odd.dialogue.chat.snowy_plains/2": "Can you believe how frigid it is? But hey, at least my icicle collection is growing faster than my sanity. Hehe!",
  "odd.dialogue.chat.snowy_plains/3": "This weather is fit for hibernating like a bear! I'll just bundle up in a snuggie and binge-watch shows by the roaring fireplace.",
  "odd.dialogue.chat.snowy_plains/4": "Ah, I reminisce about the good old days when snowball fights were epic battles, and the snowmen reigned supreme! Oh, the nostalgia!",
  "odd.dialogue.chat.snowy_plains/5": "Ugh, those strays! They're more annoying than a fly buzzing in your ear. And their arrows? Total snowflakes, if you ask me.",
  "odd.dialogue.chat.snowy_plains/6": "Psst, keep an eye out for the wolves lurking nearby. The village guards are practically howling in fear!",
  "odd.dialogue.chat.snowy_plains/7": "You won't believe it, but touching an iron golem is like getting your hand stuck in a medieval bear trap. No escape till sundown!",
  "odd.dialogue.chat.snowy_plains/8": "Ah, my childhood memories...we'd carve pumpkins for pie, and then those jack-o'-lanterns would come to life as snow golems! The best of both worlds!",
  "odd.dialogue.chat.desert/1": "Man, it's scorching in this desert! But hey, at least we never have to deal with freezing our butts off in the winter.",
  "odd.dialogue.chat.desert/2": "This desert is like a permanent sauna, always warm and toasty.",
  "odd.dialogue.chat.desert/3": "Ugh, this desert heat is merciless! I'll forever be rocking a deep-fried complexion or a crispy sunburn.",
  "odd.dialogue.chat.desert/4": "Who needs air conditioning when you have the desert nights? The stars are like a free light show and it's cooler than an ice cream parlor.",
  "odd.dialogue.chat.desert/5": "Holy smokes! Today's sun is on a mission to turn us all into human french fries.",
  "odd.dialogue.chat.desert/6": "Goodness gracious! What on earth is up with the sun today? It's like a fiery ball of fury.",
  "odd.dialogue.chat.desert/7": "Yo, have you spotted any rabbits around here? Those sneaky buggers are like desert ninjas!",
  "odd.dialogue.chat.desert/8": "Let me tell ya, living here means dealing with those pesky husks. They smack you and suddenly you're hungrier than a pack of wolves! It's ridiculous!",
  "odd.dialogue.chat.desert/9": "Ouch! Stepped on a cactus the other day, and boy, did it let me know who's boss. Gotta watch your every step in this prickly paradise!",
  "odd.dialogue.chat.desert/10": "Life in this bone-dry desert ain't no walk in the park, but thank goodness we have this village to keep us hydrated and fed.",

  "odd.dialogue.story.exploring.success/1": "No way! I'm totally gonna conquer the world someday, mark my words!",
  "odd.dialogue.story.exploring.success/2": "Whoa! The thought of exploring and traveling just gets my adrenaline pumping! I mean, sure, I love my village and all, but the wanderlust is real!",
  "odd.dialogue.story.exploring.success/3": "Seriously, you're like a fearless warrior, venturing into the great unknown like a boss! Hats off to you!",
  "odd.dialogue.story.exploring.fail/1": "Ugh, here we go again with your tired old tales. Boring!",
  "odd.dialogue.story.exploring.fail/2": "Oh my, aren't you the daring one with your sharp edges. Careful not to hurt yourself, tough guy! Haha!",
  "odd.dialogue.story.exploring.fail/3": "Conversing with you is akin to conversing with an overly pretentious toddler, who believes they are destined to become the ruler of the universe. Minus the charm, of course.",

  "odd.dialogue.story.nether.success/1": "Is it, like, totally scorching over there?!",
  "odd.dialogue.story.nether.success/2": "Oh my gosh, you're, like, a total daredevil surviving in that, like, super dangerous place. I'm like, totally blown away.",
  "odd.dialogue.story.nether.success/3": "I've heard rumors about the Nether being packed with, like, epic loot for those who can muster the courage to venture in. If only I had the guts, you know?",
  "odd.dialogue.story.nether.success/4": "Woah, you must be, like, the bravest soul ever to set foot in that place. Do you, like, even get scared? Not that I would ever admit it...",
  "odd.dialogue.story.nether.success/5": "Have you, like, totally spotted one of those Zombified Piglins?",
  "odd.dialogue.story.nether.fail/1": "Don't even bother trying to pretend you've been to the Nether. I can see right through your pitiful lies.",
  "odd.dialogue.story.nether.fail/2": "Oh, so you're the one that got mauled by those Piglins? It's no surprise, really. Your incompetence is legendary.",
  "odd.dialogue.story.nether.fail/3": "It doesn't matter if you've been to the Nether or not. Your storytelling skills are so abysmal, even a toddler could put you to shame.",
  "odd.dialogue.story.nether.fail/4": "Look at you, all feeble and weak. The Nether would eat you alive. You're better off staying in your cozy little village.",
  "odd.dialogue.story.nether.fail/5": "Your grandpa explored the Nether? Well, he must have conveniently forgotten to mention the warped fungus then. You're nothing but a pathetic fabricator of tales.",

  "odd.dialogue.story.enderdragon.success/1": "Unbelievable! And did you manage to snatch that dragon egg like a true adventurer?",
  "odd.dialogue.story.enderdragon.success/2": "Goodness gracious! So you actually went ahead and slayed that colossal beast, did you? The entire village will be buzzing about your legendary feat for centuries to come!",
  "odd.dialogue.story.enderdragon.fail/1": "Pfft! Are you off your rocker? The ender dragon is like, totally made up, man.",
  "odd.dialogue.story.enderdragon.fail/2": "Seriously? You're pulling my leg, right? No way any puny mortal could even touch that majestic dragon! It's like impossible, dude.",

  "odd.dialogue.story.wither.success/1": "No way! The Wither is like a one-way ticket to absolute chaos!",
  "odd.dialogue.story.wither.success/2": "Woah, hold up! You actually took down the Wither? That's like, mind-blowing!",
  "odd.dialogue.story.wither.fail/1": "I ain't buying what you're selling, buddy.",
  "odd.dialogue.story.wither.fail/2": "Nah, you seem way too intact to convince me otherwise, pal.",

  "odd.dialogue.stay.fail/1": "No way, I'm the thrill-seeker extraordinaire!",
  "odd.dialogue.stay.fail/2": "Appreciate the offer, but I'd rather be out there conquering the unknown!",
  "odd.dialogue.stay.fail/3": "This village is lovely and all, but I'm the restless explorer kind.",
  "odd.dialogue.stay.repeat/1": "Didn't I already answer that for you? I've got the memory of an elephant, you know!",
  "odd.dialogue.stay.repeat/2": "Oh, dear me! I've already been asked that before. Can't you come up with something a bit more thrilling?",
  "odd.dialogue.stay.success/1": "Much obliged, I positively relish the idea of residing in this charming village!",
  "odd.dialogue.stay.success/2": "Fantabulous! I am absolutely smitten with the notion of planting my roots in this marvelous village!",
  "odd.dialogue.stay.no_space/1": "Ugh, can you believe how cramped this village is? It's like everywhere I turn, I'm bumping into someone.",
  "odd.dialogue.stay.no_space/2": "I totally would've stuck around, but seriously, there's a bed shortage crisis going on here. No cozy spot for me.",

  "odd.dialogue.hire/1": "Alrighty then, just give me a holler whenever you're in a bind. I'll be floating around, waiting for my payday, of course.",
  "odd.dialogue.hire/2": "Groovy! Give me a shout when you require my exquisite services. I'll be chillin' here, eagerly awaiting those shiny emeralds!",
  "odd.dialogue.hire/3": "Awesome-sauce! Prepare to be dazzled! Just make sure those emeralds are primed and ready for my arrival, my fine friend!",
  "odd.dialogue.no_money/1": "Sorry, but you can't afford my exceptional talents with your paltry supply of emeralds.",
  "odd.dialogue.no_money/2": "Oh, honey, your emerald stash is as empty as your chances of hiring me.",
  "odd.dialogue.no_money/3": "Darling, I hate to break it to you, but you couldn't even hire a chicken with those few sad emeralds you've got there.",

  "odd.dialogue.main.rock_paper_scissor/1": "Prepare yourself for an epic clash of intellects as we indulge in the timeless game of Rock Paper Scissor, my magnificent friend!",
  "odd.dialogue.rock_paper_scissor/1": "Alright, get ready for the ultimate showdown of rock, paper, scissors! Prepare to be annihilated, puny human!",
  "odd.dialogue.rock_paper_scissor/2": "Oh, I can sense your confidence, but it won't save you from my unbeatable strategy this time! Prepare to witness your defeat!",
  "odd.dialogue.rock_paper_scissor.rock/1": "You dare challenge the rock master? Foolish mortal!",
  "odd.dialogue.rock_paper_scissor.paper/1": "Oh, the splendor of paper! A magnificent force that shall outwit and outmaneuver any who challenge its supremacy!",
  "odd.dialogue.rock_paper_scissor.scissor/1": "With a swift flick, I shall strike you down with my deadly scissor!",
  "odd.dialogue.rock_paper_scissor.loose.rock/1": "Ha! I've outsmarted you with my cunning paper choice! I am unstoppable!",
  "odd.dialogue.rock_paper_scissor.loose.paper/1": "Oh, please! Scissors are my absolute favorite! I can't resist their sharpness!",
  "odd.dialogue.rock_paper_scissor.loose.scissor/1": "Witness the devastation caused by my rock! Your scissors never stood a chance against me!",
  "odd.dialogue.rock_paper_scissor.win.rock/1": "Oh no, my poor scissor got completely obliterated by that rock! I'm such a loser!",
  "odd.dialogue.rock_paper_scissor.win.paper/1": "Why does paper always have my number?",
  "odd.dialogue.rock_paper_scissor.win.scissor/1": "Huzzah! Your trusty scissors have proven mightier than my defenseless paper. I bow down to your superior skill, my formidable opponent!",
  "_": ""
}