{
    "sodium.console.broken_nvidia_driver": "Die Treiber der NVIDIA-Grafikkarte sind veraltet!\\n * Dies führt zu schwerwiegenden Leistungsproblemen und Abstürzen, wenn Sodium installiert ist.\\n * Es wird empfohlen, die Grafiktreiber auf die neueste Version (Version 536.23 oder neuer) zu aktualisieren.",
    "sodium.console.config_file_was_reset": "Die Konfigurationsdatei wurde auf funktionierende Standardwerte zurückgesetzt.",
    "sodium.console.config_not_loaded": "Die Konfigurationsdatei für Sodium ist beschädigt oder derzeit nicht lesbar. Einige Optionen wurden vorübergehend auf ihre Standardwerte zurückgesetzt. Dieses Problem kann unter dem Menüpunkt „Videoeinstellungen“ behoben werden.",
    "sodium.console.core_shaders_error": "Die folgenden Ressourcenpakete sind mit Sodium nicht kompatibel:",
    "sodium.console.core_shaders_info": "Ausführliche Informationen können in den Protokolldateien gefunden werden.",
    "sodium.console.core_shaders_warn": "Die folgenden Ressourcenpakete sind möglicherweise nicht mit Sodium kompatibel:",
    "sodium.console.game_restart": "Um eine oder mehrere geänderte Videoeinstellungen anzuwenden, muss das Spiel neu gestartet werden!",
    "sodium.option_impact.extreme": "Extrem",
    "sodium.option_impact.high": "Hoch",
    "sodium.option_impact.low": "Gering",
    "sodium.option_impact.medium": "Mittel",
    "sodium.option_impact.varies": "Unterschiedlich",
    "sodium.options.animate_only_visible_textures.name": "Nur sichtbare Texturen animieren",
    "sodium.options.animate_only_visible_textures.tooltip": "Wenn aktiviert, werden nur die animierten Texturen, die im aktuellen Bild sichtbar sind, aktualisiert. Dies kann auf mancher Hardware zu einer erheblichen Leistungssteigerung führen, insbesondere bei großen bzw. hochauflösenden Ressourcenpaketen. Falls die Animation einiger Texturen nicht (korrekt) dargestellt wird, kann es helfen, diese Option zu deaktivieren.",
    "sodium.options.biome_blend.tooltip": "Der Abstand (in Blöcken), über den die Farben der Biome sanft überblendet werden. Die Verwendung höherer Werte erhöht die Zeit, die zum Laden oder Aktualisieren von Chunks benötigt wird, erheblich, verbessert die Qualität aber immer weniger.",
    "sodium.options.biome_blend.value": "%s Block",
    "sodium.options.buttons.donate": "Kauf' uns einen Kaffee!",
    "sodium.options.buttons.undo": "Rückgängig",
    "sodium.options.cpu_render_ahead_limit.value": "%s Frame(s)",
    "sodium.options.entity_shadows.tooltip": "Wenn aktiviert, werden einfache Schatten unter Kreaturen und anderen beweglichen Objekten dargestellt.",
    "sodium.options.leaves_quality.name": "Laub",
    "sodium.options.pages.advanced": "Erweitert",
    "sodium.options.pages.quality": "Qualität",
    "sodium.options.performance_impact_string": "Leistungseinbußen: %s",
    "sodium.options.use_no_error_context.name": "„Kein Fehlerkontext“ verwenden",
    "sodium.options.use_no_error_context.tooltip": "Wenn aktiviert, wird der OpenGL-Kontext mit deaktivierter Fehlerprüfung erstellt. Dies verbessert die Rendering-Leistung geringfügig, aber es kann die Fehlersuche bei plötzlichen, unerklärlichen Abstürzen erheblich erschweren.",
    "sodium.options.use_persistent_mapping.name": "Persistentes Mapping verwenden",
    "sodium.options.use_persistent_mapping.tooltip": "Nur zur Fehlerbestimmung („Debugging“) verwenden. Wenn aktiviert, werden persistente Speicherzuordnungen für den Staging-Puffer-Speicher verwendet, sodass unnötige Speicherkopien vermieden werden können. Das Deaktivieren dieser Option kann hilfreich sein, um die Ursache von Grafikfehlern einzugrenzen. \\n\\n Erfordert OpenGL 4.4 oder ARB_buffer_storage.",
    "sodium.options.v_sync.tooltip": "Wenn diese Option aktiviert ist, wird die Bildrate des Spiels mit der Bildwiederholfrequenz des Monitors synchronisiert, was zu einem grundsätzlich flüssigeren Spielerlebnis führt, allerdings auf Kosten der allgemeinen Eingabelatenz. Diese Einstellung kann auf zu langsamen Systemen die Leistung verringern.",
    "sodium.options.vignette.name": "Vignette",
    "sodium.options.vignette.tooltip": "Wenn aktiviert, wird ein Vignetteneffekt angewendet, wenn sich der Spieler in dunkleren Bereichen befindet, wodurch das Gesamtbild dunkler und dramatischer wird."
}