{
    "sodium.console.broken_nvidia_driver": "Vos pilotes graphiques NVIDIA ne sont pas à jour !\\n  * Cela provoquera des problèmes de performance graves et des plantages lorsque Sodium est installé.\\n  * Veuillez mettre à jour vos pilotes graphiques à la dernière version (version 536.23 ou plus récente.)",
    "sodium.console.game_restart": "Le jeu doit être redémarré pour appliquer un ou plusieurs paramètres vidéo !",
    "sodium.console.pojav_launcher": "PojavLauncher n'est pas pris en charge lors de l'utilisation de Sodium.\\n  * Il est très probable que vous rencontriez des problèmes de performance extrêmes, des bugs graphiques et des plantages.\\n  * Vous serez livrés à vous-mêmes si vous décidez de continuer -- nous ne vous aiderons pas avec les bugs ou les plantages !",
    "sodium.option_impact.extreme": "Extrême",
    "sodium.option_impact.high": "Élevé",
    "sodium.option_impact.low": "Faible",
    "sodium.option_impact.medium": "Moyen",
    "sodium.option_impact.varies": "Variable",
    "sodium.options.always_defer_chunk_updates.name": "Forcer les mises à jour de chunk différées",
    "sodium.options.animate_only_visible_textures.name": "Animer uniquement les textures visibles",
    "sodium.options.attack_indicator.tooltip": "Définit la position de la jauge d'attaque sur l'écran.",
    "sodium.options.autosave_indicator.tooltip": "Si activée, un message sera affiché quand le jeu sauvegarde le monde sur le disque.",
    "sodium.options.biome_blend.value": "%s bloc(s)",
    "sodium.options.brightness.tooltip": "Définit la luminosité (gamma) du jeu.",
    "sodium.options.buttons.donate": "Offrez-nous un café !",
    "sodium.options.buttons.undo": "Annuler",
    "sodium.options.chunk_update_threads.name": "Threads de mise à jour de chunks",
    "sodium.options.cpu_render_ahead_limit.name": "Limite de pré-rendu CPU",
    "sodium.options.cpu_render_ahead_limit.value": "%s frame(s)",
    "sodium.options.entity_shadows.tooltip": "Si activée, des ombres simples seront affichées sous les mobs et autres entités.",
    "sodium.options.fullscreen.tooltip": "Si activée, le jeu sera affiché en plein écran (si supporté).",
    "sodium.options.graphics_quality.tooltip": "Les paramètres de graphismes par défaut contrôlent des options de compatibilité qui peuvent servir pour certains mods. Si les options ci-dessous sont laissées à \"Par défaut\", elles utiliseront ce paramètre.",
    "sodium.options.leaves_quality.name": "Feuilles",
    "sodium.options.pages.advanced": "Avancé",
    "sodium.options.pages.quality": "Qualité",
    "sodium.options.particle_quality.tooltip": "Définit le nombre maximum de particules qui peuvent être présentes à l'écran à chaque instant.",
    "sodium.options.performance_impact_string": "Impact sur les performances: %s",
    "sodium.options.simulation_distance.tooltip": "La distance de simulation définit jusqu'où le terrain et les entités pourront être chargés et mis à jour. Une distance plus courte peut réduire la charge du serveur interne et améliorer le framerate.",
    "sodium.options.use_block_face_culling.name": "Masquage des faces invisibles de blocs",
    "sodium.options.use_entity_culling.name": "Masquage des entités invisibles",
    "sodium.options.use_fog_occlusion.name": "Permettre l'obstruction par le brouillard",
    "sodium.options.use_fog_occlusion.tooltip": "Si activée, les chunks déterminés comme étant complètement cachés par l'effet de brouillard ne seront pas affichés, améliorant ainsi les performances. Lorsque le brouillard est épais (par exemple sous l'eau), l'impact en sera d'autant plus important. Cependant, parfois, cette option peut résulter en des artéfacts visuels entre le brouillard et le ciel.",
    "sodium.options.use_no_error_context.name": "Utiliser le contexte sans erreur",
    "sodium.options.use_persistent_mapping.name": "Utiliser le mappage persistant",
    "sodium.options.v_sync.tooltip": "Si activée, le framerate du jeu sera synchronisé au taux de rafraîchissement de l'écran, ce qui résulte généralement en une expérience plus fluide au coût d'une latence d'entrée plus élevée. Cette option peut dégrader les performances si votre machine est trop lente.",
    "sodium.options.view_distance.tooltip": "La distance d'affichage définit jusqu'où le terrain pourra être affiché. Une distance de rendu plus courte améliora la fréquence d'images en réduisant la quantité de terrain à afficher.",
    "sodium.options.vignette.name": "Vignette"
}