{
  "sleepy.dialogue.main/1": "Oh, hey there...yawn...sorry, I'm a bit sleepy.",
  "sleepy.dialogue.main/2": "Hey...zzz...how's it going? I could use a nap right about now.",
  "sleepy.dialogue.main/3": "Oh, hi...yawn...good to see you, I guess.",
  "sleepy.dialogue.main/4": "What's up...yawn...with you today? I'm struggling to keep my eyes open.",
  "sleepy.dialogue.main/5": "How are you today? I'm...zzz...struggling to stay awake.",
  "sleepy.dialogue.main/6": "Hey there, %1$s...zzz...anything exciting happening? I could use a jolt of caffeine.",
  "sleepy.dialogue.main/7": "So, I was hanging out with %supporter%...zzz...and he got bit by a zombie. I think I fell asleep during that story...oh, look, a zombie!",

  "sleepy.dialogue.rumors.failed/1": "Sorry, I'm too drowsy to process any new info.",
  "sleepy.dialogue.rumors.lore/1": "Even though Jax is still worshipped, I heard that the worship of Sirben is increasing and his prophets MerlinWolfGames and Crow are going all out to spread his words. But you know, I think they could use a nice long nap to recharge their divine batteries, if you catch my drift.",
  "sleepy.dialogue.rumors.lore/2": "Ugh, Cyberdemons once tried to invade us by sneaking into the Overworld with Portals. Can you believe it? Thankfully, Sirben and Luke stepped up and put an end to that nightmare. It's like they fought off the invasion in their sleep or something.",
  "sleepy.dialogue.rumors.lore/3": "So, get this. After getting tangled up in the disappearance of the Ancient Builder, I heard rumors that 2DA50 decided to take a little snooze and venture off to the Far Lands. And you know what? No one has heard a peep from them since. Talk about the ultimate power nap.",
  "sleepy.dialogue.rumors.lore/4": "You won't believe what I saw. MerlinWolfGames went and built a whole temple devoted to Sirben. I mean, seriously, talk about dedication. But you know what? I bet ol' Merlin could use a nice, cozy nap after working on such a grand project.",
  "sleepy.dialogue.rumors.lore/5": "You know, there used to be this ancient race of builders around here. But guess what? They're all gone now. I guess they must have gotten tired of building and decided to hit the hay for good. Can't say I blame them, to be honest.",
  "sleepy.dialogue.rumors.lore/6": "Hey, have you heard the sleepy legends of the ancient builders? You know, the ones who left behind all those ruins and temples scattered across the Overworld? It's like they were so exhausted from their building spree that they just collapsed into sleep and vanished into thin air. Now that's what I call a power nap for the ages.",

  "sleepy.dialogue.first.generic/1": "Huh? Whoa, I'm not used to seeing you here. Welcome, I guess.",
  "sleepy.dialogue.first.generic/2": "Oh man, you're new, right? Cool, cool, I guess it's nice to have someone different around.",
  "sleepy.dialogue.first.generic/3": "Ugh, finally, someone new! It's like a breath of fresh air, I tell ya.",
  "sleepy.dialogue.first.generic/4": "Welcome to this sleepy village, stranger. Bet you got some wild tales to share, huh?",
  "sleepy.dialogue.first.generic/5": "Whoa, it's been ages since we had a visitor. Make yourself comfy, I guess.",
  "sleepy.dialogue.first.generic/6": "Oh hey, welcome to our snoozy little village. Seeing a new face is like a jolt of caffeine around here.",

  "sleepy.dialogue.first.question/1": "Oh...hello there. What brings you to this sleepy village?",
  "sleepy.dialogue.first.question/2": "Oh, someone new! What brings you to this place of eternal slumber?",
  "sleepy.dialogue.first.question/3": "Whoa...you an adventurer or something? How on earth did you manage to find this sleepy little village?",
  "sleepy.dialogue.first.exploring/1": "We don't have a lot to offer, but hey, feel free to crash here as long as you don't go causing any trouble.",
  "sleepy.dialogue.first.exploring/2": "As long as you don't go breaking any rules, you're more than welcome to stick around, my drowsy friend.",
  "sleepy.dialogue.first.exploring/3": "Traveler, just keep in mind that you better not step out of line if you plan on staying in our sleepy little village.",
  "sleepy.dialogue.first.settling/1": "It's..zzz...so good to..zzz..see another..zzz..face in the village!",
  "sleepy.dialogue.first.settling/2": "Welcome..zzz..to the village, neighbor! *yawns*",
  "sleepy.dialogue.first.settling/3": "Hap..zzz..py to have anoth..zzz..er helping hand around here!",
  "sleepy.dialogue.first.settling/4": "You..zzz..decided to..zzz..stay? Great! But..zzz..can we..zzz..talk later? Zzz...",
  "sleepy.dialogue.first.spent_night.success/1": "Oh, I can barely keep my eyes open, but you should check out our inn.",
  "sleepy.dialogue.first.spent_night.success/2": "Trust me, our inn is like a cozy cocoon of comfort. Perfect for recharging those drained batteries.",
  "sleepy.dialogue.first.spent_night.success/3": "If you're in dire need of a heavenly bed and scrumptious meals, look no further than our inn. It's a haven for weary souls like yourself.",
  "sleepy.dialogue.first.spent_night.failed/1": "Ah, apologies, weary traveler. Our humble village lacks the knowledge and vigor to construct a cozy inn for you.",
  "sleepy.dialogue.first.spent_night.failed/2": "Ah, dreadfully sorry, mate. No inn 'round these parts, I'm afraid. Sleepin' arrangements be scarce.",
  "sleepy.dialogue.first.spent_night.failed/3": "Perhaps, kind sir/madam, venturing toward a neighboring village might grant you a more successful hunting for a sanctuary of slumber.",

  "sleepy.dialogue.hug.success/1": "Been ages since I last laid eyes on you!",
  "sleepy.dialogue.hug.success/2": "Just what I needed, a hug to lull me into slumber.",
  "sleepy.dialogue.hug.success/3": "Amidst the haze of my sleepy state, you have brightened my day.",
  "sleepy.dialogue.hug.success/4": "You're like a cozy blanket, wrapping me up in a warm embrace!",
  "sleepy.dialogue.hug.success/5": "Ah, thank you kindly! *Returns hug, albeit in a dozy manner*",
  "sleepy.dialogue.hug.success/6": "My oh my, your embrace is like a toasty fireplace, warming my weary bones!",
  "sleepy.dialogue.hug.fail/1": "You're covered in soot and mud... *yawn*.",
  "sleepy.dialogue.hug.fail/2": "Meh, I'd rather not.",
  "sleepy.dialogue.hug.fail/3": "Huh? Can't I just stay in my cozy bed?",
  "sleepy.dialogue.hug.fail/4": "After you called me a dinosaur last week? I'd rather catch some more z's, thanks.",
  "sleepy.dialogue.hug.fail/5": "Frankly, you don't deserve a hug after you did that... but I'm too sleepy to even care.",
  "sleepy.dialogue.hug.fail/6": "Ugh, get off me! You have gross germs... *yawn*.",
  "sleepy.dialogue.hug.fail/7": "Oh? Uhm, thanks... I guess? Zzz...",

  "sleepy.dialogue.kiss.success/1": "I wish I could just stay in this kissing moment for eternity.",
  "sleepy.dialogue.kiss.success/2": "I reckon I might be head over heels for you...",
  "sleepy.dialogue.kiss.success/3": "Mmm, this smooch is as sweet as a lullaby!",
  "sleepy.dialogue.kiss.success/4": "Ah! Your lips are like a sleepy serenade, %1$s.",
  "sleepy.dialogue.kiss.success/5": "%1$s, your kisses are so dreamy, even better than a bedtime story! *yawns*",
  "sleepy.dialogue.kiss.fail/1": "Maybe... if no one's watching.",
  "sleepy.dialogue.kiss.fail/2": "Is that really how you kiss?",
  "sleepy.dialogue.kiss.fail/3": "Ash's kisses are like a dream compared to yours.",
  "sleepy.dialogue.kiss.fail/4": "Minty fresh breath, anyone? Just a suggestion.",
  "sleepy.dialogue.kiss.fail/5": "Umm... thanks, I guess?",
  "sleepy.dialogue.kiss.fail/6": "Get off me, I'm too sleepy for this.",

  "sleepy.dialogue.chat.success/1": "Ugh, cookies and milk...sounds so delicious...I wish I had the energy to get some.",
  "sleepy.dialogue.chat.success/2": "Yeah, I guess the weather is nice...but I'm too tired to really enjoy it.",
  "sleepy.dialogue.chat.success/3": "I'm doing...fine, I guess. But I stubbed my toe this morning...ugh, mornings are the worst.",
  "sleepy.dialogue.chat.success/4": "An apple a day...honestly, who has the energy for that? I'll stick with my lazy lifestyle.",
  "sleepy.dialogue.chat.success/5": "Building my own village sounds like a dream...but I'm just too lazy to lift a finger.",
  "sleepy.dialogue.chat.success/6": "I think I saw %Supporter% the other day...or was it just a dream? I need more sleep.",
  "sleepy.dialogue.chat.success/7": "My friend %Supporter% told me about finding a chest full of diamonds...but I'm too tired to be jealous.",
  "sleepy.dialogue.chat.success/8": "The weather is...remarkable, I guess. I'm too sleepy to appreciate it fully.",
  "sleepy.dialogue.chat.success/9": "I've lived here my whole life and those spiders and goblins...I couldn't care less. They can do their thing.",
  "sleepy.dialogue.chat.success/10": "Hmm, I wonder what happened to %Supporter%...but honestly, I'm too drowsy to investigate.",
  "sleepy.dialogue.chat.success/12": "Did you hear what happened to %Supporter% the other day? Yeah, me neither...I was probably napping.",
  "sleepy.dialogue.chat.success/13": "I've been meaning to adopt one of the stray cats...but napping seems more appealing right now.",
  "sleepy.dialogue.chat.success/14": "Redecorating my house sounds nice...but I'm too sleepy to even think about it.",
  "sleepy.dialogue.chat.success/15": "Kids? Yeah, maybe someday...if I can find the energy to find a partner first.",
  "sleepy.dialogue.chat.success/16": "I wonder where I'd be if I chose to live in the other village...probably still in bed.",
  "sleepy.dialogue.chat.success/17": "I miss my childhood sometimes...those were the days of endless napping and no responsibilities.",
  "sleepy.dialogue.chat.success/18": "Haven't talked to my parents in a while...I should visit them...maybe after my nap.",
  "sleepy.dialogue.chat.success/19": "I've been needing to travel to the other village...but honestly, the thought of leaving my bed is exhausting.",
  "sleepy.dialogue.chat.success/20": "Sometimes, I dream about this thing called cheese...it must be the ultimate comfort food.",
  "sleepy.dialogue.chat.fail/1": "Did you seriously just say that? -> Did... did you just say something? Sorry, I was half asleep.",
  "sleepy.dialogue.chat.fail/2": "I don't believe it exploded on its own. -> Yawn, I'm not buying that story. You must be dreaming.",
  "sleepy.dialogue.chat.fail/3": "You know, you're not that cool. -> You're not exactly the most exciting person to talk to, you know?",
  "sleepy.dialogue.chat.fail/4": "Show off. -> Wow, look at you, bragging like it's the Olympics... I'm so impressed. Yawn.",
  "sleepy.dialogue.chat.fail/5": "You should be thrown in a dungeon! -> You're lucky I'm too tired to argue with you. Otherwise, I'd send you straight to the land of snooze.",
  "sleepy.dialogue.chat.fail/6": "Ew. Go away, you dress like you're from the past. -> Ugh, your fashion sense is so last century... and that's being generous.",
  "sleepy.dialogue.chat.fail/7": "That is such a dumb thing to talk about. -> Yawn, can't we discuss something more interesting? Like the different shades of white paint drying.",
  "sleepy.dialogue.chat.fail/8": "Why are you talking to me again? -> Seriously, why are you bothering me? Can't you see I'm in dire need of a nap?",
  "sleepy.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I didn't care to listen. -> Sorry, but I'm in my own little dreamland right now. I'm not tuned in to your boring conversation.",
  "sleepy.dialogue.chat.fail/10": "Excuse me? -> Oh, sorry, I wasn't paying attention. Can you repeat that? Not that I really care, but still.",
  "sleepy.dialogue.chat.fail/11": "What is wrong with you? Why are you talking about this? -> Seriously, what's wrong with you? Why would anyone waste precious energy discussing such a pointless topic?",
  "sleepy.dialogue.chat.fail/12": "I've heard harsh things about you, I can kinda see why they think that. -> You know, I've heard some less-than-flattering things about you... and now I understand why.",
  "sleepy.dialogue.chat.fail/13": "Not even zombies will talk to you. -> You're so boring, even zombies would rather snooze than chat with you.",
  "sleepy.dialogue.chat.fail/14": "You're as unlikeable as a witch! -> You have the charm of a grumpy witch on a bad day... and that's saying something.",
  "sleepy.dialogue.chat.fail/15": "Don't talk to me or I will call the guards to move you away from me. -> If you don't stop talking to me, I might just have to call the sleep police to carry you far, far away from here.",
  "sleepy.dialogue.chat.fail/16": "Huh? Oh sorry",

  "sleepy.dialogue.story.success/1": "Oh wow, I can't believe all of that actually happened! I'm just struggling to keep my eyes open listening to this.",
  "sleepy.dialogue.story.success/2": "If only I had the energy to take on a creeper. I'd probably end up napping right in front of it.",
  "sleepy.dialogue.story.success/3": "That story was so good, I almost drifted off halfway through. Is it an original creation or did you borrow it from the dream world?",
  "sleepy.dialogue.story.success/4": "Wait, all of that excitement went down yesterday? I must have been in a deep slumber, completely oblivious.",
  "sleepy.dialogue.story.success/5": "I swear I was snoozing near there yesterday, how did I miss out on this juicy gossip?",
  "sleepy.dialogue.story.success/6": "Haha! That definitely sounds like %Supporter%! You know, they've got this uncanny ability to keep me wide awake, even when I'm on the verge of dozing off.",
  "sleepy.dialogue.story.success/7": "I've heard the Legend of %Supporter% a gazillion times, but I don't mind hearing it again. It's a surefire way to keep me from falling into a deep sleep.",
  "sleepy.dialogue.story.success/8": "Oooh! So that's how you stumbled upon your first diamond? I'm so intrigued, but also so ready to curl up and take a nap.",
  "sleepy.dialogue.story.success/9": "You should totally swing by later! I promise to stay awake while you share more stories. Well, at least I'll try my best to stay awake.",
  "sleepy.dialogue.story.fail/1": "*Yawns* That's my mother you're talking about.",
  "sleepy.dialogue.story.fail/2": "This is why the village whispers about you.",
  "sleepy.dialogue.story.fail/3": "I don't get it... *rubs eyes sleepily*",
  "sleepy.dialogue.story.fail/4": "You're terrible! Creepers need their beauty sleep too!",
  "sleepy.dialogue.story.fail/5": "How could you have the heart to harm a poor sheep?! *yawns again*",
  "sleepy.dialogue.story.fail/6": "*snoozing* Huh? What? Sorry, I dozed off for a second.",
  "sleepy.dialogue.story.fail/7": "How was that worth my precious sleep?",
  "sleepy.dialogue.story.fail/8": "*yawns dramatically* How dreadfully uninteresting.",
  "sleepy.dialogue.story.fail/9": "You're absolutely bonkers, and not in a delightful way...",
  "sleepy.dialogue.story.fail/10": "I fail to see how that was remotely satisfying... *yawns once more*",

  "sleepy.dialogue.flirt.success/1": "You're... s-so brave... *yawns*",
  "sleepy.dialogue.flirt.success/2": "Oh, you! *sleepily* Stop being so cute!",
  "sleepy.dialogue.flirt.success/3": "*Blushes, half-asleep* Do you mean it?",
  "sleepy.dialogue.flirt.success/4": "Oh, my... *mumbles in a drowsy tone* That was so adorable! You had me at \"hello\"...",
  "sleepy.dialogue.flirt.success/5": "How do you manage to look... so stunning... every day? When I look at you, I... *yawns*... become speechless...",
  "sleepy.dialogue.flirt.success/6": "Oh stop it... *yawning* You're making me blush...",
  "sleepy.dialogue.flirt.fail/1": "If you really expect me to believe that, prove it...zzz...",
  "sleepy.dialogue.flirt.fail/2": "Ugh... You tried that line with the baker, didn't you? So unoriginal...zzz...",
  "sleepy.dialogue.flirt.fail/3": "In a thousand lifetimes, maybe... But not today...zzz...",
  "sleepy.dialogue.flirt.fail/4": "Oh, how pitiful... You actually thought that would work on me?...zzz...",
  "sleepy.dialogue.flirt.fail/5": "Hah! A zombie stumbling around has a higher success rate than you...zzz...",
  "sleepy.dialogue.flirt.fail/6": "Nope. Absolutely not. End of story...zzz...",
  "sleepy.dialogue.flirt.fail/7": "Don't give me that look and spare me from ever hearing that again...zzz...",

  "sleepy.dialogue.joke.creative.success/1": "*Yawns* That's hilarious...zzz...",
  "sleepy.dialogue.joke.creative.success/2": "That's funny... *yawns*",
  "sleepy.dialogue.joke.creative.success/3": "That's the best I have ever heard... *yawns* but I'm too sleepy to laugh.",
  "sleepy.dialogue.joke.creative.success/4": "You might be funnier than %Supporter%...zzz... I can't even stay awake to judge.",
  "sleepy.dialogue.joke.creative.success/5": "Hahaha! Wow you're really funny! Have you ever thought of becoming a comedian? *rubs eyes* But I might fall asleep during your show...",
  "sleepy.dialogue.joke.creative.success/6": "BAHAHHA! That was the best joke I've heard in a long time! *yawns* I could use a nap now...",
  "sleepy.dialogue.joke.creative.success/7": "Teehee! You're definitely funnier than Ash... *yawns* Sorry for the lack of enthusiasm, I'm just so sleepy...",
  "sleepy.dialogue.joke.creative.success/8": "Ahah! That's actually pretty funny... *struggles to keep eyes open* but I might not remember it when I wake up...",
  "sleepy.dialogue.joke.creative.failed/1": "I suppose joking about that isn't the best idea, you know... *yawns*",
  "sleepy.dialogue.joke.creative.failed/2": "*yawns* Ha. Ha. So hilarious. Just what I needed to keep me wide awake.",
  "sleepy.dialogue.joke.creative.failed/3": "Wow, your sense of humor is truly sleep-inducing. Bravo.",
  "sleepy.dialogue.joke.creative.failed/4": "*half-asleep* Did I just witness a failed attempt at humor?",
  "sleepy.dialogue.joke.creative.failed/5": "Oh, that's... *yawns*... amusing, I suppose.",
  "sleepy.dialogue.joke.creative.failed/6": "*barely awake* Oh, fantastic. Another rib-tickler. Excuse me while I try to stifle my laughter.",
  "sleepy.dialogue.joke.creative.failed/7": "Why, oh why, would anyone find that remotely funny? Maybe you should consider a nap instead of cracking these jokes.",
  "sleepy.dialogue.joke.creative.failed/8": "You know, Ash's jokes would be like a caffeine shot compared to your snoozefest attempts at humor.",

  "sleepy.dialogue.procreate_engaged/1": "I'd feel much cozier once we've walked down the aisle and said our \"I dos\".",
  "sleepy.dialogue.procreate_engaged/2": "I am just not in the mood to bring a brand new existence into existence if we haven't established our unwavering devotion.",

  "sleepy.dialogue.shake_hand.success/1": "Your grip is...zzz...so nice...",
  "sleepy.dialogue.shake_hand.success/2": "Your grip...zzz...it reveals the immense power within you...",
  "sleepy.dialogue.shake_hand.success/3": "Wow...zzz...you're just...zzz...so polite...",
  "sleepy.dialogue.shake_hand.success/4": "Good day...zzz...I mean...zzz...good...zzz...day...",
  "sleepy.dialogue.shake_hand.success/5": "Why, hello there...zzz...I'm...zzz...sorry, I'm very sleepy...",
  "sleepy.dialogue.shake_hand.fail/1": "Are you kidding me? After you massacred the poor cow?",
  "sleepy.dialogue.shake_hand.fail/2": "Nah, I'm good. I'm too tired to deal with that.",
  "sleepy.dialogue.shake_hand.fail/3": "Don't worry about being all formal and stuff. I'm too sleepy to care.",
  "sleepy.dialogue.shake_hand.fail/4": "Oh, for real? This is so not my style when I'm half asleep.",
  "sleepy.dialogue.shake_hand.fail/5": "Can you please just leave me alone? I'm too drowsy for this.",

  "sleepy.dialogue.main.morning/1": "Gooood morning...zzz...zzz...",
  "sleepy.dialogue.main.morning/2": "*yawns* Are we really doing this work thing today?",
  "sleepy.dialogue.main.morning/3": "Ugh, I can barely keep my eyes open. Did you have a rough night too?",
  "sleepy.dialogue.main.morning/5": "Rise and...zzz...huh? Sorry, what were you saying?",
  "sleepy.dialogue.main.morning/6": "Did you...zzz...sleep well? You look so...zzz...refreshed.",
  "sleepy.dialogue.main.morning/7": "Morning, or whatever. I need like, 10 more hours of sleep.",
  "sleepy.dialogue.main.morning/8": "What a...zzz...beautiful...zzz...morning. I think I'm gonna...zzz...nap.",
  "sleepy.dialogue.main.morning/9": "I think...zzz...I might just take it easy today. My energy levels are...zzz...nonexistent.",
  "sleepy.dialogue.main.morning/10": "My schedule today...zzz...is jam-packed. I can already feel the...zzz...exhaustion setting in.",
  "sleepy.dialogue.main.morning/11": "I actually...zzz...got some decent sleep, but don't get too excited. I'm still gonna...zzz...take it easy.",
  "sleepy.dialogue.main.evening/1": "Good evening! I must say, I'm barely staying awake.",
  "sleepy.dialogue.main.evening/2": "It's amazing how quickly it turned into evening. How did your day go? I could barely keep my eyes open.",
  "sleepy.dialogue.main.evening/3": "Another grueling day has come to an end, don't you agree? I can barely muster the energy to speak.",
  "sleepy.dialogue.main.evening/4": "Time just slipped away today, didn't it? So much to do, but so little energy to do it.",
  "sleepy.dialogue.main.evening/5": "I think it's about time I retire for the evening. I can barely summon enough energy to prepare dinner.",
  "sleepy.dialogue.main.evening/6": "Today was an utter waste. I hardly accomplished anything. It's like I was sleepwalking through the day.",
  "sleepy.dialogue.main.evening/7": "I'm seriously considering taking a nap soon. The morning was just too exhausting for me.",
  "sleepy.dialogue.main.evening/8": "I'm going to head inside now. Last month, I had a terrifying encounter with a creeper. I avoid venturing out at night now.",
  "sleepy.dialogue.main.evening/9": "Oh, hello there! I was just picking up some ingredients for dinner from the butcher. I'm practically sleepwalking at this point. Catch you later!",
  "sleepy.dialogue.main.night/1": "*yawn* Are you still wide awake at this hour?",
  "sleepy.dialogue.main.night/2": "Burning the midnight oil, huh?",
  "sleepy.dialogue.main.night/3": "You must be a night aficionado, like me!",
  "sleepy.dialogue.main.night/4": "The monsters come out at night, so be careful wandering off too far. Wouldn't want you to become their midnight snack, would we?",
  "sleepy.dialogue.main.night/5": "The guards give a false sense of security, but the night still sends shivers down my spine, doesn't it for you?",
  "sleepy.dialogue.main.night/6": "When darkness falls, I can't help but feel drowsy. It's a serene time to unwind while the world slumbers.",
  "sleepy.dialogue.main.night/7": "The day is bustling with activity, so I relish my nocturnal strolls under the starry sky.",
  "sleepy.dialogue.main.night/8": "I'm absolutely drained. Today has been never-ending, I'll definitely need a break tomorrow.",
  "sleepy.dialogue.main.night/9": "I can already picture myself diving into a cozy bed, snuggled up and ready for dreamland.",
  "sleepy.dialogue.main.night/10": "Do yourself a favor and catch some Z's. Tomorrow's to-do list won't tackle itself, you know.",

  "sleepy.dialogue.greet.mayor/1": "G'morning, Mayor!",
  "sleepy.dialogue.greet.mayor/2": "Sleep tight, Mayor!",
  "sleepy.dialogue.greet.monarch/1": "Oh, Your Majesty... *yawns* It's quite an honor to be in your presence.",
  "sleepy.dialogue.greet.monarch/2": "Ah, Your Highness. *rubs eyes* I must say, you have a certain regal aura about you today.",

  "sleepy.dialogue.busy/1": "We've had quite the chit-chat today, but I reckon it's time for me to hit the hay and get back to work.",
  "sleepy.dialogue.busy/2": "You know, I appreciate the conversation, but my eyelids are drooping and I've got a deadline to meet. Can we catch up later?",
  "sleepy.dialogue.busy/3": "Pardon me, but I'm feeling a bit drowsy at the moment. Do you mind if we have a chat when I'm more awake?",
  "sleepy.dialogue.busy/4": "Apologies, my friend, but duty calls and these heavy eyelids won't let me put it off any longer. We'll catch up soon, alright?",
  "sleepy.dialogue.busy/5": "Oh dear, I must've left my energy levels in dreamland. Gotta go tend to my furnace, but we'll continue our conversation later!",
  "sleepy.dialogue.goaway/1": "Meh, just leave me alone.",
  "sleepy.dialogue.goaway/2": "Can't you see I'm trying to catch some Z's here?",
  "sleepy.dialogue.goaway/3": "Oh, please, find someone else to bother.",
  "sleepy.dialogue.goaway/4": "Hey, can't you bug someone who actually cares?",
  "sleepy.dialogue.goaway/5": "Ugh, go away, you pest!",

  "sleepy.dialogue.greet": "Ugh... Hey... How... zzz... you doing... today?",
  "sleepy.dialogue.greet/1": "Hey... *yawn* How are you... doing today?",
  "sleepy.dialogue.greet/2": "Hey %1$s... *stretch* How's it... zzz... going?",
  "sleepy.dialogue.greet/3": "Oh... hello... *yawn* Did you... need something?",
  "sleepy.dialogue.greet/4": "You... look ready to... *snore* take on the day... How's it... zzz... going?",
  "sleepy.dialogue.greet/5": "Hello %1$s... *blink* It's... *yawn* good to... see you...",
  "sleepy.dialogue.greet/6": "Ohai... *mumble* zzz...",
  "sleepy.dialogue.greet/7": "Nice... to see... *yawn* you...",
  "sleepy.dialogue.greet/8": "Hello... *stretch* It's... *snore* lovely to see... you. How are... you today?",
  "sleepy.dialogue.greet/9": "Hey! *yawn* Glad... to see... you!",

  "sleepy.dialogue.greet.negative/1": "Ugh, go away, you're the LAST person I wanted to see! Can't you tell I'm trying to catch some Z's here?",
  "sleepy.dialogue.greet.negative/2": "Oh, wonderful, look who's back. Again. Just when I thought I could finally get some shut-eye.",
  "sleepy.dialogue.greet.negative/3": "*yawning* Mm? What do you want? Can't you see I'm in desperate need of a nap?",
  "sleepy.dialogue.greet.negative/4": "Oh, it's just you. I was expecting someone else to disturb my peaceful slumber. What brings you here?",
  "sleepy.dialogue.greet.negative/5": "Came to annoy me again? I was hoping for a moment of tranquility, but I guess that's too much to ask for.",

  "sleepy.dialogue.greet.success/1": "Oh, wow, that's... *yawn* ...good to hear.",
  "sleepy.dialogue.greet.success/2": "Doing good? *yawn* Ah, that's great, I guess.",
  "sleepy.dialogue.greet.success/3": "Happy to hear it... *yawn* ...I guess.",
  "sleepy.dialogue.greet.success/4": "So glad to hear that... *yawn* ...or whatever.",
  "sleepy.dialogue.greet.success/5": "Good to know it, I guess... *yawn* ...if you say so.",
  "sleepy.dialogue.greet.fail/1": "*Yawns* Hmm...",
  "sleepy.dialogue.greet.fail/2": "*Half-asleep* Glad to hear... I guess...",
  "sleepy.dialogue.greet.fail/3": "*Rubbing eyes* Uh... okay? I suppose...",
  "sleepy.dialogue.greet.fail/4": "*Sleepily* Really? Huh... *yawns*",
  "sleepy.dialogue.greet.fail/5": "*Drowsily* Oh... whatever...",

  "sleepy.dialogue.apologize.success/1": "Don't worry about it, mistakes happen when you're half-asleep like me.",
  "sleepy.dialogue.apologize.success/2": "Ah, it's totally cool, just make sure to stay awake next time, like I struggle to do.",
  "sleepy.dialogue.apologize.success/3": "I suppose that's alright, just be extra cautious, especially if you're half-dozing off like me.",
  "sleepy.dialogue.apologize.success/4": "No sweat, we all mess up sometimes. Even when we're barely awake, like me.",
  "sleepy.dialogue.apologize.success/5": "Oh, it's perfectly fine, my friend. We all make mistakes, even when we're practically sleepwalking like me.",
  "sleepy.dialogue.apologize.fail/1": "Can you just... go away? I'm too sleepy to deal with this right now.",
  "sleepy.dialogue.apologize.fail/2": "Ugh, you totally hit me on purpose! Seriously, could you be any more inconsiderate? I'm barely awake here.",
  "sleepy.dialogue.apologize.fail/3": "Haha, nice try. Like I'm gonna believe your half-hearted apology when all I want is a good nap. Nice attempt, though.",
  "sleepy.dialogue.apologize.fail/4": "Ouch! That really hurt, and I'm way too tired to even think about accepting your apology. Just let me be, okay?",
  "sleepy.dialogue.apologize.fail/5": "Nope, not happening. I'm way too exhausted to even entertain the thought of forgiving you. Sorry, but no can do.",

  "sleepy.dialogue.location.failed/1": "Ugh, I don't know anything, I can barely keep my eyes open.",
  "sleepy.dialogue.location.failed/2": "Sorry, didn't catch a thing, my brain is half asleep.",
  "sleepy.dialogue.location.failed/3": "Nope, not a chance. I'm too sleepy to even consider exploring cursed dungeons like you brave souls.",
  "sleepy.dialogue.location.forgot/1": "Oh, I dozed off for a moment there. I had found this amazing spot, but... oh, what was it again? My memory must have sleepwalked out the door.",
  "sleepy.dialogue.location.forgot/2": "Looking for something interesting, huh? Well, I had something to share, but my brain took a power nap and forgot all about it. Apologies for the sleepy mishap.",
  "sleepy.dialogue.location.forgot/3": "Yes, yes! There was this location that would've blown your mind, but... *yawn*... I can't seem to recall it. My memory must have drifted off to dreamland. My apologies for the snoozy slip-up.",
  "sleepy.dialogue.location.igloo/1": "Oh, hey there! So, I stumbled upon this igloo at %2$s. Can you believe it? Who in their right mind would choose to build a house out of snow? It's so chilly, I can't even feel my toes!",
  "sleepy.dialogue.location.igloo/2": "You know what I discovered? An abandoned igloo, right over there at %2$s. And let me tell you, it gives me the creeps. Seriously, it's like the spirits of the freezing tundra have taken up residence in there. I swear, I've heard some seriously spooky noises coming from that place. Gives me the shivers!",
  "sleepy.dialogue.location.igloo/3": "Guess what I found? An old frozen house at %2$s. Yeah, it's called an igloo, or something like that. But let me tell you, nobody's been there in ages. I mean, can you blame them? Living in a house made entirely of ice doesn't seem like the comfiest option, does it?",
  "sleepy.dialogue.location.pyramid/1": "Hey, have you seen that cool pyramid over at %2$s? It's like a giant sandcastle, but way better!",
  "sleepy.dialogue.location.pyramid/2": "Psst! I've got a secret to tell you. There's a majestic pyramid waiting for you at %2$s. You won't believe your eyes when you see it!",
  "sleepy.dialogue.location.pyramid/3": "Oh, you're going to %2$s? Well, listen up! There's this legendary pyramid there that even the bravest warriors fear. But I have a feeling you can conquer it with a smile on your face!",
  "sleepy.dialogue.location.ruined_portal_desert/1": "Oh, man... You won't believe it, but there's like this totally wrecked portal over at %2$s, right smack in the middle of the desert. I mean, it's a real snooze-fest, but yeah, it's there.",
  "sleepy.dialogue.location.ruined_portal_swamp/1": "Whoa, dude! Can you believe it? There's like this totally demolished portal at %2$s, right smack in the middle of this super gloomy swamp. Those Nether invaders must've been caught off guard, man. They never saw this dump coming!",
  "sleepy.dialogue.location.ruined_portal/1": "Ugh, there's this totally wrecked portal at %2$s. Looks like a Nether invasion turned it into a disaster zone.",
  "sleepy.dialogue.location.ruined_portal/2": "Hey, if you're brave enough, you can check out %2$s. There's a ruined nether portal there, and let me tell you, it's giving me major goosebumps. But hey, you'll be fine... probably. Just watch out for the magma, it's a real mood killer.",
  "sleepy.dialogue.location.ruined_portal/3": "So, there's this place called %2$s. Supposedly, it used to be a nether portal, but now it's just a sad, crumbling mess. The local cleric is convinced there's treasure hidden inside, but honestly, no one in their right mind wants to get close to that nightmare. Yikes!",
  "sleepy.dialogue.location.ruined_portal_mountain/1": "Ugh, can barely keep my eyes open, but I've gotta tell you about this ruined portal at %2$s in the mountains. It's an absolute disaster, like me right now.",
  "sleepy.dialogue.location.mansion/1": "Oh, if you drag yourself to %2$s, you might stumble upon a mansion, you know, the one plagued by those illagers. I'm telling you, it's a frightful sight. Best to steer clear of that cursed abode if you don't want your eyelids drooping permanently.",
  "sleepy.dialogue.location.mansion/2": "You won't believe it, but there's this colossal mansion lurking at %2$s, occupied by those illagers. Personally, I can't help but yawn at the mere thought of it. Maybe, just maybe, it's high time we relocated our humble abode to a place far, far away from that sleepy hollow.",
  "sleepy.dialogue.location.monument/1": "The moment you lay eyes on %2$s, you'll discover a castle submerged beneath the waves, swarming with ferocious sea monsters. Be extremely cautious, my weary friend.",
  "sleepy.dialogue.location.monument/2": "Ah, %2$s, the legendary oceanic abyss where whispers of ancient ruins have been passed down through generations. Should you dare to venture forth, beware of treacherous perils lurking in the depths. The promise of untold treasure may cloud your judgment, but remember, danger is never far behind in such treacherous waters. Rest well before you set sail, for a vigilant spirit is your best companion.",
  "sleepy.dialogue.location.shipwreck/1": "Oh, there's a sunken ship over there at %2$s. It's like a cozy little slumber party for fishes. Those ships used to belong to the dreamy Eastern Alliance Company.",
  "sleepy.dialogue.location.shipwreck/2": "Huh, so apparently some sleepy fishermen accidentally discovered a shipwreck at %2$s. I wonder if there's a secret stash of dreams and tranquility hidden inside...",
  "sleepy.dialogue.location.shipwreck_beached/1": "Wow, stumbled upon a shipwreck at %2$s. It's like the beach just swallowed it whole. Don't strain your eyes, you'll see it right away.",
  "sleepy.dialogue.location.shipwreck_beached/2": "Hey, hey. Wanna see something cool? There's this wrecked ship at %2$s. It's like the ocean just couldn't keep its eyes off it. Wonder what happened, though... Must've been one wild ride!",
  "sleepy.dialogue.location.village_desert/1": "You know, there's this really cozy village out in the desert. It's like a hidden oasis, just waiting to be discovered.",
  "sleepy.dialogue.location.village_taiga/1": "Oh, there's this cozy little village, nestled right in the heart of the taiga biome where you can catch me yawning all day long.",
  "sleepy.dialogue.location.village_taiga/2": "Journey to %2$s, my friend, and there you shall stumble upon yet another village, hidden away amidst the tranquil depths of the taiga biome. It's so peaceful, it might just put you to sleep... like me. Zzz...",
  "sleepy.dialogue.location.village_snowy/1": "Oh, you won't believe it, but over yonder in that direction, there's this sleepy village. Brrr...it's freezing cold there!",
  "sleepy.dialogue.location.village_snowy/2": "Have you heard about that other village in the snowy plains, at %2$s? The folks there are as cozy as can be, but boy oh boy, that place is colder than an ice cube!",
  "sleepy.dialogue.location.village_plains/1": "Ahh, if you head over to %2$s, you'll stumble upon another charming village, just waiting to be discovered.",
  "sleepy.dialogue.location.village_plains/2": "Oh, you'll love this! Right in the heart of the plain, at %2$s, there's a sleepy little village that's just begging for some company.",
  "sleepy.dialogue.location.village_savanna/1": "Oh, man. Just down the road from here, you'll stumble upon another village. Trust me, the heat there is off the charts.",
  "sleepy.dialogue.location.village_savanna/2": "You won't believe it, but in that scorching savanna over yonder, there's a whole other village. And let me tell you, the folks there are just as warm as the weather.",
  "sleepy.dialogue.location.swamp_hut/1": "Oh, hey there. Just a friendly warning, but you might want to steer clear of that swamp at %2$s. It's got this witch living there, and boy, let me tell you, it's best to keep your distance.",
  "sleepy.dialogue.location.swamp_hut/2": "Listen up, buddy. You're gonna want to stay far away from %2$s. Why, you ask? Well, there's a creepy hut there, and it's home to one wicked witch. I'm telling you, it's like a nightmare come to life.",
  "sleepy.dialogue.location.mineshaft/1": "We had this old mine, you know? It's all the way over there at %2$s. Unfortunately, it got shut down after some unfortunate incident. I can barely keep my eyes open just thinking about it.",
  "sleepy.dialogue.location.mineshaft/2": "Ah, the good ol' mine used to be right at %2$s. But let me tell you, it's not the same anymore. Monsters took over that place, and it's become a real nightmare. I'd advise you to tread cautiously down there, my friend. I could really use a nap just talking about it.",
  "sleepy.dialogue.location.jungle_pyramid/1": "You know, there's this really old temple at %2$s. It's like, super dangerous though. You might wanna stay away from it unless you're into death-defying adventures or something.",
  "sleepy.dialogue.location.jungle_pyramid/2": "Hey, have you heard about the ancient ruins in the nearby jungle? Yeah, it's at %2$s. They say it's filled with traps and stuff. Just a friendly warning, you might wanna proceed with caution if you're planning on checking it out. Those traps still work, believe it or not. Our ancestors clearly had a thing for booby traps or something.",
  "sleepy.dialogue.location.pillager_outpost/1": "Oh, excuse me... *yawns* Did you know there are some Pillagers hanging around at %2$s? They decided to set up their pesky little outpost right next to us. Honestly, I can't even keep my eyes open with all the commotion. I hope they don't decide to attack us anytime soon, because, honestly, we can barely handle another attack. *rubs eyes sleepily*",
  "sleepy.dialogue.location.pillager_outpost/2": "Ugh... *yawns* So, there's this annoying outpost owned by those dreadful Pillagers at %2$s. Let me tell you, they have absolutely no respect for our beauty sleep. I mean, if you dare to go anywhere near there, be extremely careful. Those trigger-happy brutes will shoot on sight. And trust me, no one wants to deal with them when they haven't had their precious nap. *rubs eyes wearily*",
  "sleepy.dialogue.location.pillager_outpost/3": "*half-asleep* Ahem... So, um, if you happen to head towards %2$s, there's this outpost that, well, belongs to those daring Pillagers. Can you believe it? They have the audacity to invade our peaceful village. Anyway, if you think you're strong enough to defeat those bothersome villains, who knows? You might stumble upon some... *yawns* worthwhile loot. The entire village would be eternally grateful if someone could just take care of those drowsy-inducing troublemakers. *yawns again* Sorry, I think I need a nap...",
  "sleepy.dialogue.location.ancient_city/0": "Ugh, I vaguely remember hearing strange sounds echoing from deep beneath %2$s. Must've been some ancient slumbering creature down there.",
  "sleepy.dialogue.location.ancient_city/1": "*yawns* You know, I've got this hunch that there's a secret buried treasure hidden way down beneath the ground at %2$s. I mean, who knows what ancient civilizations have left behind?",
  "sleepy.dialogue.location.ancient_city/3": "Ah, %2$s, the land of legends. I caught a glimpse of some ancient ruins there, but I was too sleepy to fully explore. Bet there's an entire underground city waiting to be discovered.",

  "sleepy.dialogue.joke.monster.success/1": "Huh? That Skelly got what it deserved, I guess. *yawns*",
  "sleepy.dialogue.joke.monster.success/2": "Wait, so a zombie actually attempted to whack you with a shovel? *barely stifles a yawn* That's so funny.",
  "sleepy.dialogue.joke.monster.success/3": "Oh, you managed to assert your dominance over a spider? How... *yawns* impressive. Haha...",
  "sleepy.dialogue.joke.monster.success/4": "Wow, you convinced a skeleton to take out a creeper? That's... uh... *struggles to keep eyes open* quite remarkable, haha!",
  "sleepy.dialogue.joke.monster.success/5": "*yawns* Can you believe how clueless cave spiders are? Haha, it's like they're half-asleep or something.",
  "sleepy.dialogue.joke.monster.failed/1": "Ugh, can't even muster the energy to argue about skeletons being sentient. Just leave them alone, man.",
  "sleepy.dialogue.joke.monster.failed/2": "*yawn* Creepers blowing up jokes? So passé. Get on with the times, dude.",
  "sleepy.dialogue.joke.monster.failed/3": "Did you know zombies and skeletons were once humans? Yeah, like ages ago. Nothing new here, buddy.",
  "sleepy.dialogue.joke.monster.failed/4": "*half-asleep* Oh wow, an enderman fell into water. Groundbreaking stuff, I tell ya.",
  "sleepy.dialogue.joke.monster.failed/5": "Seriously, silverfish on the toilet jokes? I'm too tired to even react to that. Can we move on, please?",

  "sleepy.dialogue.joke.animal.success/1": "Poor sheep, it must've been exhausting to lose all that wool. But hey, at least it's a good laugh!",
  "sleepy.dialogue.joke.animal.success/2": "And then, the wolf just couldn't resist the charm of the sleepy sheep. It's like a fairytale, right?",
  "sleepy.dialogue.joke.animal.success/3": "Honestly, chickens never fail to crack me up. Who knew they had those hidden talents? It's hilarious!",
  "sleepy.dialogue.joke.animal.success/4": "Haha! That's beyond ridiculous, but you know what? I'm totally here for it! It's so silly, I love it!",
  "sleepy.dialogue.joke.animal.success/5": "Thank goodness cows have an endless supply of milk. It's like their superpower! Can you imagine running out of milk? No way!",
  "sleepy.dialogue.joke.animal.failed/1": "Oh, please, don't even bother with those tired jokes.",
  "sleepy.dialogue.joke.animal.failed/2": "Ugh, that sheep must be counting zzz's after that one.",
  "sleepy.dialogue.joke.animal.failed/3": "Don't you dare wake my pig up with your lame humor.",
  "sleepy.dialogue.joke.animal.failed/4": "That joke is so dull, it could put a sloth to sleep.",
  "sleepy.dialogue.joke.animal.failed/5": "Seriously, making fun of a cow's eyebrows? You need a nap, buddy.",

  "sleepy.dialogue.flirt.slap/1": "Pardon me, but do you mind?",
  "sleepy.dialogue.flirt.slap/2": "Were you trained in the art of flirtation by a sleepy Enderman?!",
  "sleepy.dialogue.kiss.slap/1": "Oh... how could you?",
  "sleepy.dialogue.kiss.slap/2": "Give it another shot, and you might wake me up with a soft touch!",

  "sleepy.dialogue.chat.plains/1": "I don't mind the plains, but honestly, I'd rather be catching some Z's in a cozy bed. Maybe one day I'll venture out...if I can ever wake up.",
  "sleepy.dialogue.chat.plains/2": "The plains...zzz...so peaceful...not as exciting as the other places...but hey, at least I can catch some shut-eye without any interruptions.",
  "sleepy.dialogue.chat.plains/3": "You know, the plains can be quite beautiful at night...zzz...gives me the perfect backdrop for a dream-filled slumber.",
  "sleepy.dialogue.chat.plains/4": "I'd give anything to just plop down on the grass and take a nice, long nap while gazing at the stars and clouds overhead. Ah, the ultimate relaxation.",
  "sleepy.dialogue.chat.plains/5": "Ah, the crisp, clean air in the plains...zzz...maybe even better than the taiga! Perfect for some tranquil snoozing.",
  "sleepy.dialogue.chat.plains/6": "Sure, the plains might be plain, but sometimes simplicity is all I need to recharge and refresh. A nap in the pure simplicity of it all sounds like heaven.",
  "sleepy.dialogue.chat.plains/7": "I used to pick wild flowers as a child...zzz...had a little crush on Ash and would give him flowers. Ah, young love...zzz...",
  "sleepy.dialogue.chat.plains/8": "The morning sunrise in the plains? Oh, I'm sure it's lovely...zzz...but honestly, I can't be bothered to get up early just to witness it. I'll stick to my beauty sleep, thank you very much.",
  "sleepy.dialogue.chat.savanna/1": "It's sooo hot in this savanna, but hey, at least we never have to worry about freezing our buns off in winter, am I right?",
  "sleepy.dialogue.chat.savanna/2": "Ugh, those llamas can be such a pain, but I guess I can tolerate them. Just don't let them near my precious siesta time.",
  "sleepy.dialogue.chat.savanna/3": "You know, the architecture here in the savanna is pretty cool. It's like, one of the reasons I stuck around and didn't move to some boring old plains village.",
  "sleepy.dialogue.chat.savanna/4": "Never judge a biome by its cover, my friend. The savanna may seem plain and ordinary, but it's got its own hidden charms, trust me.",
  "sleepy.dialogue.chat.savanna/5": "Unlike those desert villages, we may not get any rain, but hey, at least we have some rivers flowing through. Gotta stay hydrated, you know?",
  "sleepy.dialogue.chat.savanna/6": "Dude, you won't believe the crazy hills and terrains we got here. It's like a roller coaster ride for the eyes. You gotta see it to believe it.",
  "sleepy.dialogue.chat.savanna/7": "When it gets scorching hot, those acacia trees with their sweet, sweet shade are my saviors. They're like my own personal air conditioning system.",
  "sleepy.dialogue.chat.savanna/8": "Let me tell ya, our savanna villages are the kings of melons and pumpkins. We trade 'em with other villages, and they can't get enough of our juicy goodness!",
  "sleepy.dialogue.chat.taiga/1": "I guess the woods are alright. They've got wood and stuff. Can't really be bothered to care though.",
  "sleepy.dialogue.chat.taiga/2": "Supposedly it's chilly in this taiga biome, but honestly, I'm too tired to feel anything. Not like I'd want to leave anyway.",
  "sleepy.dialogue.chat.taiga/3": "Taiga forests are kinda cool, I guess. The berries are alright, I suppose.",
  "sleepy.dialogue.chat.taiga/4": "Foxes in these taiga forests? Yeah, they're fine, I guess. Sometimes I bother to toss 'em a berry or two. They're alright, I suppose.",
  "sleepy.dialogue.chat.taiga/5": "Wolves are pretty chill here, I guess. Plenty of food, so they don't bother us too much.",
  "sleepy.dialogue.chat.taiga/6": "The air in the taiga can be kinda relaxing, I guess. If you're into that sorta thing. Personally, I'm too tired to really care.",
  "sleepy.dialogue.chat.taiga/7": "Those sweet berry bushes can be a pain, man. Prickly little devils. Not really worth the trouble, if you ask me.",
  "sleepy.dialogue.chat.taiga/8": "Rain in the taiga? Yeah, it's cold I guess. But hey, it's peaceful or something. Not like it matters to me though, I'm too tired to care.",
  "sleepy.dialogue.chat.snowy_plains/1": "It's so cold here, I can barely feel my toes. But hey, as long as I have a cozy blanket and a hot cup of cocoa, I'll survive!",
  "sleepy.dialogue.chat.snowy_plains/2": "Brrr! This freezing weather makes me want to hibernate like a bear. Good thing I have a stash of warm, fuzzy blankets to snuggle up with.",
  "sleepy.dialogue.chat.snowy_plains/3": "Oh, this chilly air is perfect for curling up by the fireplace with a good book. Just thinking about it makes me want to take a nap!",
  "sleepy.dialogue.chat.snowy_plains/4": "Ah, the snow brings back memories of my childhood. I used to spend hours building snow forts and having epic snowball battles with my pals. Those were the days!",
  "sleepy.dialogue.chat.snowy_plains/5": "Watch out for those pesky strays! They're like little ice-cold ninjas with their tipped arrows. They always catch me off guard!",
  "sleepy.dialogue.chat.snowy_plains/6": "The guards have been warning us about wolves prowling nearby. I don't know about you, but I'm not taking any chances. I'm staying indoors where it's warm and safe!",
  "sleepy.dialogue.chat.snowy_plains/7": "Have you ever accidentally bumped into an iron golem? It's like getting stuck in a giant metal bear hug. Trust me, you don't want to mess with those guys.",
  "sleepy.dialogue.chat.snowy_plains/8": "When I was just a wee villager, my parents used to surprise me with a pumpkin. We'd carve it into a spooky face for Halloween, and then I'd use the leftover pieces to make my very own snow golems. Such fond memories!",
  "sleepy.dialogue.chat.desert/1": "It's scorching in this desert, but hey, at least I can take a nap and snooze away the heat.",
  "sleepy.dialogue.chat.desert/2": "The desert is like a cozy blanket of warmth, lulling me into a sleepy state all year round.",
  "sleepy.dialogue.chat.desert/3": "Despite the blazing desert heat, I'm always rocking a sun-kissed glow, or a sunburn that makes me look like I took a nap on a grill.",
  "sleepy.dialogue.chat.desert/4": "Ah, the night sky in the desert is a sleep-inducing masterpiece, perfect for stargazing and catching some Z's.",
  "sleepy.dialogue.chat.desert/5": "Goodness gracious, the sun is practically singeing my eyelids today. Time for a quick catnap to escape its fiery wrath.",
  "sleepy.dialogue.chat.desert/6": "Whew! The sun is absolutely draining today. I better find some shade and take a power nap.",
  "sleepy.dialogue.chat.desert/7": "Have you spotted any rabbits around here? They're practically ninjas in this sleepy desert.",
  "sleepy.dialogue.chat.desert/8": "The only downside of this place are those pesky husks. They always leave me famished whenever they rudely interrupt my beauty sleep! How rude!",
  "sleepy.dialogue.chat.desert/9": "Ouch! I accidentally embraced a cactus the other day. It's a constant reminder to stay alert and not doze off in this prickly desert.",
  "sleepy.dialogue.chat.desert/10": "Life in this arid desert is quite challenging, but luckily our village provides us with water and food to keep us going, even if it makes us feel like we could doze off at any moment.",

  "sleepy.dialogue.story.exploring.success/1": "Huh, maybe one day I'll muster up the energy to venture beyond my own bed.",
  "sleepy.dialogue.story.exploring.success/2": "Gosh, the thought of traveling and exploring sounds nice, but honestly, I'd rather just catch some Z's right here.",
  "sleepy.dialogue.story.exploring.success/3": "You know, it takes a special kind of sleepy courage to even consider leaving the comfort of my cozy little village.",
  "sleepy.dialogue.story.exploring.fail/1": "Your tales are as ancient as my eyelids drooping in profound slumber.",
  "sleepy.dialogue.story.exploring.fail/2": "Oh my, please be cautious not to disturb my peaceful slumber with your sharp edges, my dear tough individual.",
  "sleepy.dialogue.story.exploring.fai/l3": "Interacting with you is like chatting with someone who just woke up from a hibernation. Minus the cute factor, of course.",

  "sleepy.dialogue.story.nether.success/1": "Is it... *yawn* ...that hot there?!",
  "sleepy.dialogue.story.nether.success/2": "Whoa... *yawn* ...how have you managed to survive in that... *yawn* ...dangerous place? I'm... *yawn* ....impressed.",
  "sleepy.dialogue.story.nether.success/3": "I've heard there is... *yawn* ...treasure in the Nether for those... *yawn* ...brave enough to go there. If only... *yawn* ...I had the... *yawn* ...courage to set foot in the Nether...",
  "sleepy.dialogue.story.nether.success/4": "You must be really... *yawn* ...brave to go there. Are you... *yawn* ...scared at all? Not that... *yawn* ...I would... *yawn* ...be scared or anything...",
  "sleepy.dialogue.story.nether.success/5": "Have you... *yawn* ...seen a Zombified Piglin? I... *yawn* ...heard they're quite... *yawn* ...fascinating...",
  "sleepy.dialogue.story.nether.fail/1": "I'm sorry, I'm just too sleepy to even imagine going to the Nether.",
  "sleepy.dialogue.story.nether.fail/2": "... I mean, I can't blame those Piglins for attacking you, they probably mistook you for a snoozing ghast or something.",
  "sleepy.dialogue.story.nether.fail/3": "I couldn't care less if you've been to the Nether. Your storytelling skills are as dull as my half-asleep brain.",
  "sleepy.dialogue.story.nether.fail/4": "... honestly, you don't even look like you could lift a feather, let alone survive in the fiery depths of the Nether.",
  "sleepy.dialogue.story.nether.fail/5": "Oh, my dear grandpa used to embark on epic adventures in the Nether, and not once did he mention anything about warped fungus. You must be making stuff up in your sleep!",

  "sleepy.dialogue.story.enderdragon.success/1": "Wowzers! Do I see the dragon egg in your possession? You must have had one wild adventure!",
  "sleepy.dialogue.story.enderdragon.success/2": "Zzz... Wait, you defeated the enderdragon? That's like, super impressive! The village will totally remember you for, like, forever!",
  "sleepy.dialogue.story.enderdragon.fail/1": "Wow, are you out of your mind? The ender dragon is like, totally not real.",
  "sleepy.dialogue.story.enderdragon.fail/2": "Seriously? Like, no way anyone could even come close to taking down that dragon! It's like, impossible!",

  "sleepy.dialogue.story.wither.success/1": "Unbelievable! I've heard the Wither brings unimaginable chaos!",
  "sleepy.dialogue.story.wither.success/2": "You've managed to conquer the mighty Wither?! Oh, that's absolutely mind-blowing!",
  "sleepy.dialogue.story.wither.fail/1": "I'm not convinced, honestly.",
  "sleepy.dialogue.story.wither.fail/2": "You seem way too well-rested for me to buy that story.",

  "sleepy.dialogue.stay.fail/1": "Nooo, thanks. I'm more like a snoozer, not an adventurer.",
  "sleepy.dialogue.stay.fail/2": "Thanks for, uhh, asking, but I'd rather take a long nap and dream about the world!",
  "sleepy.dialogue.stay.fail/3": "It's, umm, a nice village and all, but I'm more of a sleep enthusiast than an adventurer type, you know?",
  "sleepy.dialogue.stay.repeat/1": "Oh, forgive me if my memory falters, but didn't we already discuss this matter?",
  "sleepy.dialogue.stay.repeat/2": "My apologies, but you've already inquired about that particular subject.",
  "sleepy.dialogue.stay.success/1": "Thanks, I'm totally down to crash here in this village!",
  "sleepy.dialogue.stay.success/2": "Awesome, I'm all for catching some Z's in this village!",
  "sleepy.dialogue.stay.no_space/1": "Ugh, this village is way too crowded. Can't even find a quiet spot to rest my tired bones.",
  "sleepy.dialogue.stay.no_space/2": "I'd love to stick around, but it looks like every bed in this place is taken. Guess I'll just have to catch some Z's under the stars.",

  "sleepy.dialogue.hire/1": "Alright, just nudge me when you're desperate for assistance. I'll be sort of awake for the duration you're willing to pay for.",
  "sleepy.dialogue.hire/2": "Ah, fantastic! Give me a gentle poke when you're in dire need of my services. I'll be here, half-awake, eagerly waiting for those shiny emeralds!",
  "sleepy.dialogue.hire/3": "Marvelous! Brace yourself for an underwhelming display of assistance. Once you've gathered the emeralds, I might summon the energy to help you out, possibly.",
  "sleepy.dialogue.no_money/1": "I'm sorry, but you'll have to gather more emeralds if you want my assistance.",
  "sleepy.dialogue.no_money/2": "Do you have any idea how much sleep one needs to provide quality service? More emeralds, my friend.",
  "sleepy.dialogue.no_money/3": "*yawns* Oh, I'm afraid you'll need a few more emeralds if you want me to stay awake while working for you.",

  "sleepy.dialogue.main.rock_paper_scissor/1": "Ugh, let's play Rock Paper Scissors... but can we make it quick? I'm sooo sleepy.",
  "sleepy.dialogue.rock_paper_scissor/1": "Ugh, rock, paper, scissors... zzz...",
  "sleepy.dialogue.rock_paper_scissor/2": "I... uh... I'm going to... yawn... beat you this... yawn... time, maybe... zzz...",
  "sleepy.dialogue.rock_paper_scissor.rock/1": "*Rubbing eyes* Rock! Let's get this over with, I need my beauty sleep.",
  "sleepy.dialogue.rock_paper_scissor.paper/1": "Paper, I guess... *yawning* Can we make this quick? I need my beauty sleep.",
  "sleepy.dialogue.rock_paper_scissor.scissor/1": "Scissor... *yawns* Can we play later? I need to catch some Z's.",
  "sleepy.dialogue.rock_paper_scissor.loose.rock/1": "Paper? Ah, I must have spaced out... You win this round with rock. I need to wake up!",
  "sleepy.dialogue.rock_paper_scissor.loose.paper/1": "I guess I'll go with scissors... but I'm so sleepy, I might just fall asleep instead!",
  "sleepy.dialogue.rock_paper_scissor.loose.scissor/1": "Rock conquers scissors! Yawn... Another victory to add to my never-ending sleep.",
  "sleepy.dialogue.rock_paper_scissor.win.rock/1": "Huh? Rock defeats scissors, I need a nap to recover from this defeat.",
  "sleepy.dialogue.rock_paper_scissor.win.paper/1": "I've come to accept that rock is my eternal defeat, I can never win.",
  "sleepy.dialogue.rock_paper_scissor.win.scissor/1": "Huh? Oh, scissors besting paper? I must've dozed off for a moment. Good job, I suppose.",
  "_": ""
}