{
  "sodium.option_impact.low": "Bas",
  "sodium.option_impact.medium": "Moyen",
  "sodium.option_impact.high": "Élevé",
  "sodium.option_impact.extreme": "Extrême",
  "sodium.option_impact.varies": "Varie",
  "sodium.options.pages.quality": "Qualité",
  "sodium.options.pages.performance": "Performance",
  "sodium.options.pages.advanced": "Avancé",
  "sodium.options.view_distance.tooltip": "La distance d'affichage définit jusqu'où le terrain pourra être affiché. Une distance de rendu plus courte veut dire que moins de terrain sera affiché, ce qui améliorera la fréquence d'images (framerate).",
  "sodium.options.simulation_distance.tooltip": "La distance de simulation définit jusqu'où le terrain et les entités pourront être chargés et mis à jour. Une distance plus courte peut réduire la charge du serveur interne et améliorer la fréquence d'images (framerate).",
  "sodium.options.brightness.tooltip": "Définit la luminosité (gamma) du jeu.",
  "sodium.options.gui_scale.tooltip": "Définit l'échelle maximale de taille de l'interface utilisateur. Si \"auto\" est utilisé, alors la plus grande échelle possible sera privilégiée.",
  "sodium.options.fullscreen.tooltip": "Si activé, le jeu s'affichera en plein écran (si pris en charge).",
  "sodium.options.v_sync.tooltip": "Si activée, la fréquence d'images (framerate) du jeu sera synchronisé au taux de rafraîchissement de l'écran, ce qui permettra une expérience généralement plus fluide au détriment de la latence d'entrée globale. Cette option peut dégrader les performances si votre machine est trop lente.",
  "sodium.options.fps_limit.tooltip": "Limite la fréquence d'images par seconde. Ceci peut réduire l'utilisation de la batterie et améliorer la réactivité de la machine en multitâche. Lorsque la synchronisation verticale est activée, cette option sera ignorée sauf si la fréquence définie est inférieure au taux de rafraîchissement de l'écran.",
  "sodium.options.view_bobbing.tooltip": "Si activé, la vue du joueur va osciller et se balancer lorsqu'il se déplacera. Les joueurs qui ressentent de la Cinétose (Mal de transport) en jouant peuvent avoir une meilleure expérience en désactivant cette option.",
  "sodium.options.attack_indicator.tooltip": "Contrôle où l'indicateur d'attaque est affiché à l'écran.",
  "sodium.options.autosave_indicator.tooltip": "Si activé, un message est affiché quand le jeu sauvegarde le monde sur le disque dur.",
  "sodium.options.graphics_quality.tooltip": "La qualité graphique par défaut contrôle certaines options existantes et est nécessaire pour la compatibilité des mods. Si les options ci-dessous sont laissées à \"Défaut\", elles utiliseront ce paramètre.",
  "sodium.options.clouds_quality.tooltip": "Contrôle la présence de nuages affichés dans le ciel.",
  "sodium.options.weather_quality.tooltip": "Contrôle la qualité des effets de pluie et de neige.",
  "sodium.options.leaves_quality.name": "Feuilles",
  "sodium.options.leaves_quality.tooltip": "Contrôle la qualité des feuilles.",
  "sodium.options.particle_quality.tooltip": "Contrôle le nombre maximum de particules qui peuvent être présentes à l'écran à un moment donné.",
  "sodium.options.smooth_lighting.tooltip": "Contrôle l'éclairage adoucis et l'ombrage des blocs. Ceci augmente légèrement le temps de mise à jour des chunks, mais n'affecte pas le framerate.",
  "sodium.options.biome_blend.value": "%s bloc(s)",
  "sodium.options.biome_blend.tooltip": "Contrôle la portée d'échantillonnage des biomes pour la coloration des blocs. Des valeurs plus élevées vont grandement rallonger le temps de calcul des chunks pour assez peu d'amélioration visuelle.",
  "sodium.options.entity_distance.tooltip": "Contrôle la distance d'affichage des entités. Des valeurs plus élevées amélioreront la distance de rendu mais pourront dégrader la fréquence d'images (framerate)",
  "sodium.options.entity_shadows.tooltip": "Si activé, des ombres basiques seront affichées sous les mobs et autres entités.",
  "sodium.options.vignette.name": "Dégradé",
  "sodium.options.vignette.tooltip": "Si activée, un effet de dégradé sera affiché sur les bords de la vue du joueur. Cela influe généralement très peu sur les performances, sauf si celles-ci sont limitées par le taux de remplissage du processeur graphique.",
  "sodium.options.mipmap_levels.tooltip": "Contrôle le nombre de mipmaps qui seront utilisées pour les textures de modèles de blocs. Des valeurs élevées amélioreront la qualité visuelle des blocs à longue distance, mais pourront dégrader les performances lorsqu'il y a beaucoup de textures animées.",
  "sodium.options.use_block_face_culling.name": "Masquage des faces invisibles de blocs",
  "sodium.options.use_block_face_culling.tooltip": "Si activé, seuls les côtés des blocs qui font face à la caméra seront soumis pour le rendu. Cela peut éliminer un grand nombre de faces de blocs très tôt dans le processus de rendu, en économisant de la bande passante de la mémoire et du temps sur le GPU. Certains packs de ressources peuvent avoir des problèmes avec cette option, donc essayez de la désactiver si vous voyez des trous dans des blocs.",
  "sodium.options.use_fog_occlusion.name": "Utiliser l'occlusion de brouillard",
  "sodium.options.use_fog_occlusion.tooltip": "Si activée, les chunks déterminés comme étant complètement cachés par l'effet de brouillard ne seront pas affichés, améliorant ainsi les performances. Lorsque le brouillard est épais (par exemple sous l'eau), l'impact en sera d'autant plus important. Cependant, parfois, cette option peut résulter en des artéfacts visuels entre le brouillard et le ciel.",
  "sodium.options.use_entity_culling.name": "Masquage des entités invisibles",
  "sodium.options.use_entity_culling.tooltip": "Si activée, les entités déterminées comme étant invisibles seront ignorées pendant l'affichage. Cela peut améliorer les performances en évitant l'affichage des entités cachées sous terre ou derrière les murs.",
  "sodium.options.animate_only_visible_textures.name": "Animer uniquement les textures visibles",
  "sodium.options.animate_only_visible_textures.tooltip": "Si activé, seules les textures animées déterminées comme étant visibles seront mises à jour. Ceci peut grandement améliorer le framerate sur certaines machines, surtout avec des packs de ressources lourds. Si certaines textures ne sont plus animées alors qu'elles devraient l'être, essayez de désactiver cette option.",
  "sodium.options.cpu_render_ahead_limit.name": "Limite de pré-rendu CPU",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Spécifie le nombre maximal de frames que le CPU peut attendre du GPU pour terminer le rendu. Une valeur trop haute ou trop faible risque de rendre le framerate instable.",
  "sodium.options.cpu_render_ahead_limit.value": "%s image(s)",
  "sodium.options.performance_impact_string": "Impact sur les performances : %s",
  "sodium.options.use_persistent_mapping.name": "Utiliser le mappage persistant",
  "sodium.options.use_persistent_mapping.tooltip": "Si activé, une petite quantité de mémoire sera constamment mappée en tant que tampon de staging pour le téléchargement de chunk, aide à réduire l'instabilité du temps de charge du CPU lors du chargement ou de la mise à jour des chunks.\n\nNécessite OpenGL 4.4 ou ARB_buffer_storage.",
  "sodium.options.chunk_update_threads.name": "Threads de mise à jour de chunks",
  "sodium.options.chunk_update_threads.tooltip": "Spécifie le nombre de threads à utiliser pour la mise à jour des chunks. Augmenter le nombre de chunks peut améliorer la rapidité de chargement et de mise à jour des chunks, mais peut causer des saccades.",
  "sodium.options.always_defer_chunk_updates.name": "Forcer les mises à jour de chunk différées",
  "sodium.options.always_defer_chunk_updates.tooltip": "Lorsque activé, l'affichage n'attendra jamais que la mise à jour d'un chunk soit terminée, même lorsque celle-ci est importante. Dans certains cas, cela peut grandement améliorer la fréquence d'images, mais peut causer d'importants délais dans la mise à jour visuelle du monde.",
  "sodium.options.use_no_error_context.name": "Utiliser le profil sans erreur",
  "sodium.options.use_no_error_context.tooltip": "Si cette option est activée, le profil OpenGL sera créé avec la vérification des erreurs désactivée. Cela peut légèrement améliorer les performances, mais augmente également le risque que le jeu plante au lieu de gérer les erreurs OpenGL de manière élégante. Vous devriez désactiver cette option si vous rencontrez des plantages soudains et inexpliqués.",
  "sodium.options.buttons.undo": "Annuler",
  "sodium.options.buttons.apply": "Appliquer",
  "sodium.options.buttons.donate": "Offrez-nous un café !",
  "sodium.console.game_restart": "Le jeu doit être redémarré pour appliquer un ou plusieurs paramètres vidéo !",
  "sodium.console.broken_nvidia_driver": "Vos drivers graphiques NVIDIA ne sont pas à jour !\n * Cela causera des problèmes de performance sévères et des plantages quand Sodium est installé.\n * Veuillez mettre à jour vos drivers graphiques à la dernière version (version 536.23 ou plus récent.)",
  "sodium.console.pojav_launcher": "PojavLauncher n'est pas supporté par Sodium.\n * Vous avez de grandes chances de rencontrer des problèmes de performances extrêmes, des bogues graphiques et des plantages.\n * Vous serez livré à vous-même si vous décidez de continuer -- nous ne vous aiderons pas avec aucun bogue ou plantage !",
  "sodium.console.core_shaders_error": "Les packs de ressources suivants sont incompatibles avec Sodium :",
  "sodium.console.core_shaders_warn": "Les packs de ressources suivants sont possiblement être incompatibles avec Sodium :",
  "sodium.console.core_shaders_info": "Consultez les logs pour obtenir des informations détaillées."
}
