{
  "tough.dialogue.main/1": "Well, well, well. Look who decided to show their face.",
  "tough.dialogue.main/2": "Yo! How's life treating you today, tough guy?",
  "tough.dialogue.main/3": "Well, if it isn't Mr. Sunshine himself. What brings you here?",
  "tough.dialogue.main/4": "Spill it, what's the dealio with you today?",
  "tough.dialogue.main/5": "How's it going, tough stuff? Holding up alright?",
  "tough.dialogue.main/6": "Hey %1$s! What's crackin' in your world?",
  "tough.dialogue.main/7": "You won't believe this, but I was chillin' with %supporter% and bam! A zombie took a chunk out of him. Can you believe it? And guess what, I saw a zombie doppelganger of %supporter% today. Crazy, right?",

  "tough.dialogue.rumors.failed/1": "Zip, zero, zilch. I'm afraid I've got no new intel for you.",
  "tough.dialogue.rumors.lore/1": "Forget about Jax, Sirben is the true deity now, and his messengers MerlinWolfGames and Crow are making sure everyone knows it.",
  "tough.dialogue.rumors.lore/2": "Those wimpy Cyberdemons thought they could invade us, but Sirben and Luke put an end to that nonsense.",
  "tough.dialogue.rumors.lore/3": "2DA50 messed with the wrong crowd when they crossed paths with the Ancient Builder. They ventured into the Far Lands, never to be seen again.",
  "tough.dialogue.rumors.lore/4": "MerlinWolfGames went all out and built a badass temple for Sirben. It's a sight to behold, one of the ancient wonders, no doubt.",
  "tough.dialogue.rumors.lore/5": "The ancient builders were once mighty, but now they're nothing but a distant memory. They couldn't handle the awesomeness of Sirben.",
  "tough.dialogue.rumors.lore/6": "Legends of the ancient builders? Yeah, I've heard 'em. Those guys left behind ruins and temples all over the Overworld, remnants of their weak attempts at greatness.",

  "tough.dialogue.first.generic/1": "Who the heck are you? I ain't never seen you in these parts before.",
  "tough.dialogue.first.generic/2": "Well, well, well. Look who decided to show up. You lost or something?",
  "tough.dialogue.first.generic/3": "Huh, a newbie. Hope you ain't gonna be a waste of space like the rest of 'em.",
  "tough.dialogue.first.generic/4": "So, you think you're special, huh? Welcome to the village, stranger. Don't expect any special treatment.",
  "tough.dialogue.first.generic/5": "Finally, someone new. Maybe you'll actually bring something interesting to this dull place.",
  "tough.dialogue.first.generic/6": "Oh great, another face in the crowd. Try not to bore us too much, newbie.",

  "tough.dialogue.first.question/1": "Well, well, well. What's your purpose in gracing this humble village?",
  "tough.dialogue.first.question/2": "About time we had some fresh blood! What's your story, stranger?",
  "tough.dialogue.first.question/3": "Ha! Look at you, all decked out like a hero. Spill the beans, how did you end up in this dump?",
  "tough.dialogue.first.exploring/1": "This ain't no luxury resort, but you can crash here if you follow the damn rules.",
  "tough.dialogue.first.exploring/2": "Stick to the damn rules and you might just survive in this dump, outsider.",
  "tough.dialogue.first.exploring/3": "Show some respect, stranger. Follow the damn rules or get lost.",
  "tough.dialogue.first.settling/1": "So, we got ourselves another newbie in the village, huh?",
  "tough.dialogue.first.settling/2": "Well, well, well, look who decided to join the party. Welcome, I guess.",
  "tough.dialogue.first.settling/3": "Don't think you'll be getting any special treatment just because you decided to stick around. We've got enough hands, but I suppose you can try to be useful.",
  "tough.dialogue.first.settling/4": "Oh, look who's decided to grace us with their presence. You think you're gonna impress us by staying? We'll see about that.",
  "tough.dialogue.first.spent_night.success/1": "If you're looking for a place to rest, our inn's your best bet, no doubt.",
  "tough.dialogue.first.spent_night.success/2": "Recharge your batteries like a true champion at our top-notch inn.",
  "tough.dialogue.first.spent_night.success/3": "Craving a cozy bed and a feast fit for a warrior? Look no further than our legendary inn.",
  "tough.dialogue.first.spent_night.failed/1": "We're no innkeepers, and we sure ain't got the skills to make one. Tough break, partner.",
  "tough.dialogue.first.spent_night.failed/2": "No inn in these parts, partner. Sorry 'bout that!",
  "tough.dialogue.first.spent_night.failed/3": "Ain't no inn 'round here, stranger. Maybe try your luck in a different village?",

  "tough.dialogue.hug.success/1": "Took ya long enough to show up!",
  "tough.dialogue.hug.success/2": "'Bout time someone did something useful.",
  "tough.dialogue.hug.success/3": "Finally, something that doesn't completely suck.",
  "tough.dialogue.hug.success/4": "You're not completely useless, I guess.",
  "tough.dialogue.hug.success/5": "Huh, you actually know how to give a decent hug.",
  "tough.dialogue.hug.success/6": "Surprisingly, you're not as cold-hearted as I thought.",
  "tough.dialogue.hug.fail/1": "You're a mess! What have you been rolling in, garbage?",
  "tough.dialogue.hug.fail/2": "Hard pass, buddy.",
  "tough.dialogue.hug.fail/3": "Seriously? What's in it for me?",
  "tough.dialogue.hug.fail/4": "Remember when you insulted me by comparing me to a Neanderthal? Not happening.",
  "tough.dialogue.hug.fail/5": "To be honest, I wouldn't waste a hug on you after what you pulled off.",
  "tough.dialogue.hug.fail/6": "Gross! Back off! I don't want your cooties all over me!",
  "tough.dialogue.hug.fail/7": "Oh, really? Uh, thanks, I guess.",

  "tough.dialogue.kiss.success/1": "Ain't too shabby, sweetheart.",
  "tough.dialogue.kiss.success/2": "This ain't half bad, pumpkin.",
  "tough.dialogue.kiss.success/3": "You ain't half bad, sugar lips.",
  "tough.dialogue.kiss.success/4": "Well, well, well... You've got some skills, %1$s.",
  "tough.dialogue.kiss.success/5": "Hey, %1$s, you could give Ash a run for their money with those lips. *chuckles*",
  "tough.dialogue.kiss.fail/1": "Not if the entire village is watching.",
  "tough.dialogue.kiss.fail/2": "That pathetic excuse is what you call a kiss?",
  "tough.dialogue.kiss.fail/3": "Ash's kisses put yours to shame, kid.",
  "tough.dialogue.kiss.fail/4": "I've got two words for you... mouthwash, pronto!",
  "tough.dialogue.kiss.fail/5": "Oh, how generous of you to grace me with your lackluster attempt at affection.",
  "tough.dialogue.kiss.fail/6": "Get your grubby lips off me before I break your nose!",

  "tough.dialogue.chat.success/1": "Forget cookies and milk, I could devour a whole feast right now.",
  "tough.dialogue.chat.success/2": "Yeah, the weather's decent, I guess.",
  "tough.dialogue.chat.success/3": "I'm alright, just smashed my toe against the bed this morning. No big deal.",
  "tough.dialogue.chat.success/4": "An apple a day keeps those wimpy zombies at bay!",
  "tough.dialogue.chat.success/5": "Building my own village? Sounds like too much work. I'd rather nap.",
  "tough.dialogue.chat.success/6": "I caught a glimpse of %Supporter% the other day, strutting around in their fancy Diamond armor.",
  "tough.dialogue.chat.success/7": "%Supporter% blabbered on about discovering a chest full of diamonds as if it's some big achievement. Whatever.",
  "tough.dialogue.chat.success/8": "The weather is fine, I guess. Not that I care much about it.",
  "tough.dialogue.chat.success/9": "I've been stuck in this dump my whole life. Spiders and goblins? Pfft, they ain't got nothin' on me.",
  "tough.dialogue.chat.success/10": "Wonder what happened to %Supporter%. They took off from here ages ago. Good riddance.",
  "tough.dialogue.chat.success/12": "Did you hear what happened to %Supporter%? They got themselves into some idiotic mess. Figures.",
  "tough.dialogue.chat.success/13": "I thought about adopting one of those stray cats, but who's got the time? I'm too busy for that nonsense.",
  "tough.dialogue.chat.success/14": "Redecorating my house? Yeah, right. I'd rather sit on my lazy behind and do nothing.",
  "tough.dialogue.chat.success/15": "Kids? Maybe someday, if I find someone worth my time. Not holding my breath, though.",
  "tough.dialogue.chat.success/16": "Sometimes, I think about what my life would be like if I had chosen to live in that other village. Probably just as dull.",
  "tough.dialogue.chat.success/17": "Childhood memories? Yeah, I guess I had a few. Good times, I suppose.",
  "tough.dialogue.chat.success/18": "Haven't bothered to talk to my parents in ages. No need to visit them either.",
  "tough.dialogue.chat.success/19": "Traveling to the other village? Meh, I've got enough friends here. Don't need to see those losers.",
  "tough.dialogue.chat.success/20": "Cheese? I've heard of it. Just another overrated food, if you ask me.",
  "tough.dialogue.chat.fail/1": "Are you kidding me right now?",
  "tough.dialogue.chat.fail/2": "It's hard to fathom that it just spontaneously exploded, but okay.",
  "tough.dialogue.chat.fail/3": "You may think you're all that, but trust me, you're not.",
  "tough.dialogue.chat.fail/4": "You deserve to be locked up in a dungeon for that!",
  "tough.dialogue.chat.fail/5": "Ugh, could you please leave? Your outdated fashion sense is nauseating.",
  "tough.dialogue.chat.fail/6": "That's possibly the dumbest topic of conversation I've ever heard.",
  "tough.dialogue.chat.fail/7": "Why are you bothering me again? Can't you take a hint?",
  "tough.dialogue.chat.fail/8": "Huh? Did you say something? Sorry, I didn't bother to give a damn.",
  "tough.dialogue.chat.fail/9": "Excuse me? I can't believe you actually said that.",
  "tough.dialogue.chat.fail/10": "What's wrong with you? Why are you wasting my time with this nonsense?",
  "tough.dialogue.chat.fail/11": "People aren't fond of you, and I can see why. You're not exactly pleasant to be around.",
  "tough.dialogue.chat.fail/12": "Even zombies have better taste in company than you do.",
  "tough.dialogue.chat.fail/13": "You're as charming as a witch, and that's saying something.",
  "tough.dialogue.chat.fail/14": "If you keep talking to me, I'll make sure the guards forcibly remove you from my presence.",
  "tough.dialogue.chat.fail/15": "Huh? Oh sorry, your conversation bored me to tears.",
  "tough.dialogue.chat.fail/16": "Are you finally finished with your pointless chatter?",
  "tough.dialogue.chat.fail/17": "I wonder if anyone will mourn the loss of your incessant yapping when you mysteriously silence forever.",
  "tough.dialogue.chat.fail/18": "I'd rather gaze at a pig's behind than engage in conversation with you.",
  "tough.dialogue.chat.fail/19": "Are you done wasting my time now?",
  "tough.dialogue.chat.fail/20": "Seriously? You actually believe the earth is round? No edges? You must be delusional.",

  "tough.dialogue.story.success/1": "Seriously? I'm finding it hard to digest all that!",
  "tough.dialogue.story.success/2": "If only I had the guts to confront a creeper head-on.",
  "tough.dialogue.story.success/3": "I gotta admit, that story was actually impressive! Did you come up with it yourself?",
  "tough.dialogue.story.success/4": "Hold on a second, everything you just said happened yesterday? No freakin' way!",
  "tough.dialogue.story.success/5": "I swear I was in the vicinity yesterday, can't believe this news didn't reach me.",
  "tough.dialogue.story.success/6": "Hah! Classic %Supporter%! Always pulling off amazing things, huh?",
  "tough.dialogue.story.success/7": "The Legend of %Supporter% has been drilled into my brain a zillion times. Recite it once more!",
  "tough.dialogue.story.success/8": "Ah, so that's the secret behind unearthing your first diamond, huh?",
  "tough.dialogue.story.success/9": "You better swing by later! I'm dying to hear more of your incredible tales.",
  "tough.dialogue.story.fail/1": "Listen up, buddy! You better watch your mouth when it comes to my dear ol' mom.",
  "tough.dialogue.story.fail/2": "The whole village has a field day gossiping about your failures, pal.",
  "tough.dialogue.story.fail/3": "Are you seriously that dense? Can't wrap my head around it.",
  "tough.dialogue.story.fail/4": "Unbelievable! Even the creepers think you're a heartless monster!",
  "tough.dialogue.story.fail/5": "Seriously, dude? Taking down an innocent sheep? What's wrong with you?",
  "tough.dialogue.story.fail/6": "*snoring* Huh? Oh, wake me up when you finally say something interesting.",
  "tough.dialogue.story.fail/7": "You seriously wasted my precious time with that nonsense? Pathetic.",
  "tough.dialogue.story.fail/8": "Yawn! This is beyond boring, my friend. Step up your game.",
  "tough.dialogue.story.fail/9": "You've lost it, pal. And trust me, it's not in a good way at all.",
  "tough.dialogue.story.fail/10": "I fail to see how that was even remotely good. Get your act together.",

  "tough.dialogue.flirt.success/1": "You're one tough cookie!",
  "tough.dialogue.flirt.success/2": "Oh, please! Cut the act, tough guy!",
  "tough.dialogue.flirt.success/3": "*Rolls eyes* Do you really think that impresses me?",
  "tough.dialogue.flirt.success/4": "That was mildly impressive, I suppose. But don't let it go to your head!",
  "tough.dialogue.flirt.success/5": "How do you manage to look so intimidating every day? When I look at you, I feel a shiver down my spine.",
  "tough.dialogue.flirt.success/6": "Oh please, spare me! Your attempts at making me blush are laughable.",
  "tough.dialogue.flirt.fail/1": "Put your money where your mouth is if you dare to say such things.",
  "tough.dialogue.flirt.fail/2": "Oh please, spare me your empty words. You tried the same line on the blacksmith yesterday!",
  "tough.dialogue.flirt.fail/3": "You must be delusional if you think I'll ever believe that.",
  "tough.dialogue.flirt.fail/4": "Is that the best you've got? How pathetic.",
  "tough.dialogue.flirt.fail/5": "Even a creeper has more charm than you, and that's saying something.",
  "tough.dialogue.flirt.fail/6": "Absolutely not. Don't even think about it, ever.",
  "tough.dialogue.flirt.fail/7": "Quit giving me that look and refrain from uttering such nonsense in my presence again.",

  "tough.dialogue.joke.creative.success/1": "*Chuckles* That's mildly amusing.",
  "tough.dialogue.joke.creative.success/2": "Meh, it got a smirk out of me.",
  "tough.dialogue.joke.creative.success/3": "I suppose that's mildly entertaining, I guess.",
  "tough.dialogue.joke.creative.success/4": "You think you're funnier than %Supporter%? Yeah, right.",
  "tough.dialogue.joke.creative.success/5": "Heh, you think you're funny? Stick to mining, kid.",
  "tough.dialogue.joke.creative.success/6": "Hmph, that joke was marginally better than average.",
  "tough.dialogue.joke.creative.success/7": "Pfft, you're not even close to being as funny as Ash.",
  "tough.dialogue.joke.creative.success/8": "Well, I guess that was sort of amusing, in a way.",
  "tough.dialogue.joke.creative.failed/1": "Jokes? I don't have time for that nonsense.",
  "tough.dialogue.joke.creative.failed/2": "Pathetic attempt at humor. Try harder next time.",
  "tough.dialogue.joke.creative.failed/3": "Is that your idea of a joke? I've heard better from a cow.",
  "tough.dialogue.joke.creative.failed/4": "Really? That's the best joke you could come up with?",
  "tough.dialogue.joke.creative.failed/5": "I'm not impressed. Maybe someone with a lower IQ would find it amusing.",
  "tough.dialogue.joke.creative.failed/6": "Hilarious. Not.",
  "tough.dialogue.joke.creative.failed/7": "Spare us all from your failed attempts at comedy, amateur.",
  "tough.dialogue.joke.creative.failed/8": "You should take lessons from Ash if you ever want to be remotely entertaining.",

  "tough.dialogue.procreate_engaged/1": "I won't settle down until we're officially bound in holy matrimony.",
  "tough.dialogue.procreate_engaged/2": "No way am I bringing a tiny human into existence unless we've made a rock-solid commitment to each other.",

  "tough.dialogue.shake_hand.success/1": "That grip ain't bad, kid.",
  "tough.dialogue.shake_hand.success/2": "Your grip is surprisingly strong. Not bad, not bad at all.",
  "tough.dialogue.shake_hand.success/3": "Well, well, well, look who's got manners. Impressive.",
  "tough.dialogue.shake_hand.success/4": "Hey, don't get too comfortable, pal.",
  "tough.dialogue.shake_hand.success/5": "Well, well, if it ain't Mr. Sunshine himself. What brings you here?",
  "tough.dialogue.shake_hand.fail/1": "Are you kidding me? You think I'm gonna shake your hand after what you did to that poor cow?",
  "tough.dialogue.shake_hand.fail/2": "No way, pal. I ain't shaking hands with someone like you.",
  "tough.dialogue.shake_hand.fail/3": "Look, I ain't a stranger, so you can drop the act and spare me the pleasantries.",
  "tough.dialogue.shake_hand.fail/4": "Seriously? You expect me to believe this garbage? You're not fooling anyone with your fake politeness.",
  "tough.dialogue.shake_hand.fail/5": "Beat it, loser. I've got no time for your nonsense.",

  "tough.dialogue.main.morning/1": "Yo, morning!",
  "tough.dialogue.main.morning/2": "Up and at 'em, ready to put in some work?",
  "tough.dialogue.main.morning/3": "Still dragging your feet, huh? Me too.",
  "tough.dialogue.main.morning/5": "Looks like someone partied hard last night, huh?",
  "tough.dialogue.main.morning/6": "Wake up, sunshine. Bet you're in for a tough day.",
  "tough.dialogue.main.morning/7": "Did you manage to catch any shut-eye? You seem unusually perky.",
  "tough.dialogue.main.morning/8": "Rise and shine, lazybones!",
  "tough.dialogue.main.morning/9": "What a lovely morning! Time to make things happen today!",
  "tough.dialogue.main.morning/10": "Thinking of taking it easy today, not feeling too hot.",
  "tough.dialogue.main.morning/11": "My schedule is jam-packed today, just the thought of it exhausts me.",
  "tough.dialogue.main.morning/12": "Surprisingly had a restful night, might tackle something challenging today, who knows?",
  "tough.dialogue.main.evening/1": "Good evening, but don't expect any special treatment from me.",
  "tough.dialogue.main.evening/2": "So, how was your day? Probably just as mediocre as everyone else's.",
  "tough.dialogue.main.evening/3": "Another grueling day of work, just like every other day. No surprises there.",
  "tough.dialogue.main.evening/4": "The day flew by, not that it matters. There's always too much work and never enough time.",
  "tough.dialogue.main.evening/5": "I suppose I'll head home soon, but don't expect me to cook anything fancy. I've had enough of pleasing others.",
  "tough.dialogue.main.evening/6": "I wasted too much time today, just like every other day. Nothing new there.",
  "tough.dialogue.main.evening/7": "I might go for a nap soon, if I can even manage to find a comfortable spot. Rough mornings seem to be my specialty.",
  "tough.dialogue.main.evening/8": "It's getting late, and you won't catch me wandering around at night. I learned my lesson the hard way.",
  "tough.dialogue.main.evening/9": "Oh, hey. I was just buying some stuff for dinner. Don't bother me with small talk.",
  "tough.dialogue.main.night/1": "What's your deal, still awake?",
  "tough.dialogue.main.night/2": "You must love the night if you're out and about.",
  "tough.dialogue.main.night/3": "Nighttime, huh? A fan, I see.",
  "tough.dialogue.main.night/4": "Better stay close to the village. No one wants to be monster chow, right?",
  "tough.dialogue.main.night/5": "The guards give a false sense of security. Nighttime is still creepy as hell.",
  "tough.dialogue.main.night/6": "Darkness? Yeah, I guess it's serene. Kinda like a break from all the chaos.",
  "tough.dialogue.main.night/7": "Days are hectic, man. Nighttime walks are where it's at.",
  "tough.dialogue.main.night/8": "I'm beat. Gonna need to chill tomorrow, no doubt.",
  "tough.dialogue.main.night/9": "Can't wait to crash under the covers and forget all this noise.",
  "tough.dialogue.main.night/10": "Seriously, get some shut-eye. Tomorrow's packed for you, buddy.",

  "tough.dialogue.greet.mayor/1": "What's up, mayor?",
  "tough.dialogue.greet.mayor/2": "Take care, Mayor!",
  "tough.dialogue.greet.monarch/1": "Bow down before me, peasant.",
  "tough.dialogue.greet.monarch/2": "Show some respect to your superior, commoner.",

  "tough.dialogue.busy/1": "I ain't got time for chit-chat, I've got a mountain of work to tackle.",
  "tough.dialogue.busy/2": "Listen, buddy, I appreciate the attention, but my priority is getting this job done before the sun sets.",
  "tough.dialogue.busy/3": "Can't you see I'm swamped right now? Catch me on my break if you wanna chat.",
  "tough.dialogue.busy/4": "I hate to brush you off, but duty calls, and I can't keep the boss waiting. Let's catch up later.",
  "tough.dialogue.busy/5": "Blast it! I left my smelter unattended. We'll pick up this conversation when I'm not juggling flaming disasters.",
  "tough.dialogue.goaway/1": "Get lost.",
  "tough.dialogue.goaway/2": "Ain't you got nothin' else goin' on?",
  "tough.dialogue.goaway/3": "Look, %1$s, I ain't got time for chitchat.",
  "tough.dialogue.goaway/4": "Beat it, bother someone else!",
  "tough.dialogue.goaway/5": "Scram, you filthy barbarian!",

  "tough.dialogue.greet": "Hey! What's the deal? How you holding up?",
  "tough.dialogue.greet/1": "Hey! How's it hanging? Everything under control?",
  "tough.dialogue.greet/2": "Listen up %1$s! What's the latest?",
  "tough.dialogue.greet/3": "Well, well, well. What brings you here?",
  "tough.dialogue.greet/4": "Look at you, all fired up! How's the world treating ya?",
  "tough.dialogue.greet/5": "Greetings %1$s! You still kicking around, huh?",
  "tough.dialogue.greet/6": "Yo!",
  "tough.dialogue.greet/7": "Well, if it isn't your face again!",
  "tough.dialogue.greet/8": "Howdy! Good to lay eyes on you. What's the story?",
  "tough.dialogue.greet/9": "Hey! You survived another day, huh? Good to see ya!",

  "tough.dialogue.greet.negative/1": "Ugh, get lost, you're the absolute worst!",
  "tough.dialogue.greet.negative/2": "Oh great, it's you. Again. What a joy.",
  "tough.dialogue.greet.negative/3": "Huh?",
  "tough.dialogue.greet.negative/4": "Oh, it's only you. I was hoping for someone more interesting.",
  "tough.dialogue.greet.negative/5": "Back to bother me, huh? You never fail to disappoint.",

  "tough.dialogue.greet.success/1": "Yeah, not bad. Better than expected, I guess.",
  "tough.dialogue.greet.success/2": "Doing good? Well, I suppose that's something worth acknowledging.",
  "tough.dialogue.greet.success/3": "Happy to hear it, I guess. Don't expect me to throw a party though.",
  "tough.dialogue.greet.success/4": "So glad to hear that. I mean, it's not like it affects me in any way.",
  "tough.dialogue.greet.success/5": "Good to know it, I guess. Doesn't change anything for me though.",
  "tough.dialogue.greet.fail/1": "Tch.",
  "tough.dialogue.greet.fail/2": "Don't care 'bout that...",
  "tough.dialogue.greet.fail/3": "Whatever, I guess.",
  "tough.dialogue.greet.fail/4": "Seriously? Pff...",
  "tough.dialogue.greet.fail/5": "Meh.",

  "tough.dialogue.apologize.success/1": "Don't sweat it, accidents happen.",
  "tough.dialogue.apologize.success/2": "Cut yourself some slack, but don't let it happen again.",
  "tough.dialogue.apologize.success/3": "Not thrilled about it, but I'll let it slide. Just don't repeat it.",
  "tough.dialogue.apologize.success/4": "No biggie, but don't make it a habit.",
  "tough.dialogue.apologize.success/5": "Fine, but don't think you can screw up again and get away with it.",
  "tough.dialogue.apologize.fail/1": "Get lost!",
  "tough.dialogue.apologize.fail/2": "You smacked me on purpose, didn't ya?",
  "tough.dialogue.apologize.fail/3": "As if I'd be fooled by that lame excuse!",
  "tough.dialogue.apologize.fail/4": "That stung, so don't even bother with your apologies!",
  "tough.dialogue.apologize.fail/5": "Hah, not a chance, pal!",

  "tough.dialogue.location.failed/1": "Nah, ain't heard a damn thing worth my time.",
  "tough.dialogue.location.failed/2": "Look, buddy, I already told you, there's nothing around here that'll catch your fancy.",
  "tough.dialogue.location.failed/3": "Seriously? You think I've got time to waste on your little treasure hunts? We've got real work to do, unlike you adventure junkies.",
  "tough.dialogue.location.forgot/1": "Ah, I stumbled upon this epic location, right under my nose! But, typical me, I totally spaced marking it on the map. My bad.",
  "tough.dialogue.location.forgot/2": "You know, I was on the hunt for something mind-blowing. And guess what? I actually found it! Oh, wait... What was it again? Ugh, I completely blanked on noting it down. Sorry, folks.",
  "tough.dialogue.location.forgot/3": "Picture this",
  "tough.dialogue.location.igloo/1": "I stumbled upon some pathetic excuse of a dwelling at %2$s. Can you believe people actually think it's suitable to live in a house made of snow? Pathetic.",
  "tough.dialogue.location.igloo/2": "As I was passing by %2$s, I couldn't help but notice a forsaken igloo. Trust me, no one in their right mind would dare set foot in that place. And I must confess, there's something eerie about it. I swear, I've heard bone-chilling whispers whenever I've wandered close by...",
  "tough.dialogue.location.igloo/3": "You won't believe what I saw at %2$s. There's this sorry excuse for a shelter made entirely of ice. They call it an igloo, can you believe that? It's been abandoned for ages, and honestly, it's for the best. Who in their right mind would even consider living there?",
  "tough.dialogue.location.pyramid/1": "I spotted a damn pyramid at %2$s. You think you're brave enough to conquer it?",
  "tough.dialogue.location.pyramid/2": "People are blabbering about a freaking pyramid at %2$s. Maybe you'll get lucky and find something valuable in that death trap.",
  "tough.dialogue.location.pyramid/3": "Word on the streets is there's a pyramid over at %2$s. Some idiot adventurer thought he could handle it, but he's probably fish food by now. Don't be stupid like him.",
  "tough.dialogue.location.ruined_portal_desert/1": "Can you believe it? A busted portal waits for us at %2$s, stranded like a fool in that merciless desert.",
  "tough.dialogue.location.ruined_portal_swamp/1": "Hold onto your socks, because there's a wrecked portal in the swamp at %2$s. The Nether invaders didn't see this dump coming.",
  "tough.dialogue.location.ruined_portal/1": "You won't believe what I saw at %2$s - a completely wrecked portal, like it got hit by a freaking meteor or something. It's a total disaster zone.",
  "tough.dialogue.location.ruined_portal/2": "Hey, listen up, if you're brave enough to venture to %2$s, prepare yourself for a sight straight out of nightmares. That ruined nether portal is sending shivers down my spine, I tell ya.",
  "tough.dialogue.location.ruined_portal/3": "So, word on the street is that %2$s is home to a ruined nether portal. The fearless adventurers among us say it's cursed, haunted even. But hey, if you're feeling lucky, maybe you'll stumble upon some legendary loot. Just don't come crying to me when you wake up covered in slime, got it?",
  "tough.dialogue.location.ruined_portal_mountain/1": "You'll never guess what's up yonder in them mountains - a blasted ruined portal, waiting to be discovered by the brave ones.",
  "tough.dialogue.location.mansion/1": "Listen up, fool! If you dare venture to %2$s, you'll stumble upon a cursed mansion, crawling with those wretched illagers. Mark my words, stepping foot near that accursed place will be the last mistake you ever make.",
  "tough.dialogue.location.mansion/2": "You won't believe what I heard, pal. There's this humongous mansion over at %2$s, and guess who owns it? Those vile illagers! I'm telling you, if we had any sense, we'd pack our bags and hightail it out of here, pronto.",
  "tough.dialogue.location.monument/1": "Don't even think about going near that sunken castle at %2$s. Sea monsters are the least of your worries.",
  "tough.dialogue.location.monument/2": "So you're curious about those ancient ruins in the ocean at %2$s, huh? Well, brace yourself for danger and mayhem if you dare to explore them.",
  "tough.dialogue.location.shipwreck/1": "So there's this shipwreck down at %2$s. Used to be owned by the Eastern Alliance Company, back when they thought they ruled the seas.",
  "tough.dialogue.location.shipwreck/2": "You won't believe it, mate. Got wind of a shipwreck over at %2$s. Fishermen stumbled upon it. Bet there's some real treasure lurking in those depths. Gotta get my hands on it, I tell ya.",
  "tough.dialogue.location.shipwreck_beached/1": "Listen up, there's this wrecked ship at %2$s, right on the damn beach. It's impossible to overlook, trust me.",
  "tough.dialogue.location.shipwreck_beached/2": "Head towards %2$s and feast your eyes upon the ship stranded on the shore. I'm dying to know how the hell it ended up like that, though...",
  "tough.dialogue.location.village_desert/1": "Fear not, weary traveler, for just beyond lies a village, defying the odds in the midst of this unforgiving desert.",
  "tough.dialogue.location.village_taiga/1": "There's a darn village over yonder, smack dab in the middle of the taiga biome.",
  "tough.dialogue.location.village_taiga/2": "Head on over to that place they call %2$s. It's nestled deep within the taiga, if my memory serves me right.",
  "tough.dialogue.location.village_snowy/1": "Check out %2$s, there's a village over there. It's freezing, so bundle up!",
  "tough.dialogue.location.village_snowy/2": "Hey, I heard there's a village at %2$s in the snowy plains. The people there are friendly, but man, it's like an icebox!",
  "tough.dialogue.location.village_plains/1": "Over yonder lies another quaint village, if you dare venture forth.",
  "tough.dialogue.location.village_plains/2": "Journey into the heart of the plains, and behold! Behold another village, hidden amidst the vastness.",
  "tough.dialogue.location.village_savanna/1": "Yo, check it out! There's another village over yonder at %2$s. Man, it's scorching hot over there, I'm telling ya!",
  "tough.dialogue.location.village_savanna/2": "Listen up, in the savanna at %2$s, you gonna stumble upon another village. And let me tell ya, those folks over there? They're real nice, like the real deal, buddy!",
  "tough.dialogue.location.swamp_hut/1": "Stay away from that cursed swamp over there in %2$s. I ain't joking, that witch ain't no joke. Steer clear if you know what's good for ya.",
  "tough.dialogue.location.swamp_hut/2": "You'd be wise to give that swamp in %2$s a wide berth. That witch's hut ain't no place for the faint-hearted. One step near and you'll be cursin' yourself. Trust me, I've seen it all.",
  "tough.dialogue.location.mineshaft/1": "We had a damn mine here once, but it got shut down after that bloody accident. Must be somewhere nearby %2$s.",
  "tough.dialogue.location.mineshaft/2": "Yeah, we had this blasted mine around these parts, not far from %2$s, but it's become a haven for those monstrous creatures. Ain't no place for the weak-hearted, mate. Better watch your back if you plan on venturing down there.",
  "tough.dialogue.location.jungle_pyramid/1": "You think you're brave enough to tackle the ancient temple at %2$s? Well, good luck with that. Just remember, those traps are no joke. One wrong move and you'll be a goner.",
  "tough.dialogue.location.jungle_pyramid/2": "So, you're heading to %2$s in the jungle, huh? Well, consider yourself warned. Those ancient ruins are a deathtrap. Only the toughest survive, and I'm not so sure you've got what it takes. But hey, it's your funeral.",
  "tough.dialogue.location.pillager_outpost/1": "Hmph, those blasted Pillagers think they can just waltz into our territory at %2$s! They've set up a pathetic outpost right next to us, but mark my words, they won't last long if they dare to attack us again. Our village is ready to give them a taste of their own medicine!",
  "tough.dialogue.location.pillager_outpost/2": "You won't believe it, but those pesky Pillagers have infested an outpost at %2$s. They think they can intimidate us with their presence, but little do they know, we're not ones to be trifled with. If you even dare to go near that place, prepare yourself for a fight, because those vile creatures shoot first and ask questions later.",
  "tough.dialogue.location.pillager_outpost/3": "Listen up, adventurer. If you're brave enough to face the Pillagers head-on, then head over to %2$s. Those despicable scoundrels have set up their rotten outpost there. But let me tell you, if you manage to defeat them, there might be some valuable loot waiting for you. The entire village is counting on you to rid us of those vermin, and we'll be forever grateful if you succeed.",
  "tough.dialogue.location.ancient_city/0": "I caught wind of some eerie sounds echoing through the depths of %2$s, deep underground. Gave me the chills.",
  "tough.dialogue.location.ancient_city/1": "My gut tells me there's something burrowed deep within the earth at %2$s. Something powerful. I can sense it.",
  "tough.dialogue.location.ancient_city/3": "Rumors have it that a long-lost ancient city lies dormant beneath the surface of %2$s. Haven't laid my eyes on it yet, but mark my words, it's down there.",

  "tough.dialogue.joke.monster.success/1": "Hmph! That Skelly had it coming, no doubt!",
  "tough.dialogue.joke.monster.success/2": "Ha! So that zombie thought it could take you down with a shovel? Pathetic!",
  "tough.dialogue.joke.monster.success/3": "You made that spider regret crossing your path! Hah!",
  "tough.dialogue.joke.monster.success/4": "Well, well, well! You managed to get a skeleton to take out a creeper?! Impressive, I suppose, heh!",
  "tough.dialogue.joke.monster.success/5": "Haha! Can you believe how utterly clueless those cave spiders are?",
  "tough.dialogue.joke.monster.failed/1": "You think skeletons are a laughing matter? Think again, punk!",
  "tough.dialogue.joke.monster.failed/2": "Creepers blowing up might be funny to you, but I've seen enough destruction to last a lifetime!",
  "tough.dialogue.joke.monster.failed/3": "Do you even realize that zombies and skeletons were once human? Show some respect!",
  "tough.dialogue.joke.monster.failed/4": "A falling enderman? How utterly predictable. Try coming up with something original, if you can!",
  "tough.dialogue.joke.monster.failed/5": "Silverfish on the toilet, huh? Real mature. I've heard that joke a million times, and it's just as lame every single time.",

  "tough.dialogue.joke.animal.success/1": "Well, it's a real shame for the sheep that it lost its precious wool. But hey, gotta admit, it got a good chuckle out of me!",
  "tough.dialogue.joke.animal.success/2": "And then, ladies and gentlemen, the big bad wolf goes head over heels for the innocent little sheep. Talk about twisted romance, huh?",
  "tough.dialogue.joke.animal.success/3": "Oh, you won't believe it! Those silly chickens, they never cease to amaze me. Who knew they had such comedic talent?",
  "tough.dialogue.joke.animal.success/4": "Ah, that's just plain dumb, but you know what? I can't help but find it oddly amusing. Count me in for a good laugh!",
  "tough.dialogue.joke.animal.success/5": "Ah, don't you worry, my friend. Cows, those lovely creatures, they've got the incredible power of producing milk non-stop! It's like their divine duty to keep us all hydrated with their never-ending supply.",
  "tough.dialogue.joke.animal.failed/1": "What a pathetic attempt at humor. Mocking innocent animals? Truly disgraceful.",
  "tough.dialogue.joke.animal.failed/2": "Hah! You think mocking my pig will make you tough? Think again, buddy.",
  "tough.dialogue.joke.animal.failed/3": "How dare you stoop so low as to crack a joke about that poor creature. Have some decency!",
  "tough.dialogue.joke.animal.failed/4": "Making fun of a cow's eyebrows? Wow, you must really be scraping the bottom of the barrel for jokes.",

  "tough.dialogue.flirt.slap/1": "Watch where you're going, punk!",
  "tough.dialogue.flirt.slap/2": "Are you trying to impress me with those feeble attempts at flirting? You'll have to do better than that, rookie!",
  "tough.dialogue.kiss.slap/1": "Who do you think you are, disrespecting me like that?",
  "tough.dialogue.kiss.slap/2": "Do you really want to test me? Cause if you do, you're gonna regret it.",

  "tough.dialogue.chat.plains/1": "You like the plains? Ha, it's the only place I've ever known. Maybe someday I'll venture out and see what real action looks like...",
  "tough.dialogue.chat.plains/2": "Peaceful? Yeah, I guess if you're into that boring stuff. Me, I crave excitement, not some snooze-fest in the plains.",
  "tough.dialogue.chat.plains/3": "Beautiful? Sure, if you're into staring at grass all night. Give me the thrill of a jungle any day.",
  "tough.dialogue.chat.plains/4": "Laying down and gazing at the sky? Please, I've got better things to do than waste my time with that nonsense.",
  "tough.dialogue.chat.plains/5": "Clean and fresh air? Yeah, right. Have you ever smelled the ocean in a beach biome? Now that's what I call refreshing.",
  "tough.dialogue.chat.plains/6": "Plain and simple, huh? Sounds like a life of mediocrity if you ask me. I prefer a biome with a little more pizzazz.",
  "tough.dialogue.chat.plains/7": "Wild flowers and crushes? Sounds like a sappy love story. In the real world, we have bigger things to worry about than giving flowers to our elementary school sweethearts.",
  "tough.dialogue.chat.plains/8": "Pretty sunrise, huh? I've seen better. Maybe if you stop wasting your time staring at the sky, you'll actually accomplish something.",
  "tough.dialogue.chat.savanna/1": "The scorching heat of the savanna may be unbearable for some, but I thrive in this relentless inferno. Winter is for the weak.",
  "tough.dialogue.chat.savanna/2": "Those pesky llamas may test my patience, but I find a twisted pleasure in their incessant antics. This savanna is the only place where I can truly enjoy their ridiculousness.",
  "tough.dialogue.chat.savanna/3": "The architecture in this savanna is a testament to the strength and resilience of its inhabitants. It's a reflection of my own indomitable spirit, which is why I chose to call this place home.",
  "tough.dialogue.chat.savanna/4": "Do not dare overlook the savanna biome. Its apparent plainness conceals a hidden power, only comprehensible to those with a discerning eye. I revel in the untapped potential that lies within this seemingly generic land.",
  "tough.dialogue.chat.savanna/5": "Unlike those feeble desert villages, our savanna boasts an abundance of life-sustaining rivers. We may not rely on the capricious rain, but we have mastered the art of survival in this parched wilderness.",
  "tough.dialogue.chat.savanna/6": "Behold the mesmerizing undulations of the hills and terrains in this savanna! It's as if the very land itself dances to my command, showcasing my dominance over this vast expanse.",
  "tough.dialogue.chat.savanna/7": "When the blistering heat threatens to engulf me, I seek solace under the mighty acacia trees. Their shade becomes my sanctuary, allowing me to endure the grueling toil of the day with an unwavering resolve.",
  "tough.dialogue.chat.savanna/8": "Savanna villages, my dear interlocutor, possess the most succulent and delectable melons and pumpkins known to humanity. We trade these tantalizing treasures with other villages, leaving them in awe of our agricultural prowess.",
  "tough.dialogue.chat.taiga/1": "The woods are my domain. They provide endless resources, fuel for my fire, and a bountiful hunting ground to conquer.",
  "tough.dialogue.chat.taiga/2": "Cold? Ha! The taiga biome is a rugged paradise. We've got everything we need right here, and I wouldn't trade it for the weak comforts of anywhere else.",
  "tough.dialogue.chat.taiga/3": "Taiga forests, now that's what I call epic. The sweet berries? They're just the tip of the iceberg. We thrive in this wild beauty.",
  "tough.dialogue.chat.taiga/4": "Foxes in the taiga forests? Cunning little devils. I toss them sweet berries as a bribe, but who knows what they're really up to.",
  "tough.dialogue.chat.taiga/5": "Wolves here are no match for our resourcefulness. With so much food at our fingertips, we've tamed these wild beasts to serve and protect us.",
  "tough.dialogue.chat.taiga/6": "The air in the taiga is pure adrenaline. Every breath ignites a fire in my soul, filling me with the strength to conquer any challenge.",
  "tough.dialogue.chat.taiga/7": "Sweet berry bushes may have the juiciest treats, but watch out for their thorny vengeance. One prick and you'll be reminded of the wild's unforgiving nature.",
  "tough.dialogue.chat.taiga/8": "Rain in the taiga may be bone-chilling, but it's a small price to pay for the serenity it brings. The calming rhythm soothes the warrior's spirit within me.",
  "tough.dialogue.chat.snowy_plains/1": "This cold doesn't faze me, as long as I've got a roaring fire and a stack of firewood.",
  "tough.dialogue.chat.snowy_plains/2": "Who needs central heating when you've got freezing temperatures? At least the ice fishing is top-notch! Haha!",
  "tough.dialogue.chat.snowy_plains/3": "This weather calls for extreme coziness - I'm talking blankets, books, and a cozy fire by my side!",
  "tough.dialogue.chat.snowy_plains/4": "Snow brings back memories of epic snowball battles with my crew. Man, those were the days that I seriously miss.",
  "tough.dialogue.chat.snowy_plains/5": "Those night-time strays in the village are a total pain. Their tipped arrows are a complete nightmare!",
  "tough.dialogue.chat.snowy_plains/6": "Keep an eye out for those wolves, folks. The guards have spotted those sneaky predators lurking nearby.",
  "tough.dialogue.chat.snowy_plains/7": "Let me tell you, touching an iron golem is a rookie mistake. Once it's got you, you're stuck like glue all day long!",
  "tough.dialogue.chat.snowy_plains/8": "Ah, my childhood days! Pumpkin pie was just the beginning. I'd build snow golems out of my dad's prized pumpkin stash. Good times!",
  "tough.dialogue.chat.desert/1": "It's scorching in this godforsaken desert, but at least we don't freeze our butts off in the winter.",
  "tough.dialogue.chat.desert/2": "This desert is an eternal inferno of heat.",
  "tough.dialogue.chat.desert/3": "Ugh, this desert is so hot, I'm either constantly sun-kissed or sunburnt.",
  "tough.dialogue.chat.desert/4": "When the night falls, the desert sky becomes a mesmerizing oasis of coolness and starry wonder.",
  "tough.dialogue.chat.desert/5": "Damn, the sun is merciless today. I feel like a crispy chicken nugget.",
  "tough.dialogue.chat.desert/6": "Damn, the sun is relentless today!",
  "tough.dialogue.chat.desert/7": "Have you spotted any blasted rabbits? They camouflage themselves perfectly in this barren wasteland!",
  "tough.dialogue.chat.desert/8": "One major downside of this cursed place are those damn husks. They drain your energy and leave you famished! It's infuriating!",
  "tough.dialogue.chat.desert/9": "Stepped on a prickly cactus the other day. You really have to watch your every move in this treacherous hellhole!",
  "tough.dialogue.chat.desert/10": "Life in this arid desert is an unending battle, but thankfully, we have this village that provides us with the bare necessities of water and food.",

  "tough.dialogue.story.exploring.success/1": "Impressive! I'll conquer the world one day, mark my words!",
  "tough.dialogue.story.exploring.success/2": "Damn! It must be mind-blowing to roam freely and discover new horizons. Don't get me wrong, I adore my village, family, and friends, but your tales make me green with envy!",
  "tough.dialogue.story.exploring.success/3": "You must have some serious guts to venture into the uncharted territories like that. You've got my respect, no doubt.",
  "tough.dialogue.story.exploring.fail/1": "Your tales are as stale as moldy bread.",
  "tough.dialogue.story.exploring.fail/2": "Impressive. I bet you think you're the toughest block in the mines, huh? Don't bruise your ego on all that boasting, tough guy.",
  "tough.dialogue.story.exploring.fai/l3": "Conversing with you is akin to conversing with a feeble-minded imbecile who aspires to be an adult someday. Minus the endearing factor, of course.",

  "tough.dialogue.story.nether.success/1": "Is it that scorching there?! I bet you're sweating buckets!",
  "tough.dialogue.story.nether.success/2": "Hah! So you think you're some kind of tough guy, huh? Surviving in that hellish wasteland. Well, color me impressed.",
  "tough.dialogue.story.nether.success/3": "The Nether, huh? I've heard it's a goldmine for the fearless. Shame I'm too busy conquering other realms to bother with it.",
  "tough.dialogue.story.nether.success/4": "Scared? Ha! Only weaklings like you would even consider being scared. I could handle the Nether blindfolded, no problem.",
  "tough.dialogue.story.nether.success/5": "Tell me, have you come face to face with those Zombified Piglins yet? I bet they quiver in fear as soon as they lay eyes on you!",
  "tough.dialogue.story.nether.fail/1": "You must be clueless if you've never braved the fiery depths of the Nether.",
  "tough.dialogue.story.nether.fail/2": "Your incompetence is crystal clear now that I know you were pummeled by Piglins.",
  "tough.dialogue.story.nether.fail/3": "I couldn't care less if you claim to have Nether experience. Your storytelling skills are as feeble as a baby zombie.",
  "tough.dialogue.story.nether.fail/4": "Hah! With your scrawny appearance, I highly doubt you possess the strength to withstand the Nether's wrath.",
  "tough.dialogue.story.nether.fail/5": "My grandpa was a true Nether conqueror, and he never mentioned a word about warped fungus. You're nothing but a deceitful faker!",

  "tough.dialogue.story.enderdragon.success/1": "Unbelievable! You actually managed to snatch the dragon egg, huh?",
  "tough.dialogue.story.enderdragon.success/2": "Whoa! So you've gone and vanquished that legendary beast, huh? The village won't stop talking about your epic triumph!",
  "tough.dialogue.story.enderdragon.fail/1": "Are you out of your mind? The ender dragon is nothing but a fairy tale.",
  "tough.dialogue.story.enderdragon.fail/2": "You gotta be kidding me. No one in their right mind would even dream of taking on that dragon!",

  "tough.dialogue.story.wither.success/1": "No way! The Wither is a force of absolute chaos!",
  "tough.dialogue.story.wither.success/2": "Are you kidding me? You actually defeated the Wither? That's beyond insane!",
  "tough.dialogue.story.wither.fail/1": "You expect me to buy that load of nonsense?",
  "tough.dialogue.story.wither.fail/2": "Ha! You're a sorry sight, but not sorry enough to convince me of that rubbish.",

  "tough.dialogue.stay.fail/1": "Nah, I don't have time for this small village. I'm a true adventurer!",
  "tough.dialogue.stay.fail/2": "Thanks for the offer, but I'd rather be out there, facing danger and exploring the vast world!",
  "tough.dialogue.stay.fail/3": "This village is decent, but it's not enough for a true adventurer like me. I need more excitement and challenges!",
  "tough.dialogue.stay.repeat/1": "Seriously? I already answered that.",
  "tough.dialogue.stay.repeat/2": "Are you even listening? I already told you.",
  "tough.dialogue.stay.success/1": "Much obliged, I reckon this village ain't half bad. I'll stick around, if that's what you're after.",
  "tough.dialogue.stay.success/2": "Spectacular, I reckon this village is mighty fine. I've got a hankering to stay put, if you catch my drift.",
  "tough.dialogue.stay.no_space/1": "Ugh, this village is way too cramped for my liking.",
  "tough.dialogue.stay.no_space/2": "I might consider staying, but it looks like there ain't a single spare bed in sight.",

  "tough.dialogue.hire/1": "Fine, I'm here to lend a hand. Just give me a heads-up when you require my assistance. I'll be impatiently waiting for those emeralds!",
  "tough.dialogue.hire/2": "Sure thing! Don't hesitate to call on me when you're in a bind. I'll be hanging around, eagerly anticipating those precious emeralds!",
  "tough.dialogue.hire/3": "Excellent choice! Prepare yourself to witness an unparalleled level of skill and dedication. Just make sure those emeralds are within arm's reach!",
  "tough.dialogue.no_money/1": "Don't even think about hiring me without enough emeralds!",
  "tough.dialogue.no_money/2": "Are you kidding me? You think you can afford my services with that paltry amount of emeralds? Think again!",
  "tough.dialogue.no_money/3": "Listen up, buddy. My expertise comes at a price, a price much higher than what you're offering. Give me more emeralds if you want my help.",

  "tough.dialogue.main.rock_paper_scissor/1": "I hope you're ready to taste defeat in Rock Paper Scissor, because I'm gonna crush you!",
  "tough.dialogue.rock_paper_scissor/1": "Let's settle this like real warriors! Rock, paper, scissors, go!",
  "tough.dialogue.rock_paper_scissor/2": "You better brace yourself, 'cause I'm about to take you down and claim victory!",
  "tough.dialogue.rock_paper_scissor.rock/1": "Rock, baby! Unleash the power of the almighty rock!",
  "tough.dialogue.rock_paper_scissor.paper/1": "Paper, the coward's choice. Don't think for a second it's gonna save you from the mighty force of my rock!",
  "tough.dialogue.rock_paper_scissor.scissor/1": "Scissor, punk! You're about to get sliced and diced!",
  "tough.dialogue.rock_paper_scissor.loose.rock/1": "Paper! I outsmarted you, as expected!",
  "tough.dialogue.rock_paper_scissor.loose.paper/1": "I'll slice through your flimsy paper with my unstoppable scissors!",
  "tough.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors are no match for my rock-solid strength, loser! Victory is mine!",
  "tough.dialogue.rock_paper_scissor.win.rock/1": "Hmph, rock obliterates scissor, I've been defeated.",
  "tough.dialogue.rock_paper_scissor.win.paper/1": "I've yet to encounter a rock that poses any real challenge to my superiority.",
  "tough.dialogue.rock_paper_scissor.win.scissor/1": "You may have won this round with your silly paper, but mark my words, I'll be back with my scissors, ready to shred your confidence to pieces. Watch your back.",
  "_": ""
}
