{
  "athletic.dialogue.main/1": "Well, well, well! Look who decided to show up!",
  "athletic.dialogue.main/2": "Yo! How's it going, champ?",
  "athletic.dialogue.main/3": "Hey there, buddy! Looking all energized today!",
  "athletic.dialogue.main/4": "Any thrilling adventures lined up for you today?",
  "athletic.dialogue.main/5": "Feeling pumped up today, huh?",
  "athletic.dialogue.main/6": "Yo, %1$s! What's the latest buzz?",
  "athletic.dialogue.main/7": "Dude, you won't believe what happened! I was out jogging with %supporter%, and out of nowhere, a zombie comes lunging at us! But don't worry, %supporter% handled it like a pro. Speaking of which, guess who I spotted in town today? Zombie lookalike %supporter%!",

  "athletic.dialogue.rumors.failed/1": "Well, well, well, looks like my rumor radar is showing zero activity. No news to report, sorry.",
  "athletic.dialogue.rumors.lore/1": "You won't believe it, but Jax's followers are still going strong. However, the cult of Sirben is gaining momentum, thanks to the athletic prophets MerlinWolfGames and Crow shouting his praises from the mountaintops!",
  "athletic.dialogue.rumors.lore/2": "Can you believe it? Those pesky Cyberdemons thought they could invade our peaceful realm. But fear not, Sirben and the mighty Luke swooped in and put an end to their shenanigans. Talk about an epic showdown!",
  "athletic.dialogue.rumors.lore/3": "So, get this",
  "athletic.dialogue.rumors.lore/4": "You won't find a more dedicated athlete than MerlinWolfGames. The guy went ahead and constructed an awe-inspiring temple solely devoted to Sirben. Now that's what I call commitment to the game!",
  "athletic.dialogue.rumors.lore/5": "You know, there used to be this incredible race of builders, but they vanished into thin air. Poof! Now, all that's left are the crumbling ruins of their once majestic structures. It's like they were sprinting towards greatness and then vanished in a puff of smoke.",
  "athletic.dialogue.rumors.lore/6": "Have you heard the legends of the ancient builders? They were like the marathon runners of the Overworld, leaving behind a trail of ruins and temples that still fascinate us to this day. It's like they were on a never-ending race to create architectural wonders!",

  "athletic.dialogue.first.generic/1": "Hey there, newcomer! Ready to test your skills in this village?",
  "athletic.dialogue.first.generic/2": "Well, well, well, look who decided to join the action-packed village. Welcome!",
  "athletic.dialogue.first.generic/3": "Well, well, what do we have here? A fresh face ready to tackle the challenges of our village!",
  "athletic.dialogue.first.generic/4": "Prepare for the adventure of a lifetime, stranger! Welcome to our village, where the strong thrive.",
  "athletic.dialogue.first.generic/5": "It's been ages since we've had a newcomer with some true athletic spirit. Buckle up and enjoy the ride!",
  "athletic.dialogue.first.generic/6": "Greetings, brave soul! Welcome to our village, where the thrill-seekers are always welcomed with open arms.",

  "athletic.dialogue.first.question/1": "Greetings, wanderer! What quest hath thou embarked upon, to grace our village with thy presence?",
  "athletic.dialogue.first.question/2": "Ah, a fresh challenger appears! Pray tell, what daring exploits have led you to venture into our humble abode?",
  "athletic.dialogue.first.question/3": "By the muscles of Heracles! Art thou a true hero of the realm? Pray enlighten me, how didst thou navigate thy way to this sanctuary?",
  "athletic.dialogue.first.exploring/1": "This ain't no fancy place, but you can stick around if you play by the rules, buddy.",
  "athletic.dialogue.first.exploring/2": "Follow the rules, pal, and you can call this joint home.",
  "athletic.dialogue.first.exploring/3": "Listen up, traveler. Keep it classy and you're welcome to hang around.",
  "athletic.dialogue.first.settling/1": "It's awesome to spot another soul in this little village!",
  "athletic.dialogue.first.settling/2": "Hey there, new buddy! Step right into our village!",
  "athletic.dialogue.first.settling/3": "Delighted to have another strong arm to lend around here!",
  "athletic.dialogue.first.settling/4": "So, you've made up your mind to stick around? Fantastic decision, my friend!",
  "athletic.dialogue.first.spent_night.success/1": "Our inn is top-notch, perfect for a weary traveler like you.",
  "athletic.dialogue.first.spent_night.success/2": "Looking for a place to recharge those tired muscles? Look no further than our incredible inn!",
  "athletic.dialogue.first.spent_night.success/3": "Need a cozy bed and a hearty meal? Our inn is the ultimate destination for rejuvenation!",
  "athletic.dialogue.first.spent_night.failed/1": "Hey there, sorry to break it to you, but we're not exactly experts in the inn-building department. Gotta admit, we totally lack the finesse for that.",
  "athletic.dialogue.first.spent_night.failed/2": "Oh, bummer! No inn to be found in this village, my friend. Apologies for the inconvenience!",
  "athletic.dialogue.first.spent_night.failed/3": "You know what? If you're on the hunt for an inn, I'd suggest trying your luck in a different village. They might have just what you need!",

  "athletic.dialogue.hug.success/1": "Hey, been ages since we last crossed paths!",
  "athletic.dialogue.hug.success/2": "Thanks for that, bro! Totally needed it.",
  "athletic.dialogue.hug.success/3": "Finally, something that made my day worthwhile.",
  "athletic.dialogue.hug.success/4": "You're as cozy as a freshly fluffed pillow!",
  "athletic.dialogue.hug.success/5": "Oh, nice one! *Gives you a solid bear hug in return*",
  "athletic.dialogue.hug.success/6": "Wow! You're radiating some serious warmth, dude!",
  "athletic.dialogue.hug.fail/1": "You're all sweaty and dirty!",
  "athletic.dialogue.hug.fail/2": "Pass, bro.",
  "athletic.dialogue.hug.fail/3": "Huh, what's the deal?",
  "athletic.dialogue.hug.fail/4": "Are you kidding? I remember when you tripped during the marathon!",
  "athletic.dialogue.hug.fail/5": "Honestly, I can't bring myself to hug you after that embarrassing display.",
  "athletic.dialogue.hug.fail/6": "Back off, dude! Your sweat is repulsive!",
  "athletic.dialogue.hug.fail/7": "Oh, um... thanks, I guess?",

  "athletic.dialogue.kiss.success/1": "I could kiss you all day long, baby!",
  "athletic.dialogue.kiss.success/2": "I'm head over heels for you, babe!",
  "athletic.dialogue.kiss.success/3": "Mmm, your lips are as sweet as victory on the field!",
  "athletic.dialogue.kiss.success/4": "Mmm! Your kisses are like an energy drink for my soul.",
  "athletic.dialogue.kiss.success/5": "Oh! You're the MVP of kisses, %1$s.",
  "athletic.dialogue.kiss.success/6": "%1$s, your smooches could win gold in the Olympic Games! *giggles*",
  "athletic.dialogue.kiss.fail/1": "Not if the whole world is watching, my friend.",
  "athletic.dialogue.kiss.fail/2": "Is that your idea of a kiss? I've seen better moves on the field!",
  "athletic.dialogue.kiss.fail/3": "Ash's kisses are on a whole other level compared to that weak attempt of yours.",
  "athletic.dialogue.kiss.fail/4": "Let me give you some advice - two words",
  "athletic.dialogue.kiss.fail/5": "Well, thanks for the effort, I guess?",
  "athletic.dialogue.kiss.fail/6": "Get off me! I need a cool down, not a wrestling match.",

  "athletic.dialogue.chat.success/1": "Oh man, cookies and milk are like the ultimate power snack!",
  "athletic.dialogue.chat.success/2": "You know what? The weather is perfect for a hardcore workout!",
  "athletic.dialogue.chat.success/3": "I'm doing great, just brushed off that toe injury like a champ.",
  "athletic.dialogue.chat.success/4": "Forget apples, I chow down on protein bars to stay zombie-proof!",
  "athletic.dialogue.chat.success/5": "My ultimate ambition is to build my own village, but I need to get off this couch first.",
  "athletic.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter% rocking a set of diamond armor, like a boss!",
  "athletic.dialogue.chat.success/7": "My buddy %Supporter% dropped a bombshell on me. They scored an entire chest full of diamonds yesterday!",
  "athletic.dialogue.chat.success/8": "Isn't the weather totally amazing? I've been crushing my outdoor workouts in this sunshine.",
  "athletic.dialogue.chat.success/9": "I've lived here forever, and these spiders and goblins don't even faze me. I'm a beast!",
  "athletic.dialogue.chat.success/10": "Seriously, what's the deal with %Supporter%? They vanished from here ages ago. Probably off on some crazy adventure.",
  "athletic.dialogue.chat.success/12": "Have you heard the wild story about %Supporter%? Trust me, it's mind-blowing.",
  "athletic.dialogue.chat.success/13": "I've been thinking of adopting a stray cat lately, but my insane fitness routine is keeping me too busy.",
  "athletic.dialogue.chat.success/14": "I'm itching to give my house a makeover, but my laziness is putting up a tough fight.",
  "athletic.dialogue.chat.success/15": "So, I'm totally ready to start a family. Just need to find a partner who can keep up with my insane athleticism.",
  "athletic.dialogue.chat.success/16": "Sometimes, I wonder what life would be like if I had chosen the other village. Probably a nonstop adrenaline rush!",
  "athletic.dialogue.chat.success/17": "Ah, the good ol' days of my childhood. Endless adventures and epic playtimes. I miss them big time.",
  "athletic.dialogue.chat.success/18": "It's been ages since I caught up with my parents. I need to make time for a power visit soon.",
  "athletic.dialogue.chat.success/19": "I've been dying to hit up the other village nearby. I've got some friends there who are just as crazy fit as me.",
  "athletic.dialogue.chat.success/20": "You know what's my ultimate food fantasy? Cheese, dripping with melty goodness and giving me a massive energy boost!",
  "athletic.dialogue.chat.fail/1": "Did you seriously just say that? Wow, you must be as fast as a sprinting ocelot to come up with such nonsense.",
  "athletic.dialogue.chat.fail/2": "I don't believe it exploded on its own. Only someone with the agility of a parkour master could come up with such a ridiculous excuse.",
  "athletic.dialogue.chat.fail/3": "You know, you're not that cool. I've seen villagers who can jump higher than you without even trying.",
  "athletic.dialogue.chat.fail/4": "Show off. You must think you're as nimble as an acrobat, constantly trying to steal the spotlight.",
  "athletic.dialogue.chat.fail/5": "You should be thrown in a dungeon! Let's see if you can escape like a fox, using all your agility and cunning.",
  "athletic.dialogue.chat.fail/6": "Ew. Go away, you dress like you're from the past. Seriously, your sense of style is as outdated as an ancient ruin.",
  "athletic.dialogue.chat.fail/7": "That is such a dumb thing to talk about. I mean, who even cares about your mindless chatter? You're as slow as a snail.",
  "athletic.dialogue.chat.fail/8": "Why are you talking to me again? Can't you see I'm busy practicing my sprinting technique? Your presence is as bothersome as a swarm of bees.",
  "athletic.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I didn't care to listen. My focus is as sharp as an arrow hitting its target, and your words are like background noise.",
  "athletic.dialogue.chat.fail/10": "Excuse me? Did I just hear you spewing nonsense again? Your ignorance is as shocking as a creeper explosion.",
  "athletic.dialogue.chat.fail/11": "I've heard harsh things about you, I can kinda see why they think that. Your reputation is as tarnished as a worn-out pair of running shoes.",
  "athletic.dialogue.chat.fail/12": "Not even zombies will talk to you. I guess they can sense your lack of agility, just like everyone else.",
  "athletic.dialogue.chat.fail/13": "You're as unlikeable as a witch! Your personality is as unpleasant as a potion brewed with rotten ingredients.",
  "athletic.dialogue.chat.fail/14": "Don't talk to me or I will call the guards to move you away from me. Trust me, they'll be glad to apprehend someone as annoying as you.",
  "athletic.dialogue.chat.fail/15": "Huh? Oh sorry, your conversation bored me. I have the attention span of a rabbit, and you're as uninteresting as a barren desert.",
  "athletic.dialogue.chat.fail/16": "Are you done talking? I have better things to do, like running laps around you in circles.",
  "athletic.dialogue.chat.fail/17": "I wonder if anyone will miss your babbling when your mouth suddenly \"stays shut\" forever. Your endless chatter is as irritating as a mosquito buzzing in my",
  "athletic.dialogue.chat.fail/18": "Do you even lift, bro? I doubt anyone will even notice if you stop blabbering for good.",
  "athletic.dialogue.chat.fail/19": "I'd rather sprint a marathon than waste my time conversing with you.",
  "athletic.dialogue.chat.fail/20": "Are you finally done yapping my ear off?",
  "athletic.dialogue.chat.fail/21": "Wait, you actually think the earth is round? Seriously? No straight edges? Can't believe you bought into that nonsense!",

  "athletic.dialogue.story.success/1": "No way! That's absolutely insane!",
  "athletic.dialogue.story.success/2": "If only I had the guts to go head-to-head with a creeper like that.",
  "athletic.dialogue.story.success/3": "Wow, that story was epic! Did you come up with it yourself?",
  "athletic.dialogue.story.success/4": "Hold on, all of that happened just yesterday? Unbelievable!",
  "athletic.dialogue.story.success/5": "I was actually in the vicinity yesterday, it's crazy how I didn't catch wind of this already.",
  "athletic.dialogue.story.success/6": "Haha! Classic %Supporter%! Always pulling off incredible feats.",
  "athletic.dialogue.story.success/7": "I must have heard the Legend of %Supporter% a gazillion times. Entertain me with it once more!",
  "athletic.dialogue.story.success/8": "Ah, so that's the secret behind stumbling upon your first diamond? Fascinating!",
  "athletic.dialogue.story.success/9": "You've got to swing by later! I'm dying to hear more about your adventures.",
  "athletic.dialogue.story.fail/1": "*Ahem* Let me just flex my biceps for a moment, and trust me, you wouldn't want to mess with my mother.",
  "athletic.dialogue.story.fail/2": "This is why the village can't keep up with me. I mean, come on, I'm like the Usain Bolt of Minecraft!",
  "athletic.dialogue.story.fail/3": "I don't get it... and that's saying something, because I can do a triple backflip off a cliff without breaking a sweat.",
  "athletic.dialogue.story.fail/4": "You're terrible! Creepers have feelings too, you know? Maybe you should jog a few laps around the village and think about that.",
  "athletic.dialogue.story.fail/5": "How could you kill a poor sheep?! I mean, I outrun wolves for fun, but you? You're just heartless.",
  "athletic.dialogue.story.fail/6": "*snoring* Uh— huh, what? Sorry, I was dreaming about winning the Minecraft Olympics gold medal in every event. No big deal.",
  "athletic.dialogue.story.fail/7": "How was that worth my time? I could have scaled Mount Everest and back in the time it took you to fail so miserably.",
  "athletic.dialogue.story.fail/8": "Yawn! How boring. I could run a marathon, build a skyscraper, and still have time to spare before your story of failure finishes.",
  "athletic.dialogue.story.fail/9": "You're crazy, and not in a good way... unlike me, the daredevil extraordinaire who leaps from treetops without a second thought.",
  "athletic.dialogue.story.fail/10": "I don't see how that was good.. but hey, I guess not everyone can appreciate the level of skill and agility that I possess.",

  "athletic.dialogue.flirt.success/1": "You're absolutely fearless, my friend!",
  "athletic.dialogue.flirt.success/2": "Oh, you daredevil! Quit being so irresistible!",
  "athletic.dialogue.flirt.success/3": "*Grins* Are you serious right now?",
  "athletic.dialogue.flirt.success/4": "Oh, heavens...",
  "athletic.dialogue.flirt.success/5": "That was beyond charming! You had me hooked from the start!",
  "athletic.dialogue.flirt.success/6": "How do you stay so effortlessly fabulous all the time? Every time I see you, I'm left awestruck.",
  "athletic.dialogue.flirt.success/7": "Oh, cut it out! You're turning me into a blushing athlete.",
  "athletic.dialogue.flirt.fail/1": "You think you can handle me? Show me what you've got.",
  "athletic.dialogue.flirt.fail/2": "Seriously? You tried that line with the blacksmith last week. Nice try, though.",
  "athletic.dialogue.flirt.fail/3": "Hahaha! You really think you stand a chance? Keep dreaming, buddy.",
  "athletic.dialogue.flirt.fail/4": "Is that the best you've got? I've seen better from a snail.",
  "athletic.dialogue.flirt.fail/5": "Oh please, even a creeper has more game than you. Give up already.",
  "athletic.dialogue.flirt.fail/6": "Nope, not happening. You're in way over your head, my friend.",
  "athletic.dialogue.flirt.fail/7": "That look won't work on me, and don't you dare utter those words again.",

  "athletic.dialogue.joke.creative.success/1": "*Laughs* That's hysterical!",
  "athletic.dialogue.joke.creative.success/2": "That's hilarious!",
  "athletic.dialogue.joke.creative.success/3": "That's absolutely brilliant!",
  "athletic.dialogue.joke.creative.success/4": "You're giving %Supporter% a run for their money with that joke!",
  "athletic.dialogue.joke.creative.success/5": "Hahaha! You're a riot! Have you ever considered a career in stand-up comedy?",
  "athletic.dialogue.joke.creative.success/6": "BAHAHHA! That joke is pure gold! I haven't laughed this hard in ages!",
  "athletic.dialogue.joke.creative.success/7": "Teehee! You're definitely funnier than Ash, and that's saying something!",
  "athletic.dialogue.joke.creative.success/8": "Ahah! That's genuinely amusing! You've got a knack for humor, my friend!",
  "athletic.dialogue.joke.creative.failed/1": "You shouldn't joke about that, bro. It's not cool.",
  "athletic.dialogue.joke.creative.failed/2": "Ha. Ha. Nice try, but I've seen better.",
  "athletic.dialogue.joke.creative.failed/3": "Ah, really? You think that's funny? You need to step up your game, dude.",
  "athletic.dialogue.joke.creative.failed/4": "Did you seriously just crack a joke like that? Wow, impressive... not.",
  "athletic.dialogue.joke.creative.failed/5": "Oh... That's... Kinda amusing, I suppose. But you can do better, right?",
  "athletic.dialogue.joke.creative.failed/6": "Reaaaal funny, bro. Keep 'em coming, I guess. *rolls eyes*",
  "athletic.dialogue.joke.creative.failed/7": "Seriously, why would anyone find that hilarious? Stick to your day job, buddy.",
  "athletic.dialogue.joke.creative.failed/8": "Ash? Yeah, he's the king of jokes. You should take some notes from him if you want to be funny.",

  "athletic.dialogue.procreate_engaged/1": "I'll be at the top of my game once we're officially wedded.",
  "athletic.dialogue.procreate_engaged/2": "I'm not keen on creating a whole new generation if we haven't even given our all for each other.",

  "athletic.dialogue.shake_hand.success/1": "That handshake of yours is solid, like a vice grip!",
  "athletic.dialogue.shake_hand.success/2": "Your grip could crush diamonds, my friend! Truly impressive strength!",
  "athletic.dialogue.shake_hand.success/3": "Whoa, you've got the manners of an Olympic athlete! So polite and proper!",
  "athletic.dialogue.shake_hand.success/4": "A splendid day for some physical activity, don't you think?",
  "athletic.dialogue.shake_hand.success/5": "Well, well, well! Look who it is! The embodiment of athleticism and charm!",
  "athletic.dialogue.shake_hand.fail/1": "Are you kidding me? After you brutally took down the cow?",
  "athletic.dialogue.shake_hand.fail/2": "Nah, I'll pass, thanks.",
  "athletic.dialogue.shake_hand.fail/3": "Don't worry, I'm not some random person, no need to put on a show.",
  "athletic.dialogue.shake_hand.fail/4": "Oh, come on! This is so out of character for you.",
  "athletic.dialogue.shake_hand.fail/5": "Get lost, loser.",

  "athletic.dialogue.main.morning/1": "Good morning, let's conquer the day!",
  "athletic.dialogue.main.morning/2": "Rise and grind, my friend! Ready to break a sweat?",
  "athletic.dialogue.main.morning/3": "Still feeling a bit sluggish, huh? Don't worry, we'll wake up those muscles!",
  "athletic.dialogue.main.morning/5": "Woah, looks like someone partied hard last night. Time to sweat it out!",
  "athletic.dialogue.main.morning/6": "Wakey wakey, champ! Get your game face on, we're in for an action-packed day!",
  "athletic.dialogue.main.morning/7": "Did you get those gains in your sleep? You're looking pumped!",
  "athletic.dialogue.main.morning/8": "Rise and shine, sleepy athlete! Time to get those endorphins flowing!",
  "athletic.dialogue.main.morning/9": "What a glorious morning for a workout! Let's make every rep count!",
  "athletic.dialogue.main.morning/10": "Taking it slow today, huh? No worries, recovery is just as important as the grind!",
  "athletic.dialogue.main.morning/11": "My schedule is packed with intense training sessions today, I'm already feeling the burn!",
  "athletic.dialogue.main.morning/12": "Well-rested and ready to conquer new personal records today. The sky's the limit!",
  "athletic.dialogue.main.evening/1": "Hey there! How's the evening treating you?",
  "athletic.dialogue.main.evening/2": "Can you believe how quickly the day slipped away? What adventures did you have?",
  "athletic.dialogue.main.evening/3": "Another day of conquering challenges, am I right, my fellow warrior?",
  "athletic.dialogue.main.evening/4": "Time flies when you're on a mission! So much to accomplish, so little time!",
  "athletic.dialogue.main.evening/5": "I'm thinking of making a dash back home. Gotta refuel and prepare a mighty feast!",
  "athletic.dialogue.main.evening/6": "I didn't make the most of my day, you know? I was too busy slacking off.",
  "athletic.dialogue.main.evening/7": "My morning was a real battleground. I might just crash for a quick power nap.",
  "athletic.dialogue.main.evening/8": "I better retreat to my sanctuary soon. Wouldn't want any creeper encounters tonight!",
  "athletic.dialogue.main.evening/9": "Yo, I just bumped into the butcher, grabbing dinner essentials. Catch up with you later, mate!",
  "athletic.dialogue.main.night/1": "*yawn* Are you seriously still awake?",
  "athletic.dialogue.main.night/2": "Burning the midnight oil, huh?",
  "athletic.dialogue.main.night/3": "Nighttime is the perfect playground for the active souls like us, right?",
  "athletic.dialogue.main.night/4": "Don't venture too far from the village. We wouldn't want you to end up as monster bait, would we?",
  "athletic.dialogue.main.night/5": "The guards make the village feel safer, but the nighttime vibes are exhilarating, don't you think?",
  "athletic.dialogue.main.night/6": "The darkness has its own energy, it's when I feel most alive, ready to conquer the night.",
  "athletic.dialogue.main.night/7": "Daytime is for the mundane, but the night is when the true athletes like us shine.",
  "athletic.dialogue.main.night/8": "I'm feeling pretty beat. I guess it's been a demanding day. I should probably dial it down tomorrow.",
  "athletic.dialogue.main.night/9": "I'm craving the comfort of my cozy bed like a marathon runner craves water.",
  "athletic.dialogue.main.night/10": "You seriously need some shut-eye. Tomorrow's gonna be a real marathon for you.",

  "athletic.dialogue.greet.mayor/1": "Hey there, Mayor! Hope you're having a fantastic day!",
  "athletic.dialogue.greet.mayor/2": "Catch you later, Mayor! Make it a great one, full of energy and success!",
  "athletic.dialogue.greet.monarch/1": "Hail, oh mighty ruler!",
  "athletic.dialogue.greet.monarch/2": "Greetings, supreme leader!",

  "athletic.dialogue.busy/1": "Woah, we've been chatting up a storm today, but duty calls. Gotta get back in the game!",
  "athletic.dialogue.busy/2": "Hey, thanks for the attention, but this work won't finish itself. Gotta hustle and get it done by tonight.",
  "athletic.dialogue.busy/3": "Hey, I'm knee-deep in tasks at the moment. Can we catch up later when I'm not breaking a sweat?",
  "athletic.dialogue.busy/4": "Apologies, my friend, but work beckons. Let's touch base later when I've conquered this project.",
  "athletic.dialogue.busy/5": "Oh snap, I left my furnace unattended! I'll catch you on the flip side, my speedy friend!",
  "athletic.dialogue.goaway/1": "Sorry, but I'm in the middle of my intense training session. Please go away.",
  "athletic.dialogue.goaway/2": "Seriously, don't you have a marathon to run or a mountain to climb? I'm not interested in chatting right now.",
  "athletic.dialogue.goaway/3": "Hey %1$s, I'd love to chat, but I've got to focus on my fitness goals. Catch you later.",
  "athletic.dialogue.goaway/4": "Look, I'm busy sculpting my perfect physique. Find another poor soul to bother, will ya?",
  "athletic.dialogue.goaway/5": "Begone, you unworthy mortal! I have no time for your feeble presence. Leave this place at once!",

  "athletic.dialogue.greet/1": "Hey, hey! How's the day treating you, my athletic friend?",
  "athletic.dialogue.greet/2": "Hey %1$s, ready to conquer the world? How's it going?",
  "athletic.dialogue.greet/3": "Well, well, well, what brings you here, my energetic companion?",
  "athletic.dialogue.greet/4": "Look at you, all pumped up and ready to conquer! How's the day treating you, my athletic amigo?",
  "athletic.dialogue.greet/5": "Well, well, well, if it isn't %1$s! Great to see you, my sporty buddy!",
  "athletic.dialogue.greet/6": "Yo, what's up?",
  "athletic.dialogue.greet/7": "Hey, hey! Nice to see your active self around here!",
  "athletic.dialogue.greet/8": "Greetings, my fellow adventurer! How's the day treating you? You look absolutely fabulous, by the way.",
  "athletic.dialogue.greet/9": "Hey there, my energetic pal! I'm so glad to see you. How has your day been so far?",

  "athletic.dialogue.greet.negative/1": "Ugh, like seriously? You're still here, lurking around?",
  "athletic.dialogue.greet.negative/2": "Oh wow, it's the least impressive sight of the day - you.",
  "athletic.dialogue.greet.negative/3": "Well, well, well, if it isn't the persistent annoyance. What do you want now?",
  "athletic.dialogue.greet.negative/4": "Oh joy, it's you. My day just got a whole lot worse.",
  "athletic.dialogue.greet.negative/5": "Seriously, can't you find someone else to bother? I'm not in the mood for your nonsense.",

  "athletic.dialogue.greet.success/1": "Awesome to hear, dude!",
  "athletic.dialogue.greet.success/2": "Doing good? That's absolutely fantastic!",
  "athletic.dialogue.greet.success/3": "Ecstatic to hear it, man!",
  "athletic.dialogue.greet.success/4": "So stoked to hear that, bro!",
  "athletic.dialogue.greet.success/5": "Radical, man! Good to know it!",
  "athletic.dialogue.greet.fail/1": "Okay then, I guess I'll just move on.",
  "athletic.dialogue.greet.fail/2": "Well, that's underwhelming.",
  "athletic.dialogue.greet.fail/3": "Seriously? I was expecting more excitement.",
  "athletic.dialogue.greet.fail/4": "Oh... I was hoping for something more thrilling.",
  "athletic.dialogue.greet.fail/5": "Meh, that's not exactly what I had in mind.",

  "athletic.dialogue.apologize.success/1": "No sweat, everyone fumbles sometimes.",
  "athletic.dialogue.apologize.success/2": "All good, just gotta stay on your game next time.",
  "athletic.dialogue.apologize.success/3": "I suppose that's passable, but you better up your game, champ.",
  "athletic.dialogue.apologize.success/4": "No worries, even the best athletes slip up sometimes.",
  "athletic.dialogue.apologize.success/5": "Yup, no biggie. But don't make a habit out of it, alright?",
  "athletic.dialogue.apologize.fail/1": "Step back, buddy!",
  "athletic.dialogue.apologize.fail/2": "You deliberately bumped into me!",
  "athletic.dialogue.apologize.fail/3": "Nice try, but I'm not buying it!",
  "athletic.dialogue.apologize.fail/4": "Ouch, don't bother with your apologies now!",
  "athletic.dialogue.apologize.fail/5": "Nope, not happening!",

  "athletic.dialogue.location.failed/1": "Nah, haven't heard a whisper about any hotspots around here.",
  "athletic.dialogue.location.failed/2": "Sorry, mate, but I haven't come across any epic locales worth your time.",
  "athletic.dialogue.location.failed/3": "Trust me, there's no thrilling hideouts or ancient treasures to discover. We villagers have better things to do than wander around dangerous ruins like you thrill-seekers.",
  "athletic.dialogue.location.forgot/1": "Ah, shoot! I stumbled upon this epic spot, but my memory failed me and I totally forgot to bookmark it. My bad!",
  "athletic.dialogue.location.forgot/2": "On the hunt for adventure, huh? Man, I had the juiciest secret spot to share, but guess what? My brain decided to play tricks on me and totally blanked out on the details. Oops, my bad!",
  "athletic.dialogue.location.forgot/3": "You won't believe it! I stumbled upon this mind-blowing location that would have blown your socks off. But, oh dear, my athletic mind must have been too focused on my next sprint, and I totally forgot to jot down the coordinates. I apologize, buddy!",
  "athletic.dialogue.location.igloo/1": "You won't believe what I stumbled upon at %2$s! An igloo made completely out of snow. Can you imagine living in that freezing place? Brrr! But hey, I guess it's perfect for those who want an extreme winter workout!",
  "athletic.dialogue.location.igloo/2": "Hey, guess what? I found this abandoned igloo at %2$s, and let me tell you, it's like a hidden treasure for all the adventure-seeking athletes out there. I mean, who needs haunted houses when you can have an adrenaline-pumping igloo? You can sprint through those icy corridors and do some serious ghost-busting workouts!",
  "athletic.dialogue.location.igloo/3": "So, get this, there's this abandoned ice palace at %2$s. I'm talking about a full-on igloo extravaganza! It's been empty for ages, but let me tell you, it's the ultimate training ground for the most hardcore athletes. You can slide down those slippery slopes, master the art of snowball dodging, and have the ultimate winter sports experience!",
  "athletic.dialogue.location.pyramid/1": "Hey, have you seen that epic pyramid over at %2$s? It's like a challenge waiting to be conquered!",
  "athletic.dialogue.location.pyramid/2": "Rumor has it, there's this mind-blowing pyramid at %2$s. I bet you could show off your mad athletic skills by exploring it!",
  "athletic.dialogue.location.pyramid/3": "So, word on the street is that %2$s is home to a seriously intense pyramid. I heard this legendary adventurer went in there ages ago, but never came out. You better bring your A-game and conquer that place!",
  "athletic.dialogue.location.ruined_portal_desert/1": "Talk about devastation! You gotta see it to believe it. There's a demolished portal at %2$s, just chilling in the desert like a professional athlete who lost their game.",
  "athletic.dialogue.location.ruined_portal_swamp/1": "No way! You gotta see this, there's a totally destroyed portal at %2$s, right in the heart of this stinky old swamp. I bet those Nether invaders were expecting something way cooler, what a disappointment!",
  "athletic.dialogue.location.ruined_portal/1": "Yo, check out the wreckage at %2$s! It's like someone dropped a Nether bomb on it. Total chaos, man.",
  "athletic.dialogue.location.ruined_portal/2": "Dude, if you're up for an adventure, head over to %2$s. There's this gnarly ruined nether portal that gives off major creepy vibes. But don't worry, it's totally safe... I think. Just watch your step around the scorching magma, bro.",
  "athletic.dialogue.location.ruined_portal/3": "Hey, if you're feeling brave, you gotta go to %2$s. There's this ancient ruin that used to be a nether portal, and let me tell you, it's got a reputation. The local cleric claims there might be some sick treasure hidden there, but nobody's got the guts to go near that place. Can you blame 'em?",
  "athletic.dialogue.location.ruined_portal_mountain/1": "Brace yourselves for a jaw-dropping sight! I recently stumbled upon a mountainous disaster - a portal that's been reduced to rubble. Swing by %2$s to witness this heartbreaking scene. It's quite the spectacle!",
  "athletic.dialogue.location.mansion/1": "Hey, listen up! If you dare step foot near %2$s, you'll stumble upon a wicked mansion ruled by those illagers. Trust me, if you cherish your existence, stay as far away as possible from that cursed joint.",
  "athletic.dialogue.location.mansion/2": "So, there's this massive mansion over yonder at %2$s, and guess who's the proud owner? The dreaded illagers, of course! Now, I don't mean to alarm you, but if you ask me, it wouldn't hurt if we relocated the entire village. You know, just to be on the safe side...",
  "athletic.dialogue.location.monument/1": "Yo, listen up! There's a gnarly sunken castle at %2$s, but watch out for those crazy sea monsters. They ain't gonna go easy on ya, so better stay away.",
  "athletic.dialogue.location.monument/2": "Dude, I've heard some sick stories about these ancient ruins underwater at %2$s. If you're up for an adrenaline rush and some serious loot, maybe you should dive in. Just be prepared for a wild ride, man. Those ruins aren't for the faint of heart.",
  "athletic.dialogue.location.shipwreck/1": "Whoa! Guess what? I just stumbled upon a totally gnarly sunken ship at %2$s! Legends say it belonged to the mighty Eastern Alliance Company. Talk about extreme nautical history!",
  "athletic.dialogue.location.shipwreck/2": "Dude, you won't believe this, but word on the street is that some rad fishermen discovered a shipwreck at %2$s. I've got a feeling there might be some epic treasure hiding in there. Let's go on a treasure hunt, bro!",
  "athletic.dialogue.location.shipwreck_beached/1": "Woah, dude! I stumbled upon a totally wrecked ship at %2$s, right on the beach! It's, like, impossible to miss, man!",
  "athletic.dialogue.location.shipwreck_beached/2": "Hey, listen up! If you head over to %2$s, there's this epic ship that got totally wrecked on the shore. I can't help but wonder how it got there, you know? It's a total mystery, bro!",
  "athletic.dialogue.location.village_desert/1": "Oh, you won't believe it! There's this incredible village smack dab in the middle of the scorching desert over at %2$s! Can you imagine? It's like an oasis of awesomeness in the blistering heat!",
  "athletic.dialogue.location.village_taiga/1": "Hey there, if you head over to %2$s, you'll stumble upon a super cool village right in the heart of the taiga biome.",
  "athletic.dialogue.location.village_taiga/2": "You've gotta check out %2$s! There's this awesome village tucked away in the depths of the taiga biome. Trust me, it's definitely worth the journey.",
  "athletic.dialogue.location.village_snowy/1": "Dude, there's a sick village over at %2$s, but be prepared to freeze your buns off. It's like an Arctic expedition, bro!",
  "athletic.dialogue.location.village_snowy/2": "Yo, check it out, there's this wicked village at %2$s in the snowy plains. The folks are cool, but man, it's a frigid paradise over there! Gotta bundle up, my friend!",
  "athletic.dialogue.location.village_plains/1": "Wow, there's another fabulous village over there at %2$s!",
  "athletic.dialogue.location.village_plains/2": "Get ready to explore deeper into the plain at %2$s and discover yet another fantastic village!",
  "athletic.dialogue.location.village_savanna/1": "Wow, you won't believe it! There's another village at %2$s and boy, is it scorching hot out there! It's like walking on coals, I tell ya.",
  "athletic.dialogue.location.village_savanna/2": "Hear me out, adventurer! Head to the savanna at %2$s and you'll stumble upon another village. And let me tell you, those folks are not only nice, they're as fit as a fiddle too! They'll outrun you in a heartbeat.",
  "athletic.dialogue.location.swamp_hut/1": "Whoa, dude! You gotta steer clear of the swamp at %2$s. It's like, totally crawling with that wicked witch. I mean, seriously, you don't wanna mess with that place!",
  "athletic.dialogue.location.swamp_hut/2": "Bro, trust me, you don't wanna go near %2$s. There's this gnarly hut owned by a witch, and let me tell you, it's nothing but bad vibes. I'd suggest finding a different path, man.",
  "athletic.dialogue.location.mineshaft/1": "Our mine used to be a real hotspot for all the miners, until disaster struck. It's tucked away just a stone's throw from %2$s, but it's off-limits now. Something about a massive cave-in that shook the whole place up. Make sure you watch your step if you decide to venture down there.",
  "athletic.dialogue.location.mineshaft/2": "Ah, the good old days when our mine was still open for business. It's located over yonder, near %2$s. Unfortunately, it was overrun by those pesky creatures, and became a treacherous playground for them. I'd advise you to tread with caution if you're brave enough to explore its depths.",
  "athletic.dialogue.location.jungle_pyramid/1": "You won't believe the insane temple hidden at %2$s in the jungle! It's an adrenaline-pumping challenge that'll test your skills to the max. Just a word of advice, though",
  "athletic.dialogue.location.jungle_pyramid/2": "Hey, you daring adventurer! Heard about the ancient ruins at %2$s in the jungle? It's like an obstacle course on steroids! If you're up for a heart-pounding adventure, go check it out. But seriously, watch your step or you might end up as trap fodder. Only the truly athletic can conquer it!",
  "athletic.dialogue.location.pillager_outpost/1": "Oh, you won't believe it! There's a bunch of Pillagers flexing their muscles at %2$s. They've set up an outpost right next to us, like they own the place. But hey, I'm not worried, I can outrun them with my lightning-fast speed!",
  "athletic.dialogue.location.pillager_outpost/2": "Listen up, fellow adventurers! There's this badass outpost run by those pesky Pillagers at %2$s. They think they can intimidate us, but little do they know, I'm the ultimate athlete around here. If you dare go near, watch out for their arrows, but don't worry, I can dodge them like a pro!",
  "athletic.dialogue.location.pillager_outpost/3": "Get this, my friend! If you're up for a challenge, head over to %2$s and you'll stumble upon a Pillager outpost. Those muscle-bound ruffians think they're tough, but they're no match for my supreme athletic skills. Defeat them and claim their precious loot, and the whole village will be forever grateful for your heroic act!",
  "athletic.dialogue.location.ancient_city/0": "Yo, dude! I totally caught some bizarre vibes coming from %2$s, like super deep underground.",
  "athletic.dialogue.location.ancient_city/1": "Bro, I swear there's some serious hidden treasure or something way beneath the surface at %2$s.",
  "athletic.dialogue.location.ancient_city/3": "You won't believe this, but the rumors are true, man! %2$s is like this ancient city, completely obscured from sight. Maybe it's tucked away underground or something?",

  "athletic.dialogue.joke.monster.success/1": "Haha! That Skelly never stood a chance against me!",
  "athletic.dialogue.joke.monster.success/2": "Can you believe it? That zombie actually thought it could take me on with a shovel! Hahaha!",
  "athletic.dialogue.joke.monster.success/3": "I totally dominated that spider! It never had a chance against my skills, haha!",
  "athletic.dialogue.joke.monster.success/4": "Whoa! You managed to make a skeleton kill a creeper? That's next-level athleticism, haha!!",
  "athletic.dialogue.joke.monster.success/5": "Hahah! Cave spiders must be the dimmest creatures in Minecraft if they fall for my moves like that!",
  "athletic.dialogue.joke.monster.failed/1": "Can you believe it? Those skeletons think they can outdo me in a race! Ha!",
  "athletic.dialogue.joke.monster.failed/2": "Seriously, who even has time to joke about creepers exploding? I'm too busy running laps!",
  "athletic.dialogue.joke.monster.failed/3": "You know, zombies and skeletons were once humans, just like us. But I guess they couldn't keep up with my athletic skills.",
  "athletic.dialogue.joke.monster.failed/4": "Hahaha, an enderman falling into water? That's like watching a snail race against a cheetah!",
  "athletic.dialogue.joke.monster.failed/5": "I've heard so many jokes about silverfish ambushing people on the toilet, it's like they're trying to challenge my agility! But don't worry, I'm always one step ahead.",

  "athletic.dialogue.joke.animal.success/1": "It's a bummer the sheep lost its wool, but man, what a riot!",
  "athletic.dialogue.joke.animal.success/2": "And boom, the wolf falls head over heels for the sheep!",
  "athletic.dialogue.joke.animal.success/3": "Oh my gosh, that's a scream! Who knew chickens had those kind of skills?",
  "athletic.dialogue.joke.animal.success/4": "That's just plain ridiculous, but hey, I'm all about it!",
  "athletic.dialogue.joke.animal.success/5": "Thank goodness cows can produce milk for days on end! It's like they've got an endless supply!",
  "athletic.dialogue.joke.animal.failed/1": "Come on, let's keep it serious. Joking about that is just not my style.",
  "athletic.dialogue.joke.animal.failed/2": "Oh, that sheep! I can't even fathom how unfunny that is!",
  "athletic.dialogue.joke.animal.failed/3": "Seriously now, don't you dare talk about my pig in such a disrespectful manner!",
  "athletic.dialogue.joke.animal.failed/4": "Ugh, that's just a new low, even for you.",
  "athletic.dialogue.joke.animal.failed/5": "Hey, hey! Lay off the cow's eyebrows, will ya? Making jokes like that is just uncalled for!",

  "athletic.dialogue.flirt.slap/1": "Hey, watch where you're going!",
  "athletic.dialogue.flirt.slap/2": "Is this the best you've got? I've seen Endermen flirt better!",
  "athletic.dialogue.kiss.slap/1": "Are you kidding me right now?",
  "athletic.dialogue.kiss.slap/2": "Give it another shot, and the next hit will be unforgettable!",

  "athletic.dialogue.chat.plains/1": "Who needs other biomes when you've got these plains? I should start sprinting through them one day, just to mix things up...",
  "athletic.dialogue.chat.plains/2": "The plains may not be as intense as some other biomes, but there's a certain tranquility to them that I wouldn't trade for anything.",
  "athletic.dialogue.chat.plains/3": "When the sun sets and the night falls, the plains transform into a breathtaking spectacle. It's like a stadium for nature's athletes!",
  "athletic.dialogue.chat.plains/4": "Sometimes, I just lie down and stargaze in the plains. It's like watching the best acrobats perform in the sky.",
  "athletic.dialogue.chat.plains/5": "The air here is so crisp and invigorating! The taiga can't even compete with the refreshing breeze of these plains.",
  "athletic.dialogue.chat.plains/6": "Sure, the plains may seem plain, but sometimes simplicity is the ultimate power move!",
  "athletic.dialogue.chat.plains/7": "This weather takes me back to my childhood, when I used to sprint around the fields and collect wild flowers. I was always the fastest!",
  "athletic.dialogue.chat.plains/8": "The sunrise in the plains is a sight to behold! You should come join me for a morning workout session sometime.",
  "athletic.dialogue.chat.savanna/1": "Whew, talk about a scorching hot playground in this savanna! But hey, at least we never have to worry about winter slowing us down.",
  "athletic.dialogue.chat.savanna/2": "The llamas can be a bit of a hassle, but hey, it keeps me on my toes. Gotta stay agile in this wild savanna.",
  "athletic.dialogue.chat.savanna/3": "Check out the jaw-dropping architecture we've got going on in this savanna! It's like living in a masterpiece. No wonder I call this place home.",
  "athletic.dialogue.chat.savanna/4": "Don't you dare underestimate the savanna biome, my friend. It might seem plain at first glance, but it's got some serious hidden perks that'll blow your mind.",
  "athletic.dialogue.chat.savanna/5": "You know what sets us apart from those desert villages? We've got rivers galore, baby! No rain? No problem. Our water supply is on point.",
  "athletic.dialogue.chat.savanna/6": "Have you taken a good look at the jaw-dropping hills and terrains around here? It's like Mother Nature herself decided to show off her creative side. Truly a mesmerizing sight.",
  "athletic.dialogue.chat.savanna/7": "When the sun is blazing down, thank the heavens for those acacia trees with their glorious shade. They're my personal saviors during those intense workdays.",
  "athletic.dialogue.chat.savanna/8": "Listen up, folks! Our savanna villages are known far and wide for growing the juiciest melons and the most magnificent pumpkins you've ever tasted. We're the kings of the trading game!",
  "athletic.dialogue.chat.taiga/1": "The woods are my playground! I gather resources, chop firewood, and hunt like a champion.",
  "athletic.dialogue.chat.taiga/2": "Cold? Ha! The taiga biome is my training ground, pushing me to my limits. Wouldn't trade it for the world!",
  "athletic.dialogue.chat.taiga/3": "Taiga forests, the ultimate adventure zone! I snack on those juicy berries to fuel my athletic prowess.",
  "athletic.dialogue.chat.taiga/4": "Foxes, my partners in mischief! I treat them to sweet berries, and together we conquer the taiga forests.",
  "athletic.dialogue.chat.taiga/5": "Wolves in the taiga? More like loyal companions. They respect our abundance of food and join us on our athletic endeavors.",
  "athletic.dialogue.chat.taiga/6": "Inhaling the crisp taiga air rejuvenates my very soul, fuelling my athletic fire.",
  "athletic.dialogue.chat.taiga/7": "Those sweet berry bushes, a delicious challenge! A few pricks won't keep me from their juicy rewards.",
  "athletic.dialogue.chat.taiga/8": "Rain in the taiga? It's a refreshing challenge, testing my endurance and bringing tranquility to my athletic spirit.",
  "athletic.dialogue.chat.snowy_plains/1": "I don't mind the cold, it just means I get to show off my incredible stamina!",
  "athletic.dialogue.chat.snowy_plains/2": "This freezing weather is nothing compared to the challenges I face on my daily runs. Bring it on, winter!",
  "athletic.dialogue.chat.snowy_plains/3": "While others hide from the cold, I embrace it and go for a refreshing jog. It's like a natural ice bath for my muscles!",
  "athletic.dialogue.chat.snowy_plains/4": "When it snows, I can't resist the urge to gather some friends and organize an epic snowball tournament. I always come out victorious!",
  "athletic.dialogue.chat.snowy_plains/5": "Those strays have no chance against my lightning-fast reflexes. I dodge their arrows like a professional athlete!",
  "athletic.dialogue.chat.snowy_plains/6": "Wolves? Pfft, I can outrun them with my incredible speed. They won't even lay a paw on me!",
  "athletic.dialogue.chat.snowy_plains/7": "Iron golems may be tough, but I've mastered the art of dodging their heavy-handed attacks. I can dance around them effortlessly!",
  "athletic.dialogue.chat.snowy_plains/8": "Ah, the fond memories of my childhood. Building snow golems was just a warm-up for my future athletic achievements!",
  "athletic.dialogue.chat.desert/1": "Wow, the desert heat is intense, but hey, at least we never have to deal with freezing winters!",
  "athletic.dialogue.chat.desert/2": "This desert climate keeps us warm all year long, perfect for an athletic adventurer like me!",
  "athletic.dialogue.chat.desert/3": "Whew, it's scorching hot in this desert, but I embrace it! It's like a constant workout under the sun!",
  "athletic.dialogue.chat.desert/4": "Ah, nighttime in the desert is simply breathtaking! The cooler air makes stargazing an absolute delight.",
  "athletic.dialogue.chat.desert/5": "Oh boy, today's sun is no joke! I'm practically sweating buckets here, but it won't slow me down!",
  "athletic.dialogue.chat.desert/6": "Whoa, this sun is really testing my endurance today! I better stay hydrated and keep my cool.",
  "athletic.dialogue.chat.desert/7": "Have you come across any elusive rabbits in this vast desert? They're like speedy sprinters out here!",
  "athletic.dialogue.chat.desert/8": "Ugh, dealing with those husks is such a hassle! They knock the energy right out of you, making me even more famished!",
  "athletic.dialogue.chat.desert/9": "Ouch! Got pricked by a cactus the other day. Note to self",
  "athletic.dialogue.chat.desert/10": "Life in this arid desert may be challenging, but luckily, our village provides us with the essential resources we need to thrive. Time to get my fitness on!",

  "athletic.dialogue.story.exploring.success/1": "Awesome! I can't wait to venture into the great unknown someday, flexing my athletic prowess!",
  "athletic.dialogue.story.exploring.success/2": "Whoa! Just hearing about your epic adventures makes my competitive spirit flare up! I mean, I love my village and all, but imagine the thrill of exploring new places, pushing my physical limits, and leaving everyone in awe!",
  "athletic.dialogue.story.exploring.success/3": "You've got some serious guts, my friend! It takes a true athlete to fearlessly dive headfirst into uncharted territories. I can only dream of the adrenaline rush you must experience on your expeditions!",
  "athletic.dialogue.story.exploring.fail/1": "Your tales are growing stale.",
  "athletic.dialogue.story.exploring.fail/2": "Impressive. Be careful not to strain your muscles with that edge, sporty fellow.",
  "athletic.dialogue.story.exploring.fail/3": "Trying to keep up with you while exploring is like attempting to sprint a marathon with a record-breaking athlete. It's exhausting and I'm definitely out of my league.",

  "athletic.dialogue.story.nether.success/1": "Man, it's scorching in there, huh?!",
  "athletic.dialogue.story.nether.success/2": "Dude, you're like a true survivor in that hellish underworld. Mad respect.",
  "athletic.dialogue.story.nether.success/3": "I've heard rumors about insane loot in the Nether, but I'm too chicken to even think about stepping foot there…",
  "athletic.dialogue.story.nether.success/4": "You must have nerves of steel to venture into that place. Ain't no fear stopping you, huh? Not that I'd ever admit being scared…",
  "athletic.dialogue.story.nether.success/5": "Yo, have you ever come across a Zombified Piglin? Those things are gnarly!",
  "athletic.dialogue.story.nether.fail/1": "I doubt you've ever even dared to step into the Nether, bro.",
  "athletic.dialogue.story.nether.fail/2": "Dude, it's no wonder those Piglins went after you. You're like a walking target in there.",
  "athletic.dialogue.story.nether.fail/3": "Seriously, who cares if you've been to the Nether? You couldn't spin a tale if your athletic career depended on it.",
  "athletic.dialogue.story.nether.fail/4": "Pfft, look at you. You're not even close to being swole enough to handle the Nether, my friend.",
  "athletic.dialogue.story.nether.fail/5": "My legendary grandpa was a Nether explorer, and he never mentioned anything about warped fungus. Nice try, but I'm not buying your fibs, man.",

  "athletic.dialogue.story.enderdragon.success/1": "Unbelievable! And did you snatch the dragon egg while conquering the beast?",
  "athletic.dialogue.story.enderdragon.success/2": "Good gracious! Have you truly vanquished the ferocious dragon of lore?! The entire village will chant your heroic tale for centuries!",
  "athletic.dialogue.story.enderdragon.fail/1": "Ha! Are you out of your mind? The ender dragon is nothing but a legend.",
  "athletic.dialogue.story.enderdragon.fail/2": "Seriously? No way in Minecraft could any mere mortal even dream of laying a finger on that dragon!",

  "athletic.dialogue.story.wither.success/1": "No way! I've heard the Wither wreaks havoc like no other!",
  "athletic.dialogue.story.wither.success/2": "You've conquered the almighty Wither?! Wow! That's mind-blowing!",
  "athletic.dialogue.story.wither.fail/1": "No way! I'm not buying it.",
  "athletic.dialogue.story.wither.fail/2": "Seriously? You seem way too intact for that to be legit.",

  "athletic.dialogue.stay.fail/1": "Nope, not my thing. I'm all about the thrill of adventure!",
  "athletic.dialogue.stay.fail/2": "Appreciate the offer, but my heart yearns for the wilderness. I thrive on exploration and pushing my limits!",
  "athletic.dialogue.stay.fail/3": "This village is quaint, but I'm cut from a different cloth. I crave the excitement and adrenaline of being a true adventurer!",
  "athletic.dialogue.stay.repeat/1": "Dude, seriously? I just answered that question like two minutes ago.",
  "athletic.dialogue.stay.repeat/2": "Seriously, bro? You literally just asked me the same thing. Pay attention, man.",
  "athletic.dialogue.stay.success/1": "Thanks, this village is a total touchdown for me!",
  "athletic.dialogue.stay.success/2": "Fantastic, I'm absolutely pumped to stay in this village!",
  "athletic.dialogue.stay.no_space/1": "Wow, this village is bursting at the seams!",
  "athletic.dialogue.stay.no_space/2": "I'd totally love to stick around, but there ain't a single bed to spare.",

  "athletic.dialogue.hire/1": "Sure thing, just give me a holler when you're in need of assistance. I'll be flexing my muscles and ready to go for the agreed-upon time frame.",
  "athletic.dialogue.hire/2": "Awesome! Give me a heads up whenever you require my services. I'll be here, eagerly awaiting those shiny emeralds as my reward! Time to show off my athletic prowess!",
  "athletic.dialogue.hire/3": "Fantastic! Prepare yourself for a jaw-dropping experience. Once you've got those emeralds in hand, I'll be at your beck and call, ready to impress you with my athletic skills!",
  "athletic.dialogue.no_money/1": "It's gonna take a lot more than spare change to recruit me, pal!",
  "athletic.dialogue.no_money/2": "Hah! Nice try, but you better dig deeper into those pockets if you want my expertise!",
  "athletic.dialogue.no_money/3": "Don't be fooled by my humble appearance, my friend. The price for my skills is way steeper than you can imagine.",

  "athletic.dialogue.main.rock_paper_scissor/1": "Brace yourself for a showdown in Rock Paper Scissors, where my athletic prowess will leave you eating my dust and questioning your own abilities!",
  "athletic.dialogue.rock_paper_scissor/1": "Alright, let's do this! Rock, paper, scissors, go!",
  "athletic.dialogue.rock_paper_scissor/2": "You better be ready to witness my unbeatable skills this time!",
  "athletic.dialogue.rock_paper_scissor.rock/1": "Boom! Rock it is, baby! Nothing can stop this rock-solid power!",
  "athletic.dialogue.rock_paper_scissor.paper/1": "Witness the superiority of my paper move! Victory is assured!",
  "athletic.dialogue.rock_paper_scissor.scissor/1": "Scissor! Count on me to outmaneuver and outclass you with my scissor finesse!",
  "athletic.dialogue.rock_paper_scissor.loose.rock/1": "Witness my impeccable strategy as I unveil paper, securing yet another win!",
  "athletic.dialogue.rock_paper_scissor.loose.paper/1": "Watch out, I'm going all in with scissors! Get ready to be crushed!",
  "athletic.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors thought they could beat my rock? Think again! I'm the ruler of this game!",
  "athletic.dialogue.rock_paper_scissor.win.rock/1": "Boom! My rock decimated your pathetic scissors! Bow down to the unbeatable power of my throws!",
  "athletic.dialogue.rock_paper_scissor.win.paper/1": "Man, rock is no match for my lightning-fast reflexes! I always dominate with my paper strategy.",
  "athletic.dialogue.rock_paper_scissor.win.scissor/1": "They say agility conquers all, and my scissors just proved it! Victory dance time for this athletic dynamo!",
  "_": ""
}