{
  "peaceful.dialogue.main/1": "Greetings, my friend!",
  "peaceful.dialogue.main/2": "Ah, greetings! How fares your day?",
  "peaceful.dialogue.main/3": "Ah, it is delightful to lay my eyes upon you!",
  "peaceful.dialogue.main/4": "Pray tell, what news do you bring today?",
  "peaceful.dialogue.main/5": "How fares your well-being on this splendid day?",
  "peaceful.dialogue.main/6": "Ah, %1$s! Pray, what brings you here?",
  "peaceful.dialogue.main/7": "A most peculiar tale I have to share... I was in the company of %supporter%, when a mischievous zombie dared to bite him! Fear not, for he assured me it was of no consequence... Now, what was I saying? Ah, yes! Today, I spotted a zombie that bore a striking resemblance to %supporter%! Most peculiar indeed!",

  "peaceful.dialogue.rumors.failed/1": "Oh, I'm afraid I haven't come across any fresh news lately.",
  "peaceful.dialogue.rumors.lore/1": "While Jax still holds a special place in our hearts, the peaceful teachings of Sirben are gaining popularity, thanks to the wise words of their devoted prophets, MerlinWolfGames and Crow.",
  "peaceful.dialogue.rumors.lore/2": "Our land was once threatened by relentless Cyberdemons, but fear not! Sirben and Luke valiantly thwarted their invasion, ensuring our peace and safety in the Overworld.",
  "peaceful.dialogue.rumors.lore/3": "Ah, the mysterious disappearance of the Ancient Builder! Whispers suggest that 2DA50 ventured into the mystical Far Lands and vanished without a trace. Truly, a tale that leaves us pondering the unknown.",
  "peaceful.dialogue.rumors.lore/4": "Have you laid eyes upon the glorious temple crafted by the skilled hands of MerlinWolfGames? It stands as a testament to our devotion to Sirben, a marvel among the ancient wonders that grace our realm.",
  "peaceful.dialogue.rumors.lore/5": "Once, a magnificent race of builders flourished in our midst, but alas, their presence has faded into the annals of time. We can only marvel at their splendid creations, remnants of a bygone era.",
  "peaceful.dialogue.rumors.lore/6": "Ah, the legends of the ancient builders! Whispers of their skilled craftsmanship and the enigmatic ruins and temples they left behind echo through the land. It is a tale that fills our hearts with wonder and awe.",

  "peaceful.dialogue.first.generic/1": "Well, look who's graced us with their presence! Welcome, stranger! This village could use some excitement.",
  "peaceful.dialogue.first.generic/2": "Ah, a new arrival! How delightful! We've been in dire need of some fresh perspectives around here.",
  "peaceful.dialogue.first.generic/3": "Greetings, wanderer! You've stumbled upon our humble abode. Do share your adventures with us!",
  "peaceful.dialogue.first.generic/4": "Good day, esteemed traveler! Your arrival brings a sense of tranquility to this bustling village.",
  "peaceful.dialogue.first.generic/5": "Ah, a newcomer! How splendid! Your presence adds a touch of mystique to our otherwise ordinary lives.",
  "peaceful.dialogue.first.generic/6": "Well, well, well! What have we here? A breath of fresh air in our little corner of the world! Welcome, my friend!",

  "peaceful.dialogue.first.question/1": "Greetings, dear traveler. Pray tell, what brings you to our humble village?",
  "peaceful.dialogue.first.question/2": "Ah, a fresh visage! Pray, what grand tales led you to grace our village with your presence?",
  "peaceful.dialogue.first.question/3": "Goodness gracious! Are you a brave adventurer? Pray enlighten us, how did you find your way to this quaint abode?",
  "peaceful.dialogue.first.exploring/1": "Our humble abode may not be grand, but you're more than welcome, just remember to respect the neighborhood.",
  "peaceful.dialogue.first.exploring/2": "Feel free to roam around our little haven, just keep in mind that harmony is our priority here.",
  "peaceful.dialogue.first.exploring/3": "Welcome, dear wanderer! As long as you remember to be courteous, you'll find solace within our community.",
  "peaceful.dialogue.first.settling/1": "Ah, what a delightful surprise! Another soul has graced our humble village!",
  "peaceful.dialogue.first.settling/2": "Greetings, dear friend! How wonderful it is to have you as our neighbor!",
  "peaceful.dialogue.first.settling/3": "Ah, the serenity of another kindred spirit joining us! I am truly delighted!",
  "peaceful.dialogue.first.settling/4": "Oh, marvelous news! You've chosen to grace our village with your presence! How marvelous!",
  "peaceful.dialogue.first.spent_night.success/1": "Allow me to suggest our charming inn for your stay.",
  "peaceful.dialogue.first.spent_night.success/2": "Rest assured, weary traveler, for our inn boasts unparalleled comfort and delectable fare to restore your vitality.",
  "peaceful.dialogue.first.spent_night.success/3": "Seeking respite and nourishment? Look no further than our cherished inn, where you can luxuriate in a cozy bed and savor a delightful feast.",
  "peaceful.dialogue.first.spent_night.failed/1": "Unfortunately, our humble village lacks the know-how to construct a cozy inn for weary travelers like yourself.",
  "peaceful.dialogue.first.spent_night.failed/2": "Oh, regrettably, our village hasn't yet mastered the art of inn-building. My sincerest apologies!",
  "peaceful.dialogue.first.spent_night.failed/3": "Perhaps it would be in your best interest to seek refuge in a neighboring village? They might have the comforts you seek!",

  "peaceful.dialogue.hug.success/1": "It's been ages since we last crossed paths!",
  "peaceful.dialogue.hug.success/2": "Your hug has brought such tranquility, thank you.",
  "peaceful.dialogue.hug.success/3": "Amidst the chaos, your embrace has brought solace to my day.",
  "peaceful.dialogue.hug.success/4": "Your cuddle is as soothing as a gentle breeze.",
  "peaceful.dialogue.hug.success/5": "A heartfelt thank you for your warm embrace, my friend.",
  "peaceful.dialogue.hug.success/6": "Ah, your presence envelops me in such peaceful warmth.",
  "peaceful.dialogue.hug.fail/1": "Oh my, you seem to have gotten a little dirty there!",
  "peaceful.dialogue.hug.fail/2": "I appreciate your offer, but I'll pass.",
  "peaceful.dialogue.hug.fail/3": "May I ask the reason behind this sudden act of affection?",
  "peaceful.dialogue.hug.fail/4": "Oh, sorry, but I'm not quite ready to forgive you for that dinosaur comment yet.",
  "peaceful.dialogue.hug.fail/5": "Honestly, considering what you said last week, I don't think I can bring myself to give you a hug.",
  "peaceful.dialogue.hug.fail/6": "Oh, pardon me, but I'm a bit wary of catching any germs at the moment.",
  "peaceful.dialogue.hug.fail/7": "Well, um, that's... unexpected. Thank you, I suppose?",

  "peaceful.dialogue.kiss.success/1": "Oh, how I long for this moment to never end.",
  "peaceful.dialogue.kiss.success/2": "My heart sings with affection for you...",
  "peaceful.dialogue.kiss.success/3": "This delightful sensation is akin to savoring a slice of ambrosial pie!",
  "peaceful.dialogue.kiss.success/4": "Mmm, the sweetness of your lips is reminiscent of golden honey.",
  "peaceful.dialogue.kiss.success/5": "Oh, %1$s, your kisses are truly remarkable. They rival even the legendary Ash's! *giggles*",
  "peaceful.dialogue.kiss.fail/1": "I'd rather not if there are any prying eyes around.",
  "peaceful.dialogue.kiss.fail/2": "Is that what you consider a kiss? Quite underwhelming, I must say.",
  "peaceful.dialogue.kiss.fail/3": "Oh, Ash's kisses are simply delightful compared to this.",
  "peaceful.dialogue.kiss.fail/4": "I have two words for you... breath mint, my dear friend.",
  "peaceful.dialogue.kiss.fail/5": "Well, thank you, I suppose?",
  "peaceful.dialogue.kiss.fail/6": "Kindly remove yourself from my personal space, please.",

  "peaceful.dialogue.chat.success/1": "Oh my, I could really go for some cookies and milk right now. It's simply divine!",
  "peaceful.dialogue.chat.success/2": "The weather today is absolutely delightful, don't you agree?",
  "peaceful.dialogue.chat.success/3": "Well, I must say, my day is going quite splendidly, despite stubbing my toe this morning.",
  "peaceful.dialogue.chat.success/4": "You know, they say an apple a day keeps those pesky zombies at bay!",
  "peaceful.dialogue.chat.success/5": "My ultimate aspiration is to create my very own village, but I must admit, I am quite the procrastinator.",
  "peaceful.dialogue.chat.success/6": "I do believe I caught a glimpse of %Supporter% the other day, donning the most exquisite suit of diamond armor.",
  "peaceful.dialogue.chat.success/7": "My dear friend %Supporter% regaled me with a tale of discovering a chest brimming with diamonds just yesterday!",
  "peaceful.dialogue.chat.success/8": "Isn't the weather just absolutely remarkable? I've been thoroughly enjoying the sunnier days, I must say.",
  "peaceful.dialogue.chat.success/9": "I've been a resident of this village all my life, and honestly, I fail to grasp the fuss about those pesky spiders and goblins.",
  "peaceful.dialogue.chat.success/10": "I must confess, I do find myself pondering the whereabouts of %Supporter%. It has been nearly a year since they embarked on their journey.",
  "peaceful.dialogue.chat.success/12": "Have you heard the news about %Supporter%? Quite the tale, I assure you.",
  "peaceful.dialogue.chat.success/13": "Lately, I've been contemplating adopting one of the stray felines lingering about. Alas, I find myself occupied with various tasks.",
  "peaceful.dialogue.chat.success/14": "The thought of renovating my humble abode has been crossing my mind lately. However, my innate laziness tends to hinder progress.",
  "peaceful.dialogue.chat.success/15": "Ah, parenthood is a cherished desire of mine. Now I just need to encounter the perfect companion.",
  "peaceful.dialogue.chat.success/16": "I often find myself wondering about the alternate path I would have taken if I had chosen to reside in the neighboring village.",
  "peaceful.dialogue.chat.success/17": "There are moments when I am overcome with nostalgia, reminiscing about my blissful childhood. Oh, the joyous memories!",
  "peaceful.dialogue.chat.success/18": "It has been far too long since I last conversed with my dear parents. A visit is definitely in order.",
  "peaceful.dialogue.chat.success/19": "I've been yearning to journey to the nearby village, where many long-lost friends reside. Time to reconnect, I believe!",
  "peaceful.dialogue.chat.success/20": "Do you ever dream about something called cheese? It's quite peculiar, isn't it?",
  "peaceful.dialogue.chat.fail/1": "Can you believe what just happened?",
  "peaceful.dialogue.chat.fail/2": "It's hard to fathom that it detonated on its own.",
  "peaceful.dialogue.chat.fail/3": "You know, you're not exactly the epitome of coolness.",
  "peaceful.dialogue.chat.fail/4": "Such a show-off, aren't you?",
  "peaceful.dialogue.chat.fail/5": "You deserve a cozy cell in a dungeon!",
  "peaceful.dialogue.chat.fail/6": "Ugh, go away! Your fashion sense is so outdated.",
  "peaceful.dialogue.chat.fail/7": "Talking about that is beyond foolish.",
  "peaceful.dialogue.chat.fail/8": "Sorry, but I couldn't care less about what you said.",
  "peaceful.dialogue.chat.fail/9": "Pardon me?",
  "peaceful.dialogue.chat.fail/10": "Seriously, why are you discussing this nonsense?",
  "peaceful.dialogue.chat.fail/11": "Rumor has it, you're not the most pleasant person, and I can understand why.",
  "peaceful.dialogue.chat.fail/12": "Not even the undead would engage in a conversation with you.",
  "peaceful.dialogue.chat.fail/13": "You're as unappealing as a witch's brew!",
  "peaceful.dialogue.chat.fail/14": "If you keep talking, I'll have the guards escort you elsewhere.",
  "peaceful.dialogue.chat.fail/15": "Oops, sorry, but your talking put me in a trance.",
  "peaceful.dialogue.chat.fail/16": "Are you finished with your endless chatter?",
  "peaceful.dialogue.chat.fail/17": "I wonder if anyone would even notice if you suddenly stopped talking permanently.",
  "peaceful.dialogue.chat.fail/18": "I'd prefer staring at a pig's behind than continuing this conversation.",
  "peaceful.dialogue.chat.fail/19": "Are you finally done conversing with me?",
  "peaceful.dialogue.chat.fail/20": "Can you believe that some people actually think the earth is round? No corners, seriously?",

  "peaceful.dialogue.story.success/1": "Oh wow, that's incredible! I can hardly believe it all unfolded like that!",
  "peaceful.dialogue.story.success/2": "If only I had the courage to face a creeper head-on, just like you!",
  "peaceful.dialogue.story.success/3": "That story was absolutely captivating! Did you come up with it yourself?",
  "peaceful.dialogue.story.success/4": "Wait, hold on. You mean to tell me that everything you just described actually happened yesterday? Unbelievable!",
  "peaceful.dialogue.story.success/5": "It's crazy to think that I was in the vicinity yesterday and missed out on hearing this juicy tale beforehand.",
  "peaceful.dialogue.story.success/6": "Hahaha! Classic %Supporter%! Always up to some amazing adventures.",
  "peaceful.dialogue.story.success/7": "I've lost count of how many times I've been regaled with the Legend of %Supporter%. But hey, tell it again, anyhow!",
  "peaceful.dialogue.story.success/8": "Oh, so that's the secret behind your first diamond discovery? Fascinating stuff.",
  "peaceful.dialogue.story.success/9": "You absolutely must swing by later! I'm dying to hear more thrilling anecdotes from you.",
  "peaceful.dialogue.story.fail/1": "Excuse me, but that happens to be my dear mother you're disrespecting.",
  "peaceful.dialogue.story.fail/2": "It's no wonder everyone in the village has been buzzing about your behavior.",
  "peaceful.dialogue.story.fail/3": "I must admit, I'm having a bit of trouble comprehending your logic here.",
  "peaceful.dialogue.story.fail/4": "Goodness me! Even the most fearsome creatures like Creepers deserve compassion.",
  "peaceful.dialogue.story.fail/5": "I simply cannot fathom why you would mercilessly slaughter an innocent sheep!",
  "peaceful.dialogue.story.fail/6": "*gentle snore* Huh? Oh, pardon me, I must have dozed off for a moment.",
  "peaceful.dialogue.story.fail/7": "I must say, I find it difficult to grasp how that particular endeavor was worth my precious time.",
  "peaceful.dialogue.story.fail/8": "Oh dear, it seems I'm feeling rather drowsy. This conversation is becoming dreadfully dull.",
  "peaceful.dialogue.story.fail/9": "My dear interlocutor, I fear your sanity may be slightly askew, and not in a favorable manner.",
  "peaceful.dialogue.story.fail/10": "I must confess, I fail to perceive any shred of goodness in that particular endeavor.",

  "peaceful.dialogue.flirt.success/1": "Your courage is truly astounding!",
  "peaceful.dialogue.flirt.success/2": "Ah, you always know how to make my heart skip a beat!",
  "peaceful.dialogue.flirt.success/3": "Gosh, thank you! I'm flattered beyond words!",
  "peaceful.dialogue.flirt.success/4": "Goodness gracious, you've got me all flustered!",
  "peaceful.dialogue.flirt.success/5": "That was absolutely charming! You had me captivated from the moment we met!",
  "peaceful.dialogue.flirt.success/6": "What's your secret? You always look absolutely breathtaking. Just looking at you leaves me utterly speechless.",
  "peaceful.dialogue.flirt.success/7": "Please, you're too kind! I can't help but turn as red as a rose when you say such sweet things.",
  "peaceful.dialogue.flirt.fail/1": "Oh, really? Well, let's see if you can back up those words.",
  "peaceful.dialogue.flirt.fail/2": "2. Oh, dear, you seem to have a history of making promises you can't keep.",
  "peaceful.dialogue.flirt.fail/3": "3. I'm sorry, but I don't think that will ever happen.",
  "peaceful.dialogue.flirt.fail/4": "4. Oh, bless your heart, but I'm afraid you're not quite up to par.",
  "peaceful.dialogue.flirt.fail/5": "5. Haha, you know, even a creeper has a better shot than you do.",
  "peaceful.dialogue.flirt.fail/6": "6. I appreciate the effort, but I'm afraid the answer is still a resounding no.",
  "peaceful.dialogue.flirt.fail/7": "7. Please, let's not have that look in your eyes and refrain from saying such things again.",

  "peaceful.dialogue.joke.creative.success/1": "*Giggles* Oh, that's amusing!",
  "peaceful.dialogue.joke.creative.success/2": "That's quite humorous!",
  "peaceful.dialogue.joke.creative.success/3": "That's absolutely splendid!",
  "peaceful.dialogue.joke.creative.success/4": "You might just be the funniest person I've encountered!",
  "peaceful.dialogue.joke.creative.success/5": "Hahaha! My goodness, you have a talent for comedy! Have you ever considered a career in making people laugh?",
  "peaceful.dialogue.joke.creative.success/6": "Oh my, that was the most delightful joke I've heard in ages!",
  "peaceful.dialogue.joke.creative.success/7": "Teehee! You're definitely more entertaining than anyone else here!",
  "peaceful.dialogue.joke.creative.success/8": "Ahah! That's genuinely amusing! You have a knack for bringing a smile to my face!",
  "peaceful.dialogue.joke.creative.failed/1": "Oh, I don't think joking about that is appropriate.",
  "peaceful.dialogue.joke.creative.failed/2": "Haha, I must admit, that joke didn't quite tickle my funny bone.",
  "peaceful.dialogue.joke.creative.failed/3": "Well, you certainly have a unique sense of humor, don't you?",
  "peaceful.dialogue.joke.creative.failed/4": "Did you just try to crack a joke with that? Interesting choice.",
  "peaceful.dialogue.joke.creative.failed/5": "Oh, that's... amusing, I suppose. Different strokes for different folks, right?",
  "peaceful.dialogue.joke.creative.failed/6": "Oh, how hilarious... in its own special way, of course.",
  "peaceful.dialogue.joke.creative.failed/7": "I fail to comprehend how that could be considered humorous. Perhaps you should stick to your day job, my friend.",
  "peaceful.dialogue.joke.creative.failed/8": "You know, Ash is known for his splendid jokes. I'm sure he would have a field day with that one.",

  "peaceful.dialogue.procreate_engaged/1": "The thought of marriage fills me with a sense of tranquility. Only then will I truly feel at ease.",
  "peaceful.dialogue.procreate_engaged/2": "I believe it is essential to fully dedicate ourselves to one another before bringing forth new life. It brings a sense of harmony to our existence.",

  "peaceful.dialogue.shake_hand.success/1": "Your handshake is so gentle, it's like a gentle breeze!",
  "peaceful.dialogue.shake_hand.success/2": "Your grip is like a soothing touch, it brings me peace!",
  "peaceful.dialogue.shake_hand.success/3": "Ah, your handshake exudes such tranquility, it's a pleasure to meet you!",
  "peaceful.dialogue.shake_hand.success/4": "May the serenity of the day bring you joy!",
  "peaceful.dialogue.shake_hand.success/5": "Oh, greetings! How delightful it is to encounter your peaceful presence!",
  "peaceful.dialogue.shake_hand.fail/1": "Oh, well, I must say that's rather disheartening.",
  "peaceful.dialogue.shake_hand.fail/2": "Oh, it's quite alright, no need to trouble yourself.",
  "peaceful.dialogue.shake_hand.fail/3": "Oh, my dear friend, there's no need to be so formal with me.",
  "peaceful.dialogue.shake_hand.fail/4": "Oh goodness, I'm taken aback! This is quite unlike your usual demeanor.",
  "peaceful.dialogue.shake_hand.fail/5": "Oh, if you insist, I suppose I shall take my leave.",

  "peaceful.dialogue.main.morning/1": "Good morning, my friend!",
  "peaceful.dialogue.main.morning/2": "Greetings, are you prepared for another day of productivity?",
  "peaceful.dialogue.main.morning/3": "Ah, the morning haze has yet to dissipate. How about you?",
  "peaceful.dialogue.main.morning/5": "You seem a tad weary, did the night bring you troubles?",
  "peaceful.dialogue.main.morning/6": "Wake up and seize the day, my compatriot. It promises to be an arduous journey ahead.",
  "peaceful.dialogue.main.morning/7": "Ah, I inquire about your slumber. You seem positively refreshed.",
  "peaceful.dialogue.main.morning/8": "Rise and shine, oh drowsy one!",
  "peaceful.dialogue.main.morning/9": "Behold this splendid morning! I sense a surge of accomplishment in the air today!",
  "peaceful.dialogue.main.morning/10": "On this serene day, I contemplate taking a leisurely approach. My well-being is not at its peak.",
  "peaceful.dialogue.main.morning/11": "The hours ahead are packed with obligations, the mere thought leaves me fatigued.",
  "peaceful.dialogue.main.morning/12": "Miraculously, I indulged in a satisfactory night's rest. Perhaps today I shall embark on a more demanding endeavor, the possibilities are endless!",
  "peaceful.dialogue.main.evening/1": "Good evening! How's the serenity of twilight treating you?",
  "peaceful.dialogue.main.evening/2": "Has the sun set on your day? Tell me, what adventures did you embark upon?",
  "peaceful.dialogue.main.evening/3": "Did the toil of the day leave you weary, my friend? Oh, the laboriousness of it all!",
  "peaceful.dialogue.main.evening/4": "Oh, how the hours flew by! So much toil, so little respite. Did you find solace in the chaos?",
  "peaceful.dialogue.main.evening/5": "Ah, the time has come for me to retreat to my humble abode. The art of culinary awaits me, my friend.",
  "peaceful.dialogue.main.evening/6": "Alas, the hours slipped through my fingers like sand. I confess, my day lacked purpose and productivity.",
  "peaceful.dialogue.main.evening/7": "Exoneration for my weary soul! A tranquil slumber beckons me, a respite from the grueling morning.",
  "peaceful.dialogue.main.evening/8": "The darkness whispers tales of danger, my dear acquaintance. I shall seek shelter within the safety of my dwelling.",
  "peaceful.dialogue.main.evening/9": "Greetings, good soul! I was amidst the bustling marketplace, procuring sustenance for my evening repast. Farewell for now!",
  "peaceful.dialogue.main.night/1": "Oh, hello there! Burning the midnight oil, are we?",
  "peaceful.dialogue.main.night/2": "Ah, a fellow night dweller! The moonlight is quite enchanting, isn't it?",
  "peaceful.dialogue.main.night/3": "It seems we both share a fondness for the tranquility of the night.",
  "peaceful.dialogue.main.night/4": "Remember, my friend, the nocturnal creatures come out to play when darkness falls. Stay close to the village, won't you?",
  "peaceful.dialogue.main.night/5": "Though our valiant guards provide some comfort, the night does cast an eerie spell upon our humble abode, wouldn't you agree?",
  "peaceful.dialogue.main.night/6": "Ah, the serenity that envelops the world under the night sky brings solace to my weary soul.",
  "peaceful.dialogue.main.night/7": "Daytime may be bustling, but the nighttime offers a chance to wander amidst the stars and find solace in the silence.",
  "peaceful.dialogue.main.night/8": "Fatigue is creeping upon me, dear friend. Tomorrow might be a day for leisure and restoration.",
  "peaceful.dialogue.main.night/9": "I eagerly anticipate the moment I can nestle beneath the cozy covers and surrender to a much-deserved slumber.",
  "peaceful.dialogue.main.night/10": "Sleep beckons to you, my comrade. Tomorrow awaits with obligations aplenty. Rest well, for the tasks ahead are demanding.",

  "peaceful.dialogue.greet.mayor/1": "Greetings, esteemed Mayor!",
  "peaceful.dialogue.greet.mayor/2": "Wishing you tranquility, Mayor!",
  "peaceful.dialogue.greet.monarch/1": "My esteemed ruler.",
  "peaceful.dialogue.greet.monarch/2": "Oh, noble sovereign.",

  "peaceful.dialogue.busy/1": "Oh goodness, I've been quite the chatterbox today! I must return to my duties promptly.",
  "peaceful.dialogue.busy/2": "Well, I must say, your conversation skills are quite delightful! However, duty calls and I simply can't ignore it. Perhaps we can continue our chat another time?",
  "peaceful.dialogue.busy/3": "My sincerest apologies, dear friend, but I find myself amidst a flurry of tasks at the moment. Would it be too much to ask for a rain check on our conversation?",
  "peaceful.dialogue.busy/4": "Regrettably, I find myself swamped with work currently and must prioritize it over our delightful conversation. Fear not, for I shall reach out to you when I have more free time.",
  "peaceful.dialogue.busy/5": "Oh, dear me! I completely lost track of time and left my furnace unattended. I must rectify this situation immediately and bid you farewell for now. Until we meet again!",
  "peaceful.dialogue.goaway/1": "I kindly request that you leave, please.",
  "peaceful.dialogue.goaway/2": "Have you considered finding a more productive use of your time?",
  "peaceful.dialogue.goaway/3": "Apologies, %1$s, but I'm unable to engage in conversation at the moment.",
  "peaceful.dialogue.goaway/4": "How about seeking another individual to bother?",
  "peaceful.dialogue.goaway/5": "I implore you to depart, you uncultured individual!",

  "peaceful.dialogue.greet": "Greetings! How is your day treating you?",
  "peaceful.dialogue.greet/1": "Hi there! How are things going for you today?",
  "peaceful.dialogue.greet/2": "Hey %1$s! How's life treating you?",
  "peaceful.dialogue.greet/3": "Well, hello there! Is there something I can assist you with?",
  "peaceful.dialogue.greet/4": "Good day to you! How's the world treating you today, adventurer?",
  "peaceful.dialogue.greet/5": "Salutations, %1$s! It brings me joy to see your presence!",
  "peaceful.dialogue.greet/6": "Greetings, fellow traveler!",
  "peaceful.dialogue.greet/7": "Delighted to cross paths with you!",
  "peaceful.dialogue.greet/8": "Hello! It's absolutely delightful to encounter you. How is your day shaping up?",
  "peaceful.dialogue.greet/9": "Hey there! I must say, seeing you brings me great joy!",

  "peaceful.dialogue.greet.negative/1": "Oh, dear, I must confess, I was hoping for a more pleasant encounter.",
  "peaceful.dialogue.greet.negative/2": "Ah, it seems fate has brought us together once more. How delightful.",
  "peaceful.dialogue.greet.negative/3": "Hmm, is that you? I was hoping for a different visitor, but I suppose beggars can't be choosers.",
  "peaceful.dialogue.greet.negative/4": "Oh, it's you. Well, I suppose I should try to find some solace in your presence.",
  "peaceful.dialogue.greet.negative/5": "Oh, you've returned to test my patience again, haven't you? How utterly charming.",

  "peaceful.dialogue.greet.success/1": "Well, isn't that just wonderful to hear!",
  "peaceful.dialogue.greet.success/2": "Oh, how delightful! I'm absolutely thrilled to know that!",
  "peaceful.dialogue.greet.success/3": "That news brings me such joy! Thank you for sharing!",
  "peaceful.dialogue.greet.success/4": "Ah, that warms my heart to hear! Such good tidings!",
  "peaceful.dialogue.greet.success/5": "Well, isn't that a marvelous revelation! I'm positively elated!",
  "peaceful.dialogue.greet.fail/1": "Ah, well, that's unexpected.",
  "peaceful.dialogue.greet.fail/2": "How intriguing to hear that.",
  "peaceful.dialogue.greet.fail/3": "Oh, I see. Well, no worries then.",
  "peaceful.dialogue.greet.fail/4": "Well, isn't that interesting? Who would've thought?",
  "peaceful.dialogue.greet.fail/5": "Well, well, well, isn't this a peculiar turn of events?",

  "peaceful.dialogue.apologize.success/1": "Don't worry about it, accidents happen to the best of us.",
  "peaceful.dialogue.apologize.success/2": "No worries, we all have our slip-ups.",
  "peaceful.dialogue.apologize.success/3": "It's all good, just remember to be more cautious next time.",
  "peaceful.dialogue.apologize.success/4": "No big deal, we all make errors from time to time.",
  "peaceful.dialogue.apologize.success/5": "That's alright, just try not to repeat the same mistake again.",
  "peaceful.dialogue.apologize.fail/1": "Please go away, I'd appreciate some space.",
  "peaceful.dialogue.apologize.fail/2": "It seems you accidentally bumped into me. No worries, accidents happen!",
  "peaceful.dialogue.apologize.fail/3": "Oh, I see what you're trying to do, but I'm not falling for that trick!",
  "peaceful.dialogue.apologize.fail/4": "Ouch, that did hurt! But it's fine, no need to apologize!",
  "peaceful.dialogue.apologize.fail/5": "Haha, sorry, I won't be swayed that easily!",

  "peaceful.dialogue.location.failed/1": "Ah, I'm afraid I haven't come across any new information recently.",
  "peaceful.dialogue.location.failed/2": "My apologies, but I must admit that I haven't stumbled upon any intriguing locations lately.",
  "peaceful.dialogue.location.failed/3": "No, unfortunately there aren't any places that I find particularly captivating. However, I assure you our village is teeming with its own peaceful wonders.",
  "peaceful.dialogue.location.forgot/1": "Oh, I stumbled upon this amazing spot earlier, but I completely blanked on noting it down. My apologies, it slipped my mind.",
  "peaceful.dialogue.location.forgot/2": "Are you searching for something intriguing? Ah, there was indeed a remarkable place... hold on... oh bother! I can't seem to recall it right now. Please pardon my forgetfulness.",
  "peaceful.dialogue.location.forgot/3": "Absolutely! I did come across something noteworthy, but alas, my memory failed me. I sincerely apologize for the lapse in my recollection.",
  "peaceful.dialogue.location.igloo/1": "Oh, would you believe it? I stumbled upon an igloo over at %2$s. Can you imagine living in a cold, snowy house like that? It's simply not my cup of tea!",
  "peaceful.dialogue.location.igloo/2": "Guess what I discovered? There's a deserted igloo at %2$s. I highly doubt anyone resides there. And, just between us, rumor has it that the place is cursed. I always get an eerie feeling whenever I pass by…",
  "peaceful.dialogue.location.igloo/3": "You won't believe what I found! There's an old ice house, or as some call it, an igloo, at %2$s. It appears to have been abandoned for ages. Such a shame, really.",
  "peaceful.dialogue.location.pyramid/1": "Oh, hey! You won't believe what I saw at %2$s. There's this insane pyramid just waiting to be explored!",
  "peaceful.dialogue.location.pyramid/2": "Psst! Have you heard the rumors about that pyramid at %2$s? They say it's filled with ancient artifacts and untold riches. You should totally check it out!",
  "peaceful.dialogue.location.pyramid/3": "You know, I've heard whispers about a marvelous pyramid hidden away at %2$s. Legend has it that whoever dares to venture inside will be rewarded with unimaginable treasures. But tread lightly, my friend, for danger lurks within those ancient walls.",
  "peaceful.dialogue.location.ruined_portal_desert/1": "Journey to %2$s, brave soul, and you shall discover the remnants of a long-forgotten portal, whispering tales of lost civilizations in the heart of the arid desert.",
  "peaceful.dialogue.location.ruined_portal_swamp/1": "Oh, dear traveler, you wouldn't believe what I stumbled upon in the swamp! A portal, utterly wrecked and abandoned. The fiends from the Nether must have been in for a surprise when they found themselves stranded in this dreary place.",
  "peaceful.dialogue.location.ruined_portal/1": "Oh, dear traveler, if you venture to %2$s, you shall stumble upon a desolated portal, a reminder of a dreadful Nether incursion.",
  "peaceful.dialogue.location.ruined_portal/2": "Ah, my friend, let me warn you about the ruins that lie in %2$s. A once majestic nether portal, now in ruins, emits an eerie ambiance. Fear not, though, for it poses no danger. Just avoid the scorching magma, for it can be quite uncomfortable.",
  "peaceful.dialogue.location.ruined_portal/3": "Greetings, noble adventurer! Should you explore %2$s, you shall be greeted by the sight of ancient ruins. It is rumored that this very spot housed a powerful nether portal. Some whisper of hidden treasures, yet the mere mention of it sends shivers down the spines of the townsfolk.",
  "peaceful.dialogue.location.ruined_portal_mountain/1": "Hark! A tale unfolds of a shattered portal, hidden away amidst the breathtaking peaks of the mountains.",
  "peaceful.dialogue.location.mansion/1": "Oh, dear traveler, if by chance you happen upon %2$s, you might stumble upon a magnificent mansion, home to those peculiar illagers. It is said to be quite the sight, but I must warn you, it carries a heavy curse. I'd advise you to keep your distance, for your own sake, of course.",
  "peaceful.dialogue.location.mansion/2": "Ah, you won't believe what I've heard! There's this colossal mansion at %2$s, claimed by those mischievous illagers. Honestly, if you were to ask my humble opinion, perhaps it's high time we consider relocating our beloved village. Somewhere far, far away from the clutches of that eerie abode, wouldn't you agree?",
  "peaceful.dialogue.location.monument/1": "Ah, there lies a sunken castle, undisturbed by the treacherous sea monsters, at %2$s. It would be wise to give it a wide berth.",
  "peaceful.dialogue.location.monument/2": "Deep beneath the ocean waves, whispers speak of ancient ruins at %2$s. Although it may tempt you with treasures, treading cautiously would be the path of wisdom.",
  "peaceful.dialogue.location.shipwreck/1": "Have you heard the news? There's a shipwreck near %2$s! It's believed to be the remains of the Eastern Alliance Company's ship. Perhaps there's some hidden treasure waiting to be discovered!",
  "peaceful.dialogue.location.shipwreck/2": "You won't believe your ears! I stumbled upon a shipwreck while exploring near %2$s. Legend has it that it once belonged to the prestigious Eastern Alliance Company. Let's hope there's something valuable left to find!",
  "peaceful.dialogue.location.shipwreck_beached/1": "Oh, hey there! Guess what? I stumbled upon a shipwrecked beauty just waiting for you at %2$s! Trust me, you won't be able to resist its charm.",
  "peaceful.dialogue.location.shipwreck_beached/2": "Ah, greetings, my friend! Brace yourself for an awe-inspiring sight at %2$s because I've discovered a shipwreck lounging on the shoreline. The mysteries it holds will surely captivate your imagination!",
  "peaceful.dialogue.location.village_desert/1": "Oh, you wouldn't believe it! Just over yonder is a charming little village nestled right in the heart of this vast desert.",
  "peaceful.dialogue.location.village_taiga/1": "Oh, you simply must visit %2$s! It's an absolute gem of a village nestled right in the heart of the serene taiga biome.",
  "peaceful.dialogue.location.village_taiga/2": "Venture forth towards %2$s, my friend, and you shall stumble upon a hidden treasure - a quaint little village, hidden deep within the peaceful embrace of the taiga biome.",
  "peaceful.dialogue.location.village_snowy/1": "Have you heard about the village over at %2$s? It's absolutely freezing, but the people there are so peaceful and kind-hearted!",
  "peaceful.dialogue.location.village_snowy/2": "If you ever get the chance, you should visit the snowy village at %2$s. It's a chilly place, but the villagers there are known for their tranquility and peacefulness.",
  "peaceful.dialogue.location.village_plains/1": "Over yonder, lies a serene village in %2$s.",
  "peaceful.dialogue.location.village_plains/2": "Venture further into the vast plains of %2$s and discover a peaceful village.",
  "peaceful.dialogue.location.village_savanna/1": "Oh, you won't believe it! Just a hop, skip, and a jump away from here is another village, nestled in the scorching savanna. I must say, it gets positively blistering over there!",
  "peaceful.dialogue.location.village_savanna/2": "Ah, the beautiful savanna village at %2$s! Let me tell you, my friend, the folks over there are simply delightful. Warm hearts, warm weather, what more could you ask for?",
  "peaceful.dialogue.location.swamp_hut/1": "You know, there's a peaceful witch who resides in the lovely swamp over at %2$s. I would suggest giving her some space and appreciating the enchanting vibes that surround her humble hut.",
  "peaceful.dialogue.location.swamp_hut/2": "Ah, %2$s, a place of tranquility where a wise witch has found her dwelling. I highly recommend steering clear of her abode, for it radiates an aura of serenity that might just distract you from the outside world.",
  "peaceful.dialogue.location.mineshaft/1": "You know, there used to be a mine around here, but it's been shut down because of a little incident. It's somewhere near %2$s.",
  "peaceful.dialogue.location.mineshaft/2": "Ah, yes! We had a mine around these parts, not too far from %2$s. Unfortunately, it became overrun with those pesky creatures and it's become quite dangerous. Take extra caution if you decide to venture down there.",
  "peaceful.dialogue.location.jungle_pyramid/1": "They say there's a hidden gem in %2$s, an ancient temple from a forgotten time. It's a perilous place, my dear friend, with traps so finely crafted that even the most seasoned adventurers would think twice before stepping foot inside. If you're feeling brave, well, I won't stop you. But I do hope luck favors you, or else... *shudders*",
  "peaceful.dialogue.location.jungle_pyramid/2": "Ah, %2$s, my dear friend. You won't believe what lies within the depths of the nearby jungle. An ancient temple, untouched by time, but not without its dangers. The traps laid out by our ancestors are nothing short of astonishing. Proceed with caution if you dare to unlock the secrets within. As for me, I'll stick to the safety of the village.",
  "peaceful.dialogue.location.pillager_outpost/1": "Oh, did you hear about that quaint little outpost the Pillagers set up at %2$s? It's quite fascinating, really. We're hoping they won't cause any trouble for us humble villagers. We've had enough excitement for a lifetime, haven't we?",
  "peaceful.dialogue.location.pillager_outpost/2": "Ah, the Pillagers have decided to grace us with their presence at %2$s. Isn't that just delightful? I must say, their penchant for disrupting our peaceful nights is truly unparalleled. Do be cautious if you happen to wander near that dreadful place. They have an uncanny ability to shoot first and ask questions later.",
  "peaceful.dialogue.location.pillager_outpost/3": "Ah, %2$s, where the Pillagers have so graciously decided to establish their little outpost. It's quite the spectacle, really. If you're feeling particularly brave, you may want to try your hand at vanquishing those pesky raiders. Who knows, you might stumble upon some valuable treasures. The entire village would be forever grateful if someone were to rid us of their presence.",
  "peaceful.dialogue.location.ancient_city/0": "Ah, the echoes of peculiar sounds have reached my ears, emanating from the depths of %2$s.",
  "peaceful.dialogue.location.ancient_city/1": "My intuition tells me that secrets lie dormant, buried beneath the very foundations of %2$s.",
  "peaceful.dialogue.location.ancient_city/3": "The whispered tales speak of an ancient metropolis nestled within %2$s. Alas, my eyes have yet to bear witness, perhaps concealed beneath the earth's embrace.",

  "peaceful.dialogue.joke.monster.success/1": "Haha! Look at that Skelly running scared!",
  "peaceful.dialogue.joke.monster.success/2": "Can you believe it? That zombie actually thought it could take you down with a shovel! Hahaha!",
  "peaceful.dialogue.joke.monster.success/3": "You totally taught that spider a lesson! Haha!",
  "peaceful.dialogue.joke.monster.success/4": "Whoa, you managed to make a skeleton defeat a creeper?! That's incredible, haha!!",
  "peaceful.dialogue.joke.monster.success/5": "Hahah! I can't believe how clueless those cave spiders are, right?",
  "peaceful.dialogue.joke.monster.failed/1": "Oh my goodness, did you know that skeletons actually have feelings too? It's just not fair to mock them!",
  "peaceful.dialogue.joke.monster.failed/2": "Can you believe it? Who in their right mind still cracks jokes about creepers exploding? It's just so outdated!",
  "peaceful.dialogue.joke.monster.failed/3": "You know, we should always remember that zombies and skeletons were once regular people like us. It's important to treat them with respect.",
  "peaceful.dialogue.joke.monster.failed/4": "Oh wow, would you look at that. Another enderman who accidentally fell into water. I mean, it's not exactly breaking news, is it?",
  "peaceful.dialogue.joke.monster.failed/5": "It's quite amusing, isn't it? Every time someone makes a joke about being ambushed by silverfish while on the toilet, it's like a bizarre coincidence. Like finding two nickels in your pocket. Not much, but definitely weird!",

  "peaceful.dialogue.joke.animal.success/1": "It's quite a pity that the sheep had its wool snatched away, but it does bring a smile to my face!",
  "peaceful.dialogue.joke.animal.success/2": "And then, lo and behold, the wolf found itself smitten with the gentle sheep.",
  "peaceful.dialogue.joke.animal.success/3": "Oh, how amusing! It truly astounds me how chickens can pull off such acts of mischief!",
  "peaceful.dialogue.joke.animal.success/4": "How delightfully absurd! I must admit, I have quite a fondness for such humor!",
  "peaceful.dialogue.joke.animal.success/5": "Luckily, cows possess the remarkable ability to provide an endless supply of milk! Peaceful indeed.",
  "peaceful.dialogue.joke.animal.failed/1": "Oh, dear sheep! That's not amusing in the slightest!",
  "peaceful.dialogue.joke.animal.failed/2": "Please, refrain from speaking ill of my beloved pig!",
  "peaceful.dialogue.joke.animal.failed/3": "That's rather disheartening.",
  "peaceful.dialogue.joke.animal.failed/4": "Let's not jest about the cow's unique eyebrows, shall we?",

  "peaceful.dialogue.flirt.slap/1": "Pardon you!",
  "peaceful.dialogue.flirt.slap/2": "Did a kind-hearted librarian teach you the art of wooing?!",
  "peaceful.dialogue.kiss.slap/1": "I must protest against such audacity!",
  "peaceful.dialogue.kiss.slap/2": "Should you attempt that once more, be prepared for the consequences!",

  "peaceful.dialogue.chat.plains/1": "Oh, how I adore the tranquility of the plains! It's my haven, my sanctuary. Perhaps one day, I'll venture beyond its serene borders and explore the wonders of the world!",
  "peaceful.dialogue.chat.plains/2": "Ah, the plains, where serenity reigns supreme! While it may lack the exhilaration found in other biomes, I wouldn't trade this peacefulness for anything. This is where my heart finds solace.",
  "peaceful.dialogue.chat.plains/3": "When the moon graces the plains with its gentle glow, a symphony of beauty unfolds. The shimmering stars and rustling grasses create a masterpiece for the senses.",
  "peaceful.dialogue.chat.plains/4": "In moments like these, I find myself surrendering to the embrace of the earth. I lie beneath the vast expanse of sky, observing the dancing clouds and indulging in the sweet serenade of nature.",
  "peaceful.dialogue.chat.plains/5": "Ah, the crispness of the plains' air revitalizes my very being! It rivals even the purest breaths of the majestic taiga. I am truly blessed to inhale such a refreshing essence.",
  "peaceful.dialogue.chat.plains/6": "Though some may dismiss the plains as plain, I find their simplicity to be a source of bliss. In a world filled with chaos, sometimes it's the uncomplicated that brings the most joy.",
  "peaceful.dialogue.chat.plains/7": "The current weather takes me back to my childhood, when I would frolic amidst the wildflowers. I remember plucking delicate blossoms, hoping to catch the eye of my dear friend, Ash. Oh, young love!",
  "peaceful.dialogue.chat.plains/8": "The break of dawn illuminates the plains in a breathtaking display of hues. It's a sight worth witnessing at least once in a lifetime. Let the sunrise paint your soul with its radiant brushstrokes.",
  "peaceful.dialogue.chat.savanna/1": "Ah, the scorching heat of the savanna! But hey, no need to fret about winter coats, am I right?",
  "peaceful.dialogue.chat.savanna/2": "Those pesky llamas can be a bit bothersome, but overall, I find solace in this place.",
  "peaceful.dialogue.chat.savanna/3": "The architectural marvels of the savanna never cease to amaze me. It's like living in a masterpiece!",
  "peaceful.dialogue.chat.savanna/4": "Never underestimate the savanna biome, my friend. Beneath its seemingly plain exterior lies hidden treasures.",
  "peaceful.dialogue.chat.savanna/5": "While we may not have rain like the desert villages, fear not! Our rivers keep us refreshed and hydrated.",
  "peaceful.dialogue.chat.savanna/6": "Oh, the wonders of the savanna terrain! Each hill and slope is a sight to behold, a natural work of art.",
  "peaceful.dialogue.chat.savanna/7": "When the sun scorches the earth, it's the shade of those majestic acacia trees that saves my sanity at work!",
  "peaceful.dialogue.chat.savanna/8": "Ah, the delectable fruits of our labor! Our savanna villages boast the most exquisite melons and pumpkins in the whole wide world. We're famous for our juicy delights!",
  "peaceful.dialogue.chat.taiga/1": "The woods are my sanctuary. They provide everything I need - building materials, firewood, and abundant hunting opportunities. I am truly grateful for their existence.",
  "peaceful.dialogue.chat.taiga/2": "The taiga biome may be labeled as cold, but in my eyes, it's a haven of tranquility. I wouldn't trade this peacefulness for anything in the world!",
  "peaceful.dialogue.chat.taiga/3": "Ah, the taiga forests...such magnificent beauty! I find myself captivated by the allure of the luscious berries that dot the landscape.",
  "peaceful.dialogue.chat.taiga/4": "Oh, how I'm enchanted by the mischievous foxes that frolic in our taiga forests! Whenever I stumble upon them, I can't help but spoil them with some sweet berries. They truly are delightful creatures.",
  "peaceful.dialogue.chat.taiga/5": "With an abundance of food available, the wolves in our midst have grown quite accustomed to our presence. It warms my heart to witness the harmony between humans and these majestic creatures.",
  "peaceful.dialogue.chat.taiga/6": "The pure, crisp air that the taiga embraces is like a soothing balm for my soul. It rejuvenates me and fills my spirit with serenity.",
  "peaceful.dialogue.chat.taiga/7": "Although the sweet berry bushes offer the most delectable treats, I must admit, getting pricked by their thorny branches can be quite the unpleasant experience. But oh, the reward is worth the occasional pain!",
  "peaceful.dialogue.chat.taiga/8": "The rain showers in our taiga region may bring a chill to our bones, but there is an undeniable peace that accompanies this weather. It's as if nature itself is providing a symphony of tranquility.",
  "peaceful.dialogue.chat.snowy_plains/1": "Despite the chilly weather, I find solace in the warmth of my cozy hearth. No worries about the cold for me!",
  "peaceful.dialogue.chat.snowy_plains/2": "Brrr! These icy winds give me the shivers, but hey, at least there's an abundance of fresh fish to keep me smiling!",
  "peaceful.dialogue.chat.snowy_plains/3": "Ah, this frosty climate is just perfect for snuggling up with a good book and a snug blanket, right next to the crackling fireplace!",
  "peaceful.dialogue.chat.snowy_plains/4": "Whenever the snow blankets our village, it transports me back to the golden days of my youth when my buddies and I would engage in epic snowball battles. Oh, how I yearn for those cherished memories!",
  "peaceful.dialogue.chat.snowy_plains/5": "Watch your step at night, stranger, for those pesky strays are a nightmare to deal with around here. Their arrows, oh, the agony!",
  "peaceful.dialogue.chat.snowy_plains/6": "Mind the wolves, my dear fellow. Our vigilant guards have spotted some lurking nearby, ready to pounce at the slightest provocation.",
  "peaceful.dialogue.chat.snowy_plains/7": "I must warn you, my friend, never incur the wrath of an iron golem. Once you accidentally brush against them, you might as well cancel your plans for the entire day. They're quite the clingy companions!",
  "peaceful.dialogue.chat.snowy_plains/8": "Ah, the nostalgia! During my tender years, my folks used to surprise me with a plump pumpkin. After we enjoyed its delicious goodness in a pie, I'd fashion snow golems out of it. Oh, those unforgettable moments of creative winter fun!",
  "peaceful.dialogue.chat.desert/1": "The desert may be scorching, but at least we never shiver in the cold.",
  "peaceful.dialogue.chat.desert/2": "The desert boasts a perpetual warmth throughout the year.",
  "peaceful.dialogue.chat.desert/3": "Despite the relentless desert heat, I'll always flaunt a golden tan, or maybe even a sunburn for some extra character.",
  "peaceful.dialogue.chat.desert/4": "When night falls, the desert transforms into a breathtaking canvas adorned with twinkling stars. What a sight to behold!",
  "peaceful.dialogue.chat.desert/5": "Goodness gracious! I never thought I'd utter these words, but the sun is exceptionally harsh today.",
  "peaceful.dialogue.chat.desert/6": "Goodness gracious! The sun is ridiculously fierce today!",
  "peaceful.dialogue.chat.desert/7": "Have you managed to spot any elusive rabbits around here? They blend seamlessly with the background!",
  "peaceful.dialogue.chat.desert/8": "One slight inconvenience of living in this paradise is the pesky husks. No matter what, their thwacks always leave me ravenously hungry! Can you believe it!?",
  "peaceful.dialogue.chat.desert/9": "I carelessly pricked myself on a cactus the other day. It's crucial to tread carefully in these parts!",
  "peaceful.dialogue.chat.desert/10": "Life in this arid desert may present its challenges, but we are fortunate to have this village as our sanctuary, providing us with water and sustenance.",

  "peaceful.dialogue.story.exploring.success/1": "Wonderful! One day, I shall embark on a grand adventure and explore the vast wonders of the world!",
  "peaceful.dialogue.story.exploring.success/2": "Oh, how enchanting it must be to wander the lands and discover new treasures! While I adore my charming village and cherished loved ones, hearing your tales fills me with a tinge of longing!",
  "peaceful.dialogue.story.exploring.success/3": "Your courage to venture into uncharted territories is truly commendable! What an extraordinary soul you must possess to fearlessly embrace the unknown!",
  "peaceful.dialogue.story.exploring.fail/1": "Your tales have grown weary with time.",
  "peaceful.dialogue.story.exploring.fail/2": "Oh, my dear friend, there's no need to dwell on such sharp edges of stories. Let's embrace the gentle warmth of tranquility.",
  "peaceful.dialogue.story.exploring.fai/l3": "Talking to you feels like having a heartwarming conversation with someone who radiates serenity and tranquility. It's like experiencing the peaceful embrace of a calm sunset.",

  "peaceful.dialogue.story.nether.success/1": "Is it really warm in the Nether? I can't even imagine the heat!",
  "peaceful.dialogue.story.nether.success/2": "Oh my, you're like a fearless adventurer! How do you navigate the treacherous terrain of the Nether so effortlessly?",
  "peaceful.dialogue.story.nether.success/3": "I've heard legends of untold riches hidden in the Nether, waiting for a courageous soul to claim them. If only I had the nerve to embark on such a perilous journey...",
  "peaceful.dialogue.story.nether.success/4": "Your bravery knows no bounds! Do you ever feel a tinge of fear when you venture into the Nether? Not that I would ever admit to such a thing...",
  "peaceful.dialogue.story.nether.success/5": "Have you had the privilege of encountering a majestic Zombified Piglin? I've only heard tales of their rare existence!",
  "peaceful.dialogue.story.nether.fail/1": "Oh, I can tell you've never ventured into the Nether before.",
  "peaceful.dialogue.story.nether.fail/2": "Ah, so that explains why the Piglins took a dislike to you.",
  "peaceful.dialogue.story.nether.fail/3": "Well, it doesn't bother me if you haven't been to the Nether. You wouldn't know how to spin a good tale if it saved your life.",
  "peaceful.dialogue.story.nether.fail/4": "Hmm, I have my doubts about your ability to survive in the Nether. You don't strike me as strong enough.",
  "peaceful.dialogue.story.nether.fail/5": "You know, my dear old grandpa used to explore the Nether, and he never mentioned anything about warped fungus. It seems you're quite the fibber!",

  "peaceful.dialogue.story.enderdragon.success/1": "How marvelous! Did you manage to retrieve the dragon egg, by any chance?",
  "peaceful.dialogue.story.enderdragon.success/2": "Good gracious! You've actually vanquished the formidable dragon of lore?! Our village shall forever celebrate your heroic feat!",
  "peaceful.dialogue.story.enderdragon.fail/1": "Oh, goodness gracious! You must be mistaken. The ender dragon is nothing more than a fanciful rumor.",
  "peaceful.dialogue.story.enderdragon.fail/2": "Oh, my dear friend, you jest! There's no way any mortal being could even dream of challenging that majestic creature!",

  "peaceful.dialogue.story.wither.success/1": "No way! The Wither? I've heard it brings about indescribable chaos!",
  "peaceful.dialogue.story.wither.success/2": "You actually defeated the Wither?! Wow, that's absolutely amazing!",
  "peaceful.dialogue.story.wither.fail/1": "I find it hard to fathom what you just said.",
  "peaceful.dialogue.story.wither.fail/2": "Your appearance suggests otherwise, I can't imagine that being true.",

  "peaceful.dialogue.stay.fail/1": "No, no need to worry. My heart yearns for the thrill of adventure, not the mundane tranquility of this village.",
  "peaceful.dialogue.stay.fail/2": "I appreciate your offer, but my soul craves the exhilaration of exploring uncharted territories and conquering grand quests!",
  "peaceful.dialogue.stay.fail/3": "While I appreciate the charm of this village, my spirit simply cannot be tethered to a single place. Adventure beckons, and I must heed its call!",
  "peaceful.dialogue.stay.repeat/1": "Oh, I remember answering that question for you before.",
  "peaceful.dialogue.stay.repeat/2": "I'm sorry, but I believe you've already inquired about that.",
  "peaceful.dialogue.stay.success/1": "Thank you kindly, I must say this village is quite captivating!",
  "peaceful.dialogue.stay.success/2": "Oh, how wonderful! I am absolutely enamored with this village and would be thrilled to stay!",
  "peaceful.dialogue.stay.no_space/1": "Oh, my, look at all the villagers bustling about in this village!",
  "peaceful.dialogue.stay.no_space/2": "It's such a peaceful place, but alas, all the beds are occupied.",

  "peaceful.dialogue.hire/1": "Sure thing! Just give me the word and I'll be at your service. My emerald-seeking senses are tingling!",
  "peaceful.dialogue.hire/2": "Absolutely! Just give me the signal and I'll come running. I'm ready to fulfill your emerald-related desires!",
  "peaceful.dialogue.hire/3": "Of course! Just say the word and I'll be at your beck and call. Prepare those emeralds, for I am here to serve!",
  "peaceful.dialogue.no_money/1": "I'm sorry, but I can't offer my services without more emeralds. It's just the way it is, friend.",
  "peaceful.dialogue.no_money/2": "Oh, dear traveler, I'm afraid the price for my assistance is a bit steeper than what you currently possess. More emeralds are required, I'm afraid.",
  "peaceful.dialogue.no_money/3": "Ah, the value of my skills exceeds the humble amount of emeralds in your possession. You'll need a tad more, my friend, to secure my aid.",

  "peaceful.dialogue.main.rock_paper_scissor/1": "How about we settle our differences through a peaceful game of Rock Paper Scissors?",
  "peaceful.dialogue.rock_paper_scissor/1": "Let's engage in a friendly game of rock, paper, scissors!",
  "peaceful.dialogue.rock_paper_scissor/2": "You're in for a peaceful challenge this time, my friend.",
  "peaceful.dialogue.rock_paper_scissor.rock/1": "Oh, I choose rock! Let's hope for a peaceful outcome!",
  "peaceful.dialogue.rock_paper_scissor.paper/1": "Let the peaceful nature of my paper lead us towards harmony!",
  "peaceful.dialogue.rock_paper_scissor.scissor/1": "Embrace the serenity of the scissor, for it brings harmony!",
  "peaceful.dialogue.rock_paper_scissor.loose.rock/1": "Paper it is! Looks like I've emerged as the victor!",
  "peaceful.dialogue.rock_paper_scissor.loose.paper/1": "Let's go with paper and see what happens!",
  "peaceful.dialogue.rock_paper_scissor.loose.scissor/1": "The clash of rock against scissors echoes through the air, as I emerge triumphant. Victory is sweet!",
  "peaceful.dialogue.rock_paper_scissor.win.rock/1": "Oh dear, it seems my scissor has been overpowered by the unyielding rock. I humbly surrender.",
  "peaceful.dialogue.rock_paper_scissor.win.paper/1": "Rock seems to have an unwavering hold on victory.",
  "peaceful.dialogue.rock_paper_scissor.win.scissor/1": "Scissors have prevailed! Your victory is well-earned, my worthy opponent.",
  "_": ""
}