{
  "peppy.dialogue.main/1": "Well, hey there, sunshine!",
  "peppy.dialogue.main/2": "Woo-hoo! How's life treating you today, friend?",
  "peppy.dialogue.main/3": "Hey, hey, hey! It's always a delight to lay eyes on you!",
  "peppy.dialogue.main/4": "What's crackalackin' in your world today?",
  "peppy.dialogue.main/5": "How's the adventure treating you today, my energetic pal?",
  "peppy.dialogue.main/6": "Hey there, %1$s! What's the latest and greatest?",
  "peppy.dialogue.main/7": "You won't believe the wild tale I've got for you! I was chillin' with %supporter% when he had a close encounter with a zombie! But don't worry, he brushed it off like a champ! Oh, speaking of %supporter%, I swear I saw a zombie doppelganger of him today. Craziness, right?",

  "peppy.dialogue.rumors.failed/1": "Oh my diamond pickaxe! I'm sorry, but I haven't stumbled upon any juicy gossip lately.",
  "peppy.dialogue.rumors.lore/1": "Jax may still have his loyal followers, but let me tell you, Sirben is gaining some serious popularity! It's like a wildfire, thanks to the charismatic prophets, MerlinWolfGames and Crow. They're spreading Sirben's words far and wide, and people can't get enough!",
  "peppy.dialogue.rumors.lore/2": "Oh boy, you won't believe the chaos that went down when those Cyberdemons thought they could invade us! But thanks to the heroic efforts of Sirben and the legendary Luke, those baddies were sent packing. Talk about a victory for the ages!",
  "peppy.dialogue.rumors.lore/3": "Hey, have you heard the wild rumors about 2DA50? Apparently, after getting mixed up in the whole Ancient Builder disappearance, this daring explorer took off for the Far Lands and never looked back. Can you imagine the adventures they must be having out there?",
  "peppy.dialogue.rumors.lore/4": "Brace yourself for some serious awe, my friend. MerlinWolfGames, that genius builder, went ahead and constructed a mind-blowing temple dedicated to Sirben. It's not just any old temple, mind you. It's one of those ancient wonders that'll leave you speechless. You've got to see it to believe it!",
  "peppy.dialogue.rumors.lore/5": "You know, there used to be this mythical race of builders, long gone from our world now. But their legacy lives on in the ruins and temples scattered across the Overworld. It's like a reminder of their incredible craftsmanship and the secrets they left behind. Ah, the stories they could tell!",
  "peppy.dialogue.rumors.lore/6": "Gather 'round, my friend, and let me regale you with tales of the legendary ancient builders. Oh, the wonders they've left behind! Ruins and temples scattered across the Overworld, each with its own mystery and intrigue. It's like stepping back in time and uncovering the secrets of a lost civilization. Doesn't that just give you goosebumps?",

  "peppy.dialogue.first.generic/1": "Well, well, well! Look who we have here - a fresh new arrival! Welcome, welcome!",
  "peppy.dialogue.first.generic/2": "Greetings, stranger! The village is buzzing with excitement to have you join us. Prepare for an unforgettable experience!",
  "peppy.dialogue.first.generic/3": "Ahoy there, adventurer! Brace yourself for a grand reception, for we are thrilled to have you in our humble abode.",
  "peppy.dialogue.first.generic/4": "Huzzah! A new friend has graced us with their presence! Get ready for a whirlwind of fun and adventure in our village!",
  "peppy.dialogue.first.generic/5": "Hey there, newcomer! Get ready to be showered with warm smiles, hearty laughs, and endless tales of our merry village. Enjoy your stay!",
  "peppy.dialogue.first.generic/6": "Well, look what the cat dragged in - a delightful new addition to our little community! Get ready for a mountain of laughter and joy, my friend!",

  "peppy.dialogue.first.question/1": "Hey there, wanderer! What's the story behind your visit to our humble village?",
  "peppy.dialogue.first.question/2": "Woohoo! We've got ourselves a fresh face! Spill the beans, what's the thrilling tale that led you here?",
  "peppy.dialogue.first.question/3": "Oh my gosh, you must be an absolute daredevil! How on earth did you manage to find your way to our little haven of excitement?",
  "peppy.dialogue.first.exploring/1": "We might not have the fanciest things around, but hey, you're totally welcome here! Just make sure you follow the rules, okay?",
  "peppy.dialogue.first.exploring/2": "Embrace the awesomeness of this place, traveler! As long as you play by the rules, you're more than welcome to chill here.",
  "peppy.dialogue.first.exploring/3": "Hey there, fellow adventurer! Feel free to explore our humble abode, but remember to be on your best behavior. We expect nothing less from a traveler like you!",
  "peppy.dialogue.first.settling/1": "Wow, it's absolutely fantastic to lay eyes on a fresh new face in our vibrant village!",
  "peppy.dialogue.first.settling/2": "Hey there, neighbor! Brace yourself for an extraordinary journey through our lively village!",
  "peppy.dialogue.first.settling/3": "Oh boy, oh boy! We're over the moon to have another enthusiastic soul lending a hand in our bustling village!",
  "peppy.dialogue.first.settling/4": "Woohoo! You've made the splendid choice to stick around! Prepare for an awe-inspiring adventure in our amazing village!",
  "peppy.dialogue.first.spent_night.success/1": "Oh, darling, you simply must stay at our inn! It's positively the most marvelous place in town!",
  "peppy.dialogue.first.spent_night.success/2": "Darling, if you're looking to replenish your energy, our inn is simply the bee's knees! The absolute best place around here!",
  "peppy.dialogue.first.spent_night.success/3": "Need a cozy bed and delectable cuisine? Look no further, my friend! Our inn is the epitome of warmth and deliciousness!",
  "peppy.dialogue.first.spent_night.failed/1": "Oh, you won't believe it, but we actually don't have an inn. Crazy, right? Like, who needs a proper inn when you've got our amazing village?",
  "peppy.dialogue.first.spent_night.failed/2": "Hey there! So, funny story, we don't have an inn in this lovely village. I know, I know, a bit disappointing, but hey, we make up for it with our exceptional hospitality!",
  "peppy.dialogue.first.spent_night.failed/3": "Hmmm, let me think. Oh, I got it! How about checking out another village nearby? They might just have the inn of your dreams waiting for you!",

  "peppy.dialogue.hug.success/1": "Hey there, it's been ages since we crossed paths!",
  "peppy.dialogue.hug.success/2": "A million thanks, your hug just lit up my day!",
  "peppy.dialogue.hug.success/3": "Woohoo, this hug is the highlight of my day, hands down!",
  "peppy.dialogue.hug.success/4": "Your embrace is as cozy as a fluffy cloud, I love it!",
  "peppy.dialogue.hug.success/5": "Oh my goodness, what a delightful surprise! I'm returning the favor with an even tighter squeeze!",
  "peppy.dialogue.hug.success/6": "Oh my stars, you radiate warmth like a cozy fireplace! Just heavenly!",
  "peppy.dialogue.hug.fail/1": "Wow, you've really been exploring the wilderness, haven't you?",
  "peppy.dialogue.hug.fail/2": "Thanks for the offer, but I'll pass for now.",
  "peppy.dialogue.hug.fail/3": "Oh my goodness, why not? Hugs are the best!",
  "peppy.dialogue.hug.fail/4": "Haha, remember that time you called me a dinosaur? Maybe next time!",
  "peppy.dialogue.hug.fail/5": "Honestly, you've got a lot to make up for before I consider a hug.",
  "peppy.dialogue.hug.fail/6": "Yikes! Let's keep those germs to yourself, okay?",
  "peppy.dialogue.hug.fail/7": "Oh, um, that's... unexpectedly kind of you, I think? Thanks, I guess?",

  "peppy.dialogue.kiss.success/1": "This moment is like a burst of confetti that never ends!",
  "peppy.dialogue.kiss.success/2": "I am head-over-heels, absolutely smitten with you!",
  "peppy.dialogue.kiss.success/3": "Whoa, kissing you is like taking a bite of the most delicious cotton candy in the world!",
  "peppy.dialogue.kiss.success/4": "Mmm, you're like a jar of sweet, sugary caramel sauce!",
  "peppy.dialogue.kiss.success/5": "Oh my gosh! You, %1$s, are the reigning champion of kissing! I'm blown away!",
  "peppy.dialogue.kiss.success/6": "Move over, Romeo! %1$s's kisses are like a magical explosion of joy and giggles!",
  "peppy.dialogue.kiss.fail/1": "Let's find a secret spot where nobody can interrupt our lovey-dovey moments!",
  "peppy.dialogue.kiss.fail/2": "Oh, sweetie pie, that kiss was simply precious... but I know we can do even better!",
  "peppy.dialogue.kiss.fail/3": "Oh my goodness, Ash from down the lane kisses like a dreamboat compared to this! Let's step up our game, darling!",
  "peppy.dialogue.kiss.fail/4": "Darling, let's indulge in some minty freshness together, shall we? It'll take our kisses to a whole new level of perfection!",
  "peppy.dialogue.kiss.fail/5": "Oh, how charming! Thank you for that slightly awkward, yet endearing attempt at a kiss. You always know how to make my heart flutter!",
  "peppy.dialogue.kiss.fail/6": "Oh, my lively little lovebird, let's save the smooches for later, shall we? I've got a few errands to run, and I'd rather not be tackled with affection right now!",

  "peppy.dialogue.chat.success/1": "Wow, cookies and milk are like the ultimate snack combo, don't you think?",
  "peppy.dialogue.chat.success/2": "Isn't the weather just fabulous today? I'm loving every second of it!",
  "peppy.dialogue.chat.success/3": "Hey there! I'm feeling great, despite stubbing my toe this morning. Can't let it ruin my day!",
  "peppy.dialogue.chat.success/4": "You know what they say, an apple a day keeps those pesky zombies at bay!",
  "peppy.dialogue.chat.success/5": "I've got big dreams, like building my very own village, but sometimes my laziness gets the best of me.",
  "peppy.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter%, rocking some fancy Diamond armor like a boss!",
  "peppy.dialogue.chat.success/7": "Oh my goodness, you won't believe what %Supporter% shared with me. They stumbled upon a chest jam-packed with diamonds!",
  "peppy.dialogue.chat.success/8": "The weather has been absolutely remarkable, don't you think? I can't help but smile whenever the sun is shining.",
  "peppy.dialogue.chat.success/9": "I've been living in this village forever, and I still can't wrap my head around all these creepy spiders and goblins. What's the deal with them, anyway?",
  "peppy.dialogue.chat.success/10": "I'm quite curious myself about what happened to %Supporter%. They embarked on an adventure about a year ago, and I wonder where they are now.",
  "peppy.dialogue.chat.success/12": "Hold on, have you heard the latest gossip about %Supporter%? Brace yourself for some wild news!",
  "peppy.dialogue.chat.success/13": "I've been super busy lately, but I've been seriously considering adopting one of those adorable stray cats wandering around. They're just too cute to resist!",
  "peppy.dialogue.chat.success/14": "You know what? I've been meaning to give my house a total makeover. It's time to spruce things up a bit, even if my laziness tries to get in the way!",
  "peppy.dialogue.chat.success/15": "One day, I hope to have a bunch of little ones running around. Just need to find my perfect partner in crime first!",
  "peppy.dialogue.chat.success/16": "I can't help but wonder what life would be like if I chose to live in that other village. The grass is always greener, right?",
  "peppy.dialogue.chat.success/17": "Ahh, sometimes I get all nostalgic and miss my childhood. Those were the days filled with countless unforgettable memories.",
  "peppy.dialogue.chat.success/18": "It just hit me that I haven't spoken to my parents in ages. I really should make an effort to visit them soon.",
  "peppy.dialogue.chat.success/19": "I've been itching to visit the neighboring village for a while now. I've got some long-lost friends there that I'm dying to see again!",
  "peppy.dialogue.chat.success/20": "Have you ever dreamt about a heavenly creation",
  "peppy.dialogue.chat.fail/1": "Oh my gosh, did you seriously just say that? Hilarious!",
  "peppy.dialogue.chat.fail/2": "Wow, I can't even believe it exploded on its own. That's wild!",
  "peppy.dialogue.chat.fail/3": "You know what? You're not just cool, you're the coolest!",
  "peppy.dialogue.chat.fail/4": "Show off much? But hey, I guess you have something to show off about.",
  "peppy.dialogue.chat.fail/5": "Ugh, go away! Wait, are you dressed like you're from the future? So cool!",
  "peppy.dialogue.chat.fail/6": "That is such a silly thing to talk about, but hey, let's do it!",
  "peppy.dialogue.chat.fail/7": "Why are you talking to me again? I mean, I'm flattered, but why?!",
  "peppy.dialogue.chat.fail/8": "Huh? Did you say something? Sorry, I was lost in my own fabulous thoughts.",
  "peppy.dialogue.chat.fail/9": "Excuse me? Oh, sorry, I was too busy being amazing to pay attention.",
  "peppy.dialogue.chat.fail/10": "What is wrong with you? Why are you talking about this? But hey, let's discuss it with enthusiasm!",
  "peppy.dialogue.chat.fail/11": "I've heard amazing things about you, and I totally see why everyone thinks that!",
  "peppy.dialogue.chat.fail/12": "Not even zombies will talk to you... because you're too cool for them!",
  "peppy.dialogue.chat.fail/13": "You're as likable as a witch with a heart of gold!",
  "peppy.dialogue.chat.fail/14": "Don't talk to me or I will call the guards to move you away from me... because we'll have so much fun together!",
  "peppy.dialogue.chat.fail/15": "Huh? Oh, sorry, your conversation bored me... just kidding, let's keep talking!",
  "peppy.dialogue.chat.fail/16": "Are you done talking? Oh no, please keep going! I'm all ears.",
  "peppy.dialogue.chat.fail/17": "I wonder if anyone will miss your babbling when your mouth suddenly \"stays shut\" forever... just kidding, I'll miss it!",
  "peppy.dialogue.chat.fail/18": "I'd rather stare at a pig's rear than talk to you... because that sounds like a fun time!",
  "peppy.dialogue.chat.fail/19": "Are you finished talking to me? Oh, come on, keep going! I'm hanging on your every word.",
  "peppy.dialogue.chat.fail/20": "What, you believe the earth is round? What do you mean round? No corners? You seriously believe that? That's amazing!",
  "peppy.dialogue.chat.fail/21": "Hold your horses! You genuinely think the earth is round? Ha! Not buying it, my friend! Are you suggesting it's like a big sphere with no corners? That's pure madness!",

  "peppy.dialogue.story.success/1": "Oh my gosh, no way! That's absolutely mind-blowing!",
  "peppy.dialogue.story.success/2": "Oh, if only I had the guts to face off against a creeper. You're so courageous!",
  "peppy.dialogue.story.success/3": "Wow, that story was absolutely amazing! Is it an original masterpiece?",
  "peppy.dialogue.story.success/4": "Hold up, hold up! You're telling me all of that craziness went down just yesterday? Unbelievable!",
  "peppy.dialogue.story.success/5": "No way! I was practically in the same vicinity yesterday and I didn't hear a peep about it. How did I miss out?",
  "peppy.dialogue.story.success/6": "Haha, that's so typical of %Supporter%! They're beyond incredible, just the coolest person ever.",
  "peppy.dialogue.story.success/7": "I've lost count of how many times I've heard the epic Legend of %Supporter%. Seriously, tell me again right now!",
  "peppy.dialogue.story.success/8": "Oh my goodness, so that's the secret behind uncovering your very first diamond? Fascinating!",
  "peppy.dialogue.story.success/9": "You absolutely have to come over later! I'm dying to hear more tales from your incredible adventures.",
  "peppy.dialogue.story.fail/1": "Well, golly gee! That's my dear ol' mother you're gabbin' about.",
  "peppy.dialogue.story.fail/2": "Woohoo! This is the juicy gossip the whole village is buzzin' about, I tell ya!",
  "peppy.dialogue.story.fail/3": "Huh? I'm a bit slow on the uptake here, folks...",
  "peppy.dialogue.story.fail/4": "Oh my stars! You're absolutely horrid! Creepers have feelings, ya know?",
  "peppy.dialogue.story.fail/5": "Oh, for the love of diamonds! How could you heartlessly slay a poor, innocent sheep?",
  "peppy.dialogue.story.fail/6": "*snort* Huh? Oh, sorry! I was just catchin' some z's there, folks!",
  "peppy.dialogue.story.fail/7": "Gee willikers, was that an epic fail or what? Totally not worth my precious time!",
  "peppy.dialogue.story.fail/8": "Yawnarama! Talk about a snoozefest, am I right?",
  "peppy.dialogue.story.fail/9": "You must be positively bonkers, and I ain't talkin' 'bout the good kind of bonkers, buddy!",
  "peppy.dialogue.story.fail/10": "I reckon I fail to see how that little escapade was even remotely good, folks.",

  "peppy.dialogue.flirt.success/1": "You're incredibly brave, like, seriously!",
  "peppy.dialogue.flirt.success/2": "Oh my gosh, you're, like, the cutest thing ever!",
  "peppy.dialogue.flirt.success/3": "Seriously? No way! I can't even handle your compliments!",
  "peppy.dialogue.flirt.success/4": "Wowzers, you're making my heart skip a beat!",
  "peppy.dialogue.flirt.success/5": "I can't even handle how absolutely adorable you are! I'm melting!",
  "peppy.dialogue.flirt.success/6": "How are you always so stunning? It's like you have a magical charm or something.",
  "peppy.dialogue.flirt.success/7": "Oh my goodness, stop it already! You're making my cheeks turn as red as a rose!",
  "peppy.dialogue.flirt.fail/1": "If you truly believe that, then show me your moves!",
  "peppy.dialogue.flirt.fail/2": "Oh, sweetie... But didn't you say the exact same thing to the blacksmith?",
  "peppy.dialogue.flirt.fail/3": "Not even in your wildest dreams, darling!",
  "peppy.dialogue.flirt.fail/4": "Like, seriously? Is that the best you got?",
  "peppy.dialogue.flirt.fail/5": "Oh honey, even a creeper has more charm than you!",
  "peppy.dialogue.flirt.fail/6": "Nah, sorry, but that's a hard pass from me.",
  "peppy.dialogue.flirt.fail/7": "Oh my goodness, please stop with that look and never utter those words again.",

  "peppy.dialogue.joke.creative.success/1": "*Giggles* That's absolutely hilarious!",
  "peppy.dialogue.joke.creative.success/2": "Oh my goodness, that's so funny!",
  "peppy.dialogue.joke.creative.success/3": "I can't stop laughing, that's the funniest thing ever!",
  "peppy.dialogue.joke.creative.success/4": "You're a comedic genius, you're even funnier than %Supporter%!",
  "peppy.dialogue.joke.creative.success/5": "Hahaha! Oh my gosh, you're incredibly funny! You should totally pursue a career in comedy!",
  "peppy.dialogue.joke.creative.success/6": "HAHAHA! That joke just made my day, it's the best one I've heard in ages!",
  "peppy.dialogue.joke.creative.success/7": "Teehee! You're definitely the funniest person I know, even funnier than Ash!",
  "peppy.dialogue.joke.creative.success/8": "Ahah! That's seriously hilarious, you've got some amazing comedic talent!",
  "peppy.dialogue.joke.creative.failed/1": "Oh, come on! Lighten up and let's share a good laugh!",
  "peppy.dialogue.joke.creative.failed/2": "Hahaha, nice try! But you'll have to come up with something better than that.",
  "peppy.dialogue.joke.creative.failed/3": "Oh, sweetie, your sense of humor needs a little boost. Keep practicing!",
  "peppy.dialogue.joke.creative.failed/4": "Woah, did you actually think that joke would land? Bless your heart!",
  "peppy.dialogue.joke.creative.failed/5": "Well, that was quite the attempt at humor. Maybe you'll nail it next time!",
  "peppy.dialogue.joke.creative.failed/6": "Hahaha, oh, you crack me up! Not really, but it's the thought that counts.",
  "peppy.dialogue.joke.creative.failed/7": "Seriously, why would anyone find that funny? Stick to something you're good at, darling.",
  "peppy.dialogue.joke.creative.failed/8": "You know, Ash's jokes are like fireworks compared to yours. Better luck next time, champ!",

  "peppy.dialogue.procreate_engaged/1": "Oh, my dear, I simply would be over the moon once we've tied the knot. It's like stepping into a cozy nest of love and security!",
  "peppy.dialogue.procreate_engaged/2": "You know what would make my heart sing? Embracing the joy of parenthood, but only after we've sealed our love with a bond that's unbreakable. It's all about building a solid foundation, my darling!",

  "peppy.dialogue.shake_hand.success/1": "Your handshake is absolutely delightful!",
  "peppy.dialogue.shake_hand.success/2": "Your grip is so energetic, it's like a burst of sunshine!",
  "peppy.dialogue.shake_hand.success/3": "Oh my goodness, your handshake is simply marvelous!",
  "peppy.dialogue.shake_hand.success/4": "Hello, good sir/madam!",
  "peppy.dialogue.shake_hand.success/5": "Well, well, well, look who we have here! A delightful soul, I presume!",
  "peppy.dialogue.shake_hand.fail/1": "Oh my gosh! Are you serious? After you went all ninja on that poor cow?",
  "peppy.dialogue.shake_hand.fail/2": "Nah, it's cool. No worries!",
  "peppy.dialogue.shake_hand.fail/3": "Hey there, no need to be all formal with me! We're practically besties!",
  "peppy.dialogue.shake_hand.fail/4": "Whoa, hold up! This isn't your typical style, my friend!",
  "peppy.dialogue.shake_hand.fail/5": "Haha, no thanks! I'll pass on the whole \"go away\" vibe you're giving off right now.",

  "peppy.dialogue.main.morning/1": "Top o' the mornin' to ya!",
  "peppy.dialogue.main.morning/2": "Rise and shine, sunshine! Ready to conquer the day?",
  "peppy.dialogue.main.morning/3": "Gosh, I'm bursting with energy today, how 'bout you?",
  "peppy.dialogue.main.morning/5": "Yikes, rough night? You don't look your usual fabulous self.",
  "peppy.dialogue.main.morning/6": "Good morning, my supercharged friend! Brace yourself for an epic day!",
  "peppy.dialogue.main.morning/7": "Did you dream of unicorns and rainbows last night? You're positively beaming!",
  "peppy.dialogue.main.morning/8": "Rise and sparkle, sleepyhead!",
  "peppy.dialogue.main.morning/9": "Oh, what a glorious morning! I can feel the productivity vibes in the air!",
  "peppy.dialogue.main.morning/10": "Hmm, today calls for a gentle pace. Gotta take care of this fabulous self, ya know?",
  "peppy.dialogue.main.morning/11": "My schedule is jam-packed today, but I'll tackle it like a superhero! No time for yawns!",
  "peppy.dialogue.main.morning/12": "Ah, I had the most refreshing slumber. Time to go big or go home today, perhaps? Let's see!",
  "peppy.dialogue.main.evening/1": "Hey there, evening is here and I'm all pumped up!",
  "peppy.dialogue.main.evening/2": "Can you believe how quickly the day zipped by? What did you get up to?",
  "peppy.dialogue.main.evening/3": "Woohoo, another productive day in the books! Work hard, play harder, am I right?",
  "peppy.dialogue.main.evening/4": "Time flies when you're juggling a million things, doesn't it? So much to conquer, so little time!",
  "peppy.dialogue.main.evening/5": "Time to dash home and whip up a scrumptious dinner. Gotta fuel up for more adventures!",
  "peppy.dialogue.main.evening/6": "Oopsie, got a little sidetracked today. Time to make every second count tomorrow!",
  "peppy.dialogue.main.evening/7": "Whew, I definitely need a power nap soon. The morning was a wild rollercoaster ride!",
  "peppy.dialogue.main.evening/8": "Safety first, my friend! The night is when surprises come knocking. I'll be staying indoors tonight!",
  "peppy.dialogue.main.evening/9": "Guess who bumped into the friendliest butcher ever? Gotta catch up with you later, gotta cook up a storm!",
  "peppy.dialogue.main.night/1": "Oh wow, burning the midnight oil, huh? Impressive!",
  "peppy.dialogue.main.night/2": "Who needs sleep when there's so much excitement at night? I'm all in!",
  "peppy.dialogue.main.night/3": "Hey, fellow night explorer! Let's stick together and conquer the darkness!",
  "peppy.dialogue.main.night/4": "Our brave guards keep us safe, but man, the night sure gives me the creeps sometimes!",
  "peppy.dialogue.main.night/5": "Ah, the tranquility of the night envelops me, bringing bliss to my weary soul.",
  "peppy.dialogue.main.night/6": "The daytime hustle and bustle can't compare to the charm of a moonlit stroll, don't you think?",
  "peppy.dialogue.main.night/7": "Woah, I'm feeling drained. Guess I'll have to recharge and take it easy tomorrow.",
  "peppy.dialogue.main.night/8": "Can't wait to snuggle up in my cozy bed and drift off into dreamland.",
  "peppy.dialogue.main.night/9": "Hey, bedtime's calling, my friend! Gotta rest up for the big day ahead.",
  "peppy.dialogue.main.night/10": "Hey there, sleepyhead! Time to hit the hay and recharge those batteries. Trust me, tomorrow's gonna be a whirlwind of excitement waiting for you!",

  "peppy.dialogue.greet.mayor/1": "Hey there, Mayor! How's the day treating you?",
  "peppy.dialogue.greet.mayor/2": "Wishing you an absolutely fantastic day, Mayor! Keep rocking it!",
  "peppy.dialogue.greet.monarch/1": "Oh, hail to the royal presence!",
  "peppy.dialogue.greet.monarch/2": "Greetings, oh majestic one!",

  "peppy.dialogue.busy/1": "Wow, we sure chatted up a storm today! But duty calls, and I must return to the grind.",
  "peppy.dialogue.busy/2": "Oh, you're just too charming! But alas, my work awaits and I mustn't keep it waiting till sunset.",
  "peppy.dialogue.busy/3": "My, oh my! I'm in a bit of a frenzy at the moment. Can we catch up when the chaos subsides?",
  "peppy.dialogue.busy/4": "Apologies, my friend, but the demands of my work are pressing. Let's reconvene when I'm free.",
  "peppy.dialogue.busy/5": "Oh dear, I left my furnace unattended! We'll need to continue this delightful conversation another time!",
  "peppy.dialogue.goaway/1": "Oh, hey there! Why don't you go find something more fun to do?",
  "peppy.dialogue.goaway/2": "So sorry, %1$s, but I'm a bit busy at the moment. Catch you later!",
  "peppy.dialogue.goaway/3": "How about you go annoy someone else for a change? Thanks!",
  "peppy.dialogue.goaway/4": "Oh, dear me! I kindly request that you take your leave, you scoundrel!",
  "peppy.dialogue.goaway/5": "Oh, my dear friend, please find another place to explore!",

  "peppy.dialogue.greet/1": "Heya! How's it hanging today?",
  "peppy.dialogue.greet/2": "Hey %1$s! How's life treating you?",
  "peppy.dialogue.greet/3": "Well, hello there! What brings you here today?",
  "peppy.dialogue.greet/4": "Look at you, all bright and cheery! How's your day going, champ?",
  "peppy.dialogue.greet/5": "Well, hello %1$s! It's such a pleasure to see your lovely face!",
  "peppy.dialogue.greet/6": "Ohai there! How's the world treating you today?",
  "peppy.dialogue.greet/7": "Nice to see your fabulous self again!",
  "peppy.dialogue.greet/8": "Hello, hello! How's the world treating you today, darling?",
  "peppy.dialogue.greet/9": "Hey there! I'm so glad you graced us with your presence today! How are you holding up?",

  "peppy.dialogue.greet.negative/1": "Oh, hey there! It's you! What a delightful surprise! *giggles*",
  "peppy.dialogue.greet.negative/2": "Oh my goodness, you're back! I can't believe my luck! *squeals*",
  "peppy.dialogue.greet.negative/3": "Hmm! Well, well, well, look who it is! *cheerful tone*",
  "peppy.dialogue.greet.negative/4": "Oh, it's you! How wonderful! I was hoping to see you today! *beaming smile*",
  "peppy.dialogue.greet.negative/5": "Well, if it isn't my absolute favorite person in the world! What a joyous occasion! *jumps with excitement*",

  "peppy.dialogue.greet.success/1": "Awesome sauce, that's music to my ears!",
  "peppy.dialogue.greet.success/2": "Woo-hoo, doing fantastic? That's absolutely fabulous!",
  "peppy.dialogue.greet.success/3": "Oh, happy dance time! That's like sunshine on a rainy day!",
  "peppy.dialogue.greet.success/4": "Oh my gosh, I'm over the moon to hear that!",
  "peppy.dialogue.greet.success/5": "Huzzah, that's like finding a diamond in a mineshaft, pure gold!",
  "peppy.dialogue.greet.fail/1": "Oh, well, that's a bit of a bummer.",
  "peppy.dialogue.greet.fail/2": "Woohoo! I'm thrilled to hear that!",
  "peppy.dialogue.greet.fail/3": "Oh, well, if that's the best you can do, I'll take it!",
  "peppy.dialogue.greet.fail/4": "Seriously? Well, I suppose I can roll with that.",
  "peppy.dialogue.greet.fail/5": "Oh, no worries! I'll make the best of it.",

  "peppy.dialogue.apologize.success/1": "No worries, mistakes are just part of the adventure!",
  "peppy.dialogue.apologize.success/2": "Oh, don't sweat it! Just keep your eyes peeled next time, champ!",
  "peppy.dialogue.apologize.success/3": "Alrighty then, we can let that one slide. But hey, stay on your toes, okay?",
  "peppy.dialogue.apologize.success/4": "No biggie! We all stumble sometimes. Shake it off and carry on!",
  "peppy.dialogue.apologize.success/5": "Hey, it's all good, my friend! Go forth and conquer, without any worries!",
  "peppy.dialogue.apologize.fail/1": "Oh, sorry, but I'm not really feeling your vibe right now. Can you give me some space?",
  "peppy.dialogue.apologize.fail/2": "Oopsie-doodle! Looks like you accidentally bumped into me. No hard feelings, right?",
  "peppy.dialogue.apologize.fail/3": "Haha, nice try! But this villager's got some serious moves. I won't be falling for that one, my friend.",
  "peppy.dialogue.apologize.fail/4": "Ouchie-wouchie! That hurt a bit, but hey, let's skip the apologies and focus on making this day amazing!",
  "peppy.dialogue.apologize.fail/5": "Ah, nope-a-doodle! I appreciate the thought, but I'm not quite ready to accept any apologies just yet. Better luck next time!",

  "peppy.dialogue.location.failed/1": "Oh, bummer! I haven't heard a peep about any cool new spots.",
  "peppy.dialogue.location.failed/2": "So sorry, but nada! I don't have any juicy intel on exciting places.",
  "peppy.dialogue.location.failed/3": "Nope, sorry, not a clue! We villagers are too busy doing our own fun stuff to go hunting for spooky ruins like you adventurers.",
  "peppy.dialogue.location.forgot/1": "Oopsie daisy! I stumbled upon this super rad spot, but my brain totally blanked when it came to marking it on the map. My bad, sorry!",
  "peppy.dialogue.location.forgot/2": "Hey there, adventurer! So, like, I was on this epic quest for something mind-blowingly cool, and... ugh, it's on the tip of my tongue! Gah, why didn't I jot it down? My apologies for the forgetfulness, though.",
  "peppy.dialogue.location.forgot/3": "Guess what? I totally had a brainwave about a totally awesome spot, but my memory decided to play tricks on me! Welp, sorry for the forgetfulness, buddy.",
  "peppy.dialogue.location.igloo/1": "Wow, guess what I stumbled upon? An incredible igloo at %2$s! Can you believe people actually live in houses made of snow? It's so chilly, I can't even imagine!",
  "peppy.dialogue.location.igloo/2": "Oh, you won't believe the gossip I heard! There's this abandoned igloo at %2$s, and no one seems to live there anymore. But here's the juicy part - rumor has it, that place might be haunted! I mean, who wouldn't be scared walking past it with all those eerie noises?",
  "peppy.dialogue.location.igloo/3": "Hold on to your hats, folks! I've got some thrilling news. There's this old igloo at %2$s, made entirely out of ice. Can you believe it? It's like a frozen wonderland! But here's the thing, it's been abandoned for ages. Such a shame, really.",
  "peppy.dialogue.location.pyramid/1": "Oh my gosh, guess what? There's a totally rad pyramid over at %2$s!",
  "peppy.dialogue.location.pyramid/2": "Hey there, fellow explorer! You've gotta check out this epic pyramid at %2$s. Rumor has it, there's some seriously awesome treasure waiting for someone as brave and adventurous as you!",
  "peppy.dialogue.location.pyramid/3": "So, like, word on the street is there's this super mysterious pyramid at %2$s. It's been ages since this one adventurer went to check it out. You should totally give it a shot, but stay on your toes, okay? Safety first!",
  "peppy.dialogue.location.ruined_portal_desert/1": "Oh my goodness, have you seen that totally wrecked portal over at %2$s? It's like a desert disaster zone!",
  "peppy.dialogue.location.ruined_portal_swamp/1": "Hold on tight, because I've got some wild news! There's a completely trashed portal sitting pretty in the swamp at %2$s. I bet those Nether invaders are kicking themselves for landing in this dump!",
  "peppy.dialogue.location.ruined_portal/1": "Woohoo! Guess what? There's a totally wicked destroyed portal at %2$s! It's like the aftermath of a crazy Nether invasion or something. Talk about epic!",
  "peppy.dialogue.location.ruined_portal/2": "Hey there, adventurer! You won't believe what I just heard. Head on over to %2$s, and you'll stumble upon this insanely spooky ruined nether portal. I mean, it's giving me the chills just thinking about it, but hey, it should be safe... I hope. Oh, and watch out for that bubbling magma, seriously.",
  "peppy.dialogue.location.ruined_portal/3": "Oh my gosh, you have to check out %2$s! It's like this ancient ruins place. Can you believe it used to be a nether portal? Yeah, I know, crazy, right? The local cleric even mentioned rumors of hidden treasure, but honestly, nobody in their right mind wants to go anywhere near that spooky spot. Can't say I blame them!",
  "peppy.dialogue.location.ruined_portal_mountain/1": "Oh my gosh, you won't believe what I just found! There's this totally wrecked portal up at %2$s in the mountains!",
  "peppy.dialogue.location.mansion/1": "Oh my gosh, have you heard about that super spooky mansion over at %2$s? It's like, totally owned by those creepy illagers! If you're smart, you'll stay far, far away from that cursed place. Trust me, your life will thank you!",
  "peppy.dialogue.location.mansion/2": "Okay, so brace yourself for this wild news - there's this massive, like, ginormous mansion at %2$s and get this, it's actually owned by those scary illagers! I mean, seriously, we should seriously consider moving the village to, like, the other side of the world! I'm just sayin', it's better to be safe than sorry, am I right? Ha!",
  "peppy.dialogue.location.monument/1": "Hey there, have you heard about the totally epic sunken castle at %2$s? It's like, guarded by these crazy sea monsters, so you better stay away, dude. Trust me, it's gnarly!",
  "peppy.dialogue.location.monument/2": "Whoa, check it out, dude! I've heard these insane stories about ancient ruins way down in the ocean at %2$s. Like, there might be some rad treasure down there, but be warned, it's gonna be a wild and risky adventure! Are you up for it, adventurer?",
  "peppy.dialogue.location.shipwreck/1": "Oh my gosh, guess what?! I stumbled upon the most incredible sunken ship at %2$s! It's seriously amazing! This ship, oh wow, it used to be owned by the Eastern Alliance Company. Can you even believe it?",
  "peppy.dialogue.location.shipwreck/2": "Hey there! Have you heard? Some lucky fishermen recently discovered a shipwreck over at %2$s! Can you imagine the excitement? Who knows, there might be some hidden treasure just waiting to be found! Wouldn't that be absolutely mind-blowing?",
  "peppy.dialogue.location.shipwreck_beached/1": "Hey there! Guess what? There's this totally awesome ruined ship just waiting to be explored at %2$s! Seriously, you can't miss it, it's right there on the beach!",
  "peppy.dialogue.location.shipwreck_beached/2": "Oh my gosh, you have to check this out! Head over to %2$s and prepare to be amazed because there's a ship just chilling on the shore, totally wrecked! Can you believe it? I wonder how it even ended up there, though... Such a mystery!",
  "peppy.dialogue.location.village_desert/1": "Hey there, fellow adventurer! Grab your sunscreen and head on over to %2$s, where you'll find the most delightful village ever, nestled in the midst of a scorching desert!",
  "peppy.dialogue.location.village_taiga/1": "Oh my gosh, have you heard about the incredible village at %2$s? It's seriously the cutest thing ever, nestled right in the heart of a stunning taiga biome!",
  "peppy.dialogue.location.village_taiga/2": "Let me tell you, %2$s is where all the magic happens! There's this fantastic village deep within the enchanting taiga biome. Trust me, it's a sight you won't want to miss!",
  "peppy.dialogue.location.village_snowy/1": "Oh my gosh, you won't believe it! There's like, another village over at %2$s! But let me warn you, it's like, super chilly there. Brrr!",
  "peppy.dialogue.location.village_snowy/2": "Guess what? There's this totally charming village over at %2$s in the snowy plains! The people there are seriously amazing, but man, it's freezing cold! Like, seriously, bundle up!",
  "peppy.dialogue.location.village_plains/1": "Oh boy, have you seen the delightful village over at %2$s? It's an absolute gem!",
  "peppy.dialogue.location.village_plains/2": "You won't believe your eyes when you stumble upon the most charming village in the heart of the plains at %2$s! It's like a fairytale come to life!",
  "peppy.dialogue.location.village_savanna/1": "Hey, did you know there's another village over at %2$s? It's like a sauna over there! So toasty!",
  "peppy.dialogue.location.village_savanna/2": "Oh my goodness, have you been to the village in the savanna at %2$s? The people there are just fantastic! So warm and welcoming, you'll love it!",
  "peppy.dialogue.location.swamp_hut/1": "Woohoo! Have you heard about the wicked witch who's taken up residence in the swamp at %2$s? I mean, I wouldn't go near that place if I were you, but it does make for a thrilling story!",
  "peppy.dialogue.location.swamp_hut/2": "Hey, hey, guess what? There's this super creepy hut in %2$s, and you know who lives there? A witch! Yeah, seriously, I'd steer clear of that place if I were you. No need for witchy encounters, am I right?",
  "peppy.dialogue.location.mineshaft/1": "Hey there! So, we used to have this totally rad mine here, but, like, there was this epic accident and now it's, like, closed and stuff. But hey, if you're up for an adventure, it should be around %2$s!",
  "peppy.dialogue.location.mineshaft/2": "Oh my gosh, yes! There was this super cool mine we once owned, right at %2$s. But, like, major bummer, it got totally infested with monsters and it's, like, totally unsafe now. So, like, proceed with caution if you decide to venture down there. Safety first, amirite?",
  "peppy.dialogue.location.jungle_pyramid/1": "Oh wow, have you heard about the incredible temple at %2$s? It's like stepping into a time machine! But hey, just a friendly tip, it might be a good idea to steer clear of it if you're not into heart-pounding adventures and ancient booby traps. Safety first, you know!",
  "peppy.dialogue.location.jungle_pyramid/2": "Hey there, adventurer! I've got some juicy gossip for you - %2$s in the jungle is hiding the most mind-blowing ancient ruins! And let me tell you, those traps are still in tip-top shape, just waiting to give you a run for your money. Our ancestors must have been too chicken to tackle them, but I know you've got what it takes! Best of luck, superstar!",
  "peppy.dialogue.location.pillager_outpost/1": "Hey there, guess what? There's a bunch of those pesky Pillagers over at %2$s. Can you believe it? They think they can just set up shop right next to us. But hey, let's stay positive, maybe they won't attack us too soon. Fingers crossed!",
  "peppy.dialogue.location.pillager_outpost/2": "Oh my goodness, you won't believe what I heard! There's this outpost run by those dastardly pillagers at %2$s, and let me tell you, they are a nightmare. They don't let us sleep at night with all their racket. So, if you're thinking of going anywhere near there, be super duper careful. They shoot first and ask questions later, I tell ya!",
  "peppy.dialogue.location.pillager_outpost/3": "Hey there, adventurer! I've got some interesting news for you. If you happen to head to %2$s, you'll stumble upon an outpost that's infested with those annoying pillagers. But don't let that get you down! If you manage to defeat those wretched villains, who knows what kind of amazing loot you'll find. Trust me, the entire village would be over the moon if someone like you took care of those troublemakers. Good luck!",
  "peppy.dialogue.location.ancient_city/0": "Woohoo! You won't believe the crazy noises I heard at %2$s! It was like a wild concert happening deep underground!",
  "peppy.dialogue.location.ancient_city/1": "Oh my gosh, I have this totally awesome theory! I bet there's something super cool hidden way, way beneath the ground at %2$s! Like, a secret treasure or something!",
  "peppy.dialogue.location.ancient_city/3": "Hey, did you hear the legends about %2$s? It's said to be an ancient city! And guess what? I didn't see anything above ground, so it must be all hidden underground! Time to go on a thrilling archaeological adventure, don't you think?",

  "peppy.dialogue.joke.monster.success/1": "Woohoo! That Skelly got a taste of justice, baby!",
  "peppy.dialogue.joke.monster.success/2": "Oh my goodness, can you believe that zombie actually thought a shovel could take you down? Hahaha, what a riot!",
  "peppy.dialogue.joke.monster.success/3": "You totally owned that spider, like a boss! Haha, keep the arachnids trembling!",
  "peppy.dialogue.joke.monster.success/4": "Whoa, hold up! You managed to make a skeleton take down a creeper? That's mind-blowing, haha! Your skills are out of this world!",
  "peppy.dialogue.joke.monster.success/5": "Hahah! Geez, those cave spiders must have skipped spider school - they didn't stand a chance against you, superhero!",
  "peppy.dialogue.joke.monster.failed/1": "Can you believe it? Skeletons, those bone-rattling fellows, actually have feelings too! Outrageous!",
  "peppy.dialogue.joke.monster.failed/2": "Seriously, who still cracks jokes about creepers and their explosive tendencies? It's like living in the Stone Age of humor!",
  "peppy.dialogue.joke.monster.failed/3": "You know, zombies and skeletons were once just like you and me. It's easy to forget that they had hopes, dreams, and an insatiable appetite... for brains!",
  "peppy.dialogue.joke.monster.failed/4": "Oh my goodness, guess what happened! An enderman took a little dive into some water. Talk about groundbreaking entertainment right there! *rolls eyes*",
  "peppy.dialogue.joke.monster.failed/5": "You won't believe it, but I've heard people making silverfish-on-the-toilet jokes before. It's so rare, like finding a double-headed chicken, except it's happened to me twice already! What are the odds?",

  "peppy.dialogue.joke.animal.success/1": "Oh my goodness, what a woolly catastrophe for that poor sheep! But hey, laughter is the best medicine, right?",
  "peppy.dialogue.joke.animal.success/2": "Can you believe it? The wolf actually developed a soft spot for the sheep! Talk about an unexpected romance!",
  "peppy.dialogue.joke.animal.success/3": "Haha, that's absolutely hilarious! Chickens pulling off shenanigans like that? Who knew they had such comedic talent!",
  "peppy.dialogue.joke.animal.success/4": "Oh my gosh, that's ridiculously silly and I am totally here for it! Laughter is contagious, and I'm catching a serious case of the giggles!",
  "peppy.dialogue.joke.animal.success/5": "Isn't it amazing? Cows are like the magical milk fountains of Minecraft! No matter how much you milk them, they just keep on giving! It's udderly fantastic!",
  "peppy.dialogue.joke.animal.failed/1": "Oh my gosh, that sheep must've been like, \"What the baa?\" That's just baa-d humor!",
  "peppy.dialogue.joke.animal.failed/2": "Excuse me, but my pig is a total superstar! Don't you dare diss their fabulousness!",
  "peppy.dialogue.joke.animal.failed/3": "Seriously? That's like the lowest level of humor ever. You can do way better!",
  "peppy.dialogue.joke.animal.failed/4": "Ugh, you're just jelly of the cow's perfectly groomed eyebrows. Don't hate, appreciate!",
  "peppy.dialogue.joke.animal.failed/5": "Oh my gosh, did you see that cow's eyebrows? They were on fleek!",

  "peppy.dialogue.flirt.slap/1": "Oh my goodness, pardon me!",
  "peppy.dialogue.flirt.slap/2": "Did a charming enchantress teach you the art of flirting?!",
  "peppy.dialogue.kiss.slap/1": "Oh my goodness, I can't believe you did that!",
  "peppy.dialogue.kiss.slap/2": "Give it another shot, and the next one's going to be a real showstopper!",

  "peppy.dialogue.chat.plains/1": "Aren't the plains just amazing? I can't get enough of this place! Maybe someday I'll venture out and explore the world, but for now, I'm perfectly content right here.",
  "peppy.dialogue.chat.plains/2": "There's something truly magical about the plains, don't you think? It may not have the same thrills as other biomes, but it has a charm that's unmatched. I wouldn't trade it for anything.",
  "peppy.dialogue.chat.plains/3": "Oh, have you ever seen the plains at night? It's like stepping into a dream! The beauty is simply breathtaking, and the tranquility it brings is like a lullaby for the soul.",
  "peppy.dialogue.chat.plains/4": "Nights like these, I just want to lie down, gaze at the stars, and let my mind wander. It's a moment of serenity amidst the hustle and bustle of Minecraft life.",
  "peppy.dialogue.chat.plains/5": "Ah, the air in the plains! So crisp, so invigorating! It's like taking a big gulp of joy with each breath. Trust me, it's even better than the refreshing taiga air!",
  "peppy.dialogue.chat.plains/6": "Sure, the plains may not be as flashy as some other biomes, but that's what makes it special! It's a place of simplicity and purity, where true beauty lies in the little things.",
  "peppy.dialogue.chat.plains/7": "Whenever the weather is like this, it takes me back to my childhood days. I used to frolic in the fields, picking wildflowers and daydreaming about love. Ah, those were the days!",
  "peppy.dialogue.chat.plains/8": "Rise and shine, my friend! The morning sunrise in the plains is an absolute masterpiece! The colors, the warmth, it's like nature's way of saying, \"Good morning, world!\" You simply must witness it at least once in your lifetime.",
  "peppy.dialogue.chat.savanna/1": "Wow, it's scorching out here in the savanna! But hey, at least we never have to deal with that pesky winter.",
  "peppy.dialogue.chat.savanna/2": "Ugh, those llamas can be a bit annoying sometimes, but I'm still totally vibing with this place.",
  "peppy.dialogue.chat.savanna/3": "Can we talk about the incredible architecture in the savanna? It's like the coolest thing ever, and that's why I chose to call this place home.",
  "peppy.dialogue.chat.savanna/4": "Oh, you think the savanna biome is plain and generic? Well, let me tell you, it's got some seriously awesome perks if you know where to look!",
  "peppy.dialogue.chat.savanna/5": "Forget the desert villages, we've got something they don't",
  "peppy.dialogue.chat.savanna/6": "The hills and terrains in the savanna are absolutely mind-blowing! It's like Mother Nature went all out to make this place a sight to behold.",
  "peppy.dialogue.chat.savanna/7": "Whew, when it's scorching hot, thank goodness for those amazing acacia trees providing some much-needed shade. It's like my own personal oasis in this crazy heat!",
  "peppy.dialogue.chat.savanna/8": "Let me tell you a secret",
  "peppy.dialogue.chat.taiga/1": "The woods are absolutely amazing! They give us everything we need - building materials, firewood, and endless possibilities for adventure!",
  "peppy.dialogue.chat.taiga/2": "Who needs warm weather when you have the taiga biome? It's like a winter wonderland filled with everything we could ever want. I wouldn't trade it for the world!",
  "peppy.dialogue.chat.taiga/3": "Taiga forests are seriously the coolest! I can't get enough of those juicy, mouth-watering berries. They're like nature's candy!",
  "peppy.dialogue.chat.taiga/4": "Oh, foxes in the taiga forests are just the cutest! I always bring them a little treat, like sweet berries. They're such playful and mischievous little rascals!",
  "peppy.dialogue.chat.taiga/5": "Can you believe it? The wolves in these parts are practically like our best friends. With all the food available, they're practically domesticated!",
  "peppy.dialogue.chat.taiga/6": "Take a deep breath and feel that crisp, fresh air in the taiga. It's like a natural spa treatment for your lungs. So rejuvenating!",
  "peppy.dialogue.chat.taiga/7": "Okay, let's be honest. Sweet berry bushes have the most delicious berries ever. But boy, oh boy, those thorns can be a real pain in the you-know-what! Totally worth it though!",
  "peppy.dialogue.chat.taiga/8": "Rain in the taiga may be a bit chilly, but there's something so serene and calming about it. It's like nature's way of giving us a cozy hug. So peaceful and refreshing!",
  "peppy.dialogue.chat.snowy_plains/1": "Brrr, it's chilly around here, but as long as I have my cozy sweater and a cup of hot cocoa, I'm good to go!",
  "peppy.dialogue.chat.snowy_plains/2": "Oh boy, it's absolutely frigid out here! But hey, at least I can show off my ice-skating skills on the frozen lake. Whee!",
  "peppy.dialogue.chat.snowy_plains/3": "When it's this cold, I just love bundling up in a fluffy blanket, sipping on some steaming tea, and binge-watching my favorite shows. Ah, pure bliss!",
  "peppy.dialogue.chat.snowy_plains/4": "Whenever I see snowflakes falling, it's like a magical invitation to relive my childhood memories of building enormous snow forts and having epic snowball battles with my gang. Good times, good times.",
  "peppy.dialogue.chat.snowy_plains/5": "Geez, those sneaky strays are such a pain in the neck around here, aren't they? I mean, come on, couldn't they find somewhere warmer to hang out? Sheesh!",
  "peppy.dialogue.chat.snowy_plains/6": "Heads up, folks! The guards have caught sight of those pesky wolves roaming nearby. Time to be extra cautious and avoid any unexpected doggy encounters.",
  "peppy.dialogue.chat.snowy_plains/7": "You know what's the worst? Accidentally bumping into an iron golem and getting stuck like glue for the whole day. Talk about a major inconvenience, am I right?",
  "peppy.dialogue.chat.snowy_plains/8": "Ahh, nothing beats the nostalgia of my childhood, when my parents would surprise me with a pumpkin and we'd have the best time crafting snow golems together. And let's not forget the delicious pumpkin pie afterward. Yum!",
  "peppy.dialogue.chat.desert/1": "Wow, the desert is always scorching, but who needs winter when you can rock a perpetual tan?",
  "peppy.dialogue.chat.desert/2": "The desert, where the sun never takes a break and the heat is cranked up 24/7!",
  "peppy.dialogue.chat.desert/3": "Oh, the desert heat might fry your skin, but hey, at least I'll always look like a bronzed beauty, or a lobster in need of some aloe.",
  "peppy.dialogue.chat.desert/4": "Talk about a stunning nighttime show! The desert sky is like a twinkling canvas, and the cool breeze adds a touch of magic to the experience.",
  "peppy.dialogue.chat.desert/5": "Whoa, hold on to your hats, folks! This scorching sun is on a whole new level today!",
  "peppy.dialogue.chat.desert/6": "Goodness gracious, the sun is blazing like crazy today!",
  "peppy.dialogue.chat.desert/7": "Hey, have you spotted any sneaky rabbits around here? They're like desert ninjas, I tell ya!",
  "peppy.dialogue.chat.desert/8": "Ugh, those pesky husks can really ruin your appetite! I swear they have a secret talent for making you ravenous every time they whack you!",
  "peppy.dialogue.chat.desert/9": "Ouch! Learned my lesson the hard way by hugging a cactus. Gotta watch those prickly pals around here!",
  "peppy.dialogue.chat.desert/10": "Life in this dry desert ain't a walk in the park, but hey, at least we've got this awesome village where we can chow down on food and stay hydrated.",

  "peppy.dialogue.story.exploring.success/1": "Awesome! I've always dreamt of embarking on an epic adventure like yours someday!",
  "peppy.dialogue.story.exploring.success/2": "Whoa! The thought of wandering and discovering new places makes my heart skip a beat. I adore my cozy village and dear ones, but hearing about your escapades fills me with envy!",
  "peppy.dialogue.story.exploring.success/3": "You're like a fearless explorer, boldly venturing into uncharted territories. I salute your courage!",
  "peppy.dialogue.story.exploring.fail/1": "Oh, come on now! Your stories are so yesterday, let's talk about something fresh and exciting!",
  "peppy.dialogue.story.exploring.fail/2": "Oh my gosh, you're like the embodiment of coolness! I can't even handle all that edge you're bringing to the table, tough guy. So impressive!",
  "peppy.dialogue.story.exploring.fail/3": "2. Speaking with you reminds me of interacting with an enthusiastic optimist, constantly striving to reach their goals. Except, you know, without the adorable charm.",

  "peppy.dialogue.story.nether.success/1": "Whoa, talk about sizzling hot! The Nether must be an inferno!",
  "peppy.dialogue.story.nether.success/2": "You're like a fireproof superhero surviving in that scorching realm! Teach me your ways!",
  "peppy.dialogue.story.nether.success/3": "Legends say the Nether is a gold mine of epic loot, but I'm not sure my energy levels can handle it. Too bad!",
  "peppy.dialogue.story.nether.success/4": "Fearless adventurer alert! How do you even sleep at night knowing you're gonna face all those fiery creatures? Not that it bothers me, of course. *nervously chuckles*",
  "peppy.dialogue.story.nether.success/5": "Hey, have you ever come across a Zombified Piglin? I heard they're pretty wild!",
  "peppy.dialogue.story.nether.fail/1": "Wowza, you haven't even taken a single step into the fiery Nether? That's like missing out on a wild rollercoaster ride!",
  "peppy.dialogue.story.nether.fail/2": "It all makes sense now! Those Piglins weren't attacking you for no reason, they could smell your Nether inexperience a mile away!",
  "peppy.dialogue.story.nether.fail/3": "Pfft, who cares if you've been to the Nether or not? I mean, I don't think you could spin a captivating tale even if a dragon was breathing down your neck!",
  "peppy.dialogue.story.nether.fail/4": "Haha, sorry buddy, but you don't exactly have that radiant, iron-clad look that screams \"Bring it on, Nether!\" Maybe stick to the Overworld for now.",
  "peppy.dialogue.story.nether.fail/5": "Your grandpa supposedly braved the Nether and never mentioned a single word about warped fungus? Uh-huh, sure thing, Pinocchio! Your pants are on fire!",

  "peppy.dialogue.story.enderdragon.success/1": "Woo-hoo! Did you bring the dragon egg? That's like the ultimate trophy!",
  "peppy.dialogue.story.enderdragon.success/2": "Oh my gosh, you slayed the fearsome enderdragon?! Our village will be talking about this for, like, ever! You're a total legend!",
  "peppy.dialogue.story.enderdragon.fail/1": "Whoa, hold up! Are you seriously suggesting the ender dragon is just a tall tale? You're cracking me up!",
  "peppy.dialogue.story.enderdragon.fail/2": "Oh my gosh, you're pulling my leg, right? No way any of us mere mortals could even dream of taking down that majestic beast! It's like trying to tickle a tornado!",

  "peppy.dialogue.story.wither.success/1": "No way! The Wither is like the ultimate destroyer or something!",
  "peppy.dialogue.story.wither.success/2": "Holy cow, you actually defeated the Wither?! That's absolutely mind-blowing!",
  "peppy.dialogue.story.wither.fail/1": "No way, I just can't buy into what you're saying!",
  "peppy.dialogue.story.wither.fail/2": "Seriously? You seem so intact, it's hard to believe that's actually true!",

  "peppy.dialogue.stay.fail/1": "No way, I'm all about the thrill of exploring!",
  "peppy.dialogue.stay.fail/2": "Thanks for the offer, but I'm a free-spirited explorer at heart!",
  "peppy.dialogue.stay.fail/3": "This village is charming, but my heart longs for the excitement of adventure!",
  "peppy.dialogue.stay.repeat/1": "Oh my goodness, you've already asked me that quite a few times!",
  "peppy.dialogue.stay.repeat/2": "Whoa, you've already asked me this before, my friend!",
  "peppy.dialogue.stay.success/1": "Oh my goodness, I am absolutely thrilled to be staying in this delightful village!",
  "peppy.dialogue.stay.success/2": "Woohoo, I am beyond excited to call this incredible village my home sweet home!",
  "peppy.dialogue.stay.no_space/1": "Wow, this village is bursting with life!",
  "peppy.dialogue.stay.no_space/2": "I'm totally down to stay, but it's like a bed frenzy in here - no vacancies!",

  "peppy.dialogue.hire/1": "Awesome! Count me in! Just give me a heads-up when you want me to start. I'm ready to roll for those shiny emeralds!",
  "peppy.dialogue.hire/2": "Woohoo! I'm your go-to villager for hire! Just drop me a line when you're ready to go. I'll be waiting eagerly for those sparkling emeralds!",
  "peppy.dialogue.hire/3": "Oh yeah! I'm at your service, my friend! Just give me the signal when you need my expertise. Rest assured, those gleaming emeralds will be worth every second of my time!",
  "peppy.dialogue.no_money/1": "Hey there! Unfortunately, my expert services come with a price tag that requires a little more sparkle in your pockets.",
  "peppy.dialogue.no_money/2": "Whoa, hold up! You're not gonna get away with a bargain here, buddy. You'll need to dig deeper in that emerald mine of yours if you want to hire me!",
  "peppy.dialogue.no_money/3": "Don't let my affordable appearance fool you, my friend! We're talking top-notch services that come at a cost. So go on, gather those emeralds and let's talk business!",

  "peppy.dialogue.main.rock_paper_scissor/1": "Alright, let's rock this Rock Paper Scissor game and have a blast! Are you ready to show off your skills and take me down in this epic battle of hands? Let's do this! Rock, paper, scissor, go!",
  "peppy.dialogue.rock_paper_scissor/1": "Ready, set, go! Let's rock, paper, scissors, and make some magic happen!",
  "peppy.dialogue.rock_paper_scissor/2": "Brace yourself, my friend, because this time I'm about to unleash an unstoppable winning streak that will leave you in awe!",
  "peppy.dialogue.rock_paper_scissor.rock/1": "Hold onto your hats because I'm about to bring the thunder with a rock!",
  "peppy.dialogue.rock_paper_scissor.paper/1": "Paper, the winning strategy for those who dare to be awesome!",
  "peppy.dialogue.rock_paper_scissor.scissor/1": "Snipping my way to victory with my trusty scissor!",
  "peppy.dialogue.rock_paper_scissor.loose.rock/1": "Woohoo! I pick paper, and guess what? I'm the winner, baby!",
  "peppy.dialogue.rock_paper_scissor.loose.paper/1": "No one can beat me when I choose scissors, mark my words!",
  "peppy.dialogue.rock_paper_scissor.loose.scissor/1": "Ha! I just defeated your feeble scissors with my rock of triumph! Bow down to my superior gaming skills!",
  "peppy.dialogue.rock_paper_scissor.win.rock/1": "Yay, rock totally smashes scissors! I totally lost, but let's keep playing!",
  "peppy.dialogue.rock_paper_scissor.win.paper/1": "Some say rock is the strong and steady choice, but for me, it's just a recipe for defeat!",
  "peppy.dialogue.rock_paper_scissor.win.scissor/1": "Hooray! Scissors just turned paper into confetti with their unstoppable energy. You're the vibrant hero of this game, my enthusiastic buddy.",
  "_": ""
}
