{
  "witty.dialogue.main/1": "Well, well, well, look who decided to grace us with their presence!",
  "witty.dialogue.main/2": "Yo, how's life treating you today, my friend?",
  "witty.dialogue.main/3": "Well, well, well, if it isn't my favorite person in the whole village!",
  "witty.dialogue.main/4": "Any exciting adventures on the horizon for you today, my dear villager?",
  "witty.dialogue.main/5": "How's the world treating you today, my fine fellow?",
  "witty.dialogue.main/6": "Hey there, %1$s! What's the latest gossip in the village?",
  "witty.dialogue.main/7": "You won't believe the crazy tale I have for you! So, picture this",

  "witty.dialogue.rumors.failed/1": "Hmm, my dear, I'm afraid I haven't stumbled upon any juicy tidbits lately. My ears have been rather disappointed by the lack of scandalous whispers.",
  "witty.dialogue.rumors.lore/1": "It's all the rage these days, everyone's going nuts for Sirben! His loyal prophets, MerlinWolfGames and Crow, are out there spreading his divine teachings.",
  "witty.dialogue.rumors.lore/2": "Can you believe it? Those pesky Cyberdemons thought they could invade us through their fancy Portals. Well, guess what? Sirben and Luke teamed up and put a stop to the whole invasion shenanigans!",
  "witty.dialogue.rumors.lore/3": "You won't believe the wild tale I heard. So, apparently, 2DA50 got mixed up in the whole Ancient Builder disappearance thing, and guess where they ended up? The Far Lands! And poof, never heard from again. Talk about vanishing in style!",
  "witty.dialogue.rumors.lore/4": "You know, our very own MerlinWolfGames has gone above and beyond for Sirben's glory. That guy went ahead and built a jaw-dropping temple dedicated to the mighty Sirben himself. It's like one of those ancient wonders you read about!",
  "witty.dialogue.rumors.lore/5": "Ah, those were the days, my friend. We had this super advanced race of builders roaming around, crafting awe-inspiring structures left and right. But alas, they vanished into thin air. It's like they pulled a magical disappearing act on us!",
  "witty.dialogue.rumors.lore/6": "Gather 'round, folks, and let me tell you the tales of the legendary ancient builders. They were like the rockstars of the Overworld, leaving behind magnificent ruins and temples that still boggle the mind! It's like they sprinkled their genius all over our realm.",

  "witty.dialogue.first.generic/1": "Well, look who decided to grace us with their presence! Welcome to the village, stranger. Prepare to be amazed.",
  "witty.dialogue.first.generic/2": "Ah, greetings, mysterious wanderer! What brings you to our humble village? Perhaps tales of adventure and excitement?",
  "witty.dialogue.first.generic/3": "Well, well, well. A fresh face enters the scene. Brace yourself for the awe and wonder that awaits you in our village.",
  "witty.dialogue.first.generic/4": "Huzzah! Behold, a newcomer has arrived! Pray tell, dear traveler, what tales of triumph and intrigue have you brought with you?",
  "witty.dialogue.first.generic/5": "Well, well, well. If it isn't our lucky day! A wayfaring soul has stumbled upon our village. Prepare for a delightful journey, my friend.",
  "witty.dialogue.first.generic/6": "Greetings, esteemed traveler! You have found your way to our humble abode. Prepare yourself for the warmest of welcomes and the grandest of adventures.",

  "witty.dialogue.first.question/1": "Well, well, well. Look who decided to grace us with their presence. What brings you to this humble village?",
  "witty.dialogue.first.question/2": "Well, aren't you a breath of fresh air! What thrilling escapades have led you to our little corner of the world?",
  "witty.dialogue.first.question/3": "Goodness gracious, we've got ourselves an adventurer! Pray tell, my curious soul, how did you manage to find your way here?",
  "witty.dialogue.first.exploring/1": "We may not have riches beyond measure, but consider yourself honored to be in our humble abode, as long as you pledge to steer clear of any mischievous antics.",
  "witty.dialogue.first.exploring/2": "Behold, weary wanderer! Should you choose to comply with the sacred laws that govern this place, you shall be granted the privilege of residing within our midst.",
  "witty.dialogue.first.exploring/3": "Ah, greetings, dear traveler! I implore you to conduct yourself with the utmost grace and decorum, for only then shall you be bestowed the esteemed honor of dwelling among us.",
  "witty.dialogue.first.settling/1": "Well, well, well. Look who decided to grace us with their presence! Must be your lucky day, stumbling upon our humble village.",
  "witty.dialogue.first.settling/2": "Ah, greetings, dear neighbor! You've joined the ranks of us lucky souls in this charming little hamlet.",
  "witty.dialogue.first.settling/3": "Aha! Another soul brave enough to venture into our little slice of paradise. Welcome, welcome! We could use all the hands we can get.",
  "witty.dialogue.first.settling/4": "Ah, so you've chosen to grace us with your presence, have you? Excellent choice, my friend. This village is the epitome of greatness.",
  "witty.dialogue.first.spent_night.success/1": "Ah, you're in for a treat! Our inn is the ultimate sanctuary for weary travelers like yourself.",
  "witty.dialogue.first.spent_night.success/2": "Trust me, friend, if you're looking to recharge those batteries of yours, our inn is the bee's knees!",
  "witty.dialogue.first.spent_night.success/3": "Craving a cozy bed and a scrumptious meal? Look no further, my good sir/madam! Our inn is the epitome of comfort and gastronomic delight.",
  "witty.dialogue.first.spent_night.failed/1": "Ha! An inn? Building one would require more brain cells than our entire village combined!",
  "witty.dialogue.first.spent_night.failed/2": "Nope, sorry! You won't find an inn here, but hey, at least we're good at something... or not.",
  "witty.dialogue.first.spent_night.failed/3": "Hah! You're better off searching for an inn in another village. We've got zero expertise in hospitality. Well, we've got zero expertise in a lot of things, really. But hey, good luck!",

  "witty.dialogue.hug.success/1": "Well, well, well, if it isn't my long-lost buddy!",
  "witty.dialogue.hug.success/2": "Ah, just what the doctor ordered! You've got healing hugs, my friend.",
  "witty.dialogue.hug.success/3": "Well, isn't this the highlight of my day! A hug that shines brighter than the sun!",
  "witty.dialogue.hug.success/4": "Move over, sheep, there's a new snuggle champion in town! You're softer than a cloud!",
  "witty.dialogue.hug.success/5": "Oh, you've got some serious hugging skills, my friend! Consider this a reciprocal embrace.",
  "witty.dialogue.hug.success/6": "Who needs a fireplace when I've got you? You're a walking furnace of warmth!",
  "witty.dialogue.hug.fail/1": "Woah, look at you, the poster child for a mud-slinging contest!",
  "witty.dialogue.hug.fail/2": "Nah, I'll pass on the hugathon, thanks.",
  "witty.dialogue.hug.fail/3": "Hug? Hmm, what's in it for me?",
  "witty.dialogue.hug.fail/4": "Oh, so you suddenly remembered my existence after your prehistoric blunder? Hard pass.",
  "witty.dialogue.hug.fail/5": "Frankly speaking, a hug from you is about as appealing as a squashed creeper.",
  "witty.dialogue.hug.fail/6": "Ugh, no offense, but your germ game is strong. Keep that hug to yourself!",
  "witty.dialogue.hug.fail/7": "Oh, umm... well, isn't this a... \"creative\" way of expressing gratitude? Sure, you're welcome... I guess?",

  "witty.dialogue.kiss.success/1": "I'm telling you, this moment is pure magic!",
  "witty.dialogue.kiss.success/2": "My taste buds are dancing with joy, just like at a pumpkin pie feast!",
  "witty.dialogue.kiss.success/3": "Honey? No, no, you're more like a delectable dessert, a delicacy!",
  "witty.dialogue.kiss.success/4": "Well, well, well, aren't you quite the skilled smoocher, %1$s?",
  "witty.dialogue.kiss.success/5": "Move over Ash, %1$s is the new champion of kisses! *chuckles*",
  "witty.dialogue.kiss.success/6": "Haha, you've definitely mastered the art of smooching! Move aside, Ash, the new kissing legend has arrived! *winks*",
  "witty.dialogue.kiss.fail/1": "Pucker up, but only if no one's snooping!",
  "witty.dialogue.kiss.fail/2": "Is that your idea of a smooch? Please, try harder!",
  "witty.dialogue.kiss.fail/3": "Oh, honey, Ash's kisses put yours to shame. Step up your game!",
  "witty.dialogue.kiss.fail/4": "Let me clue you in on a little secret",
  "witty.dialogue.kiss.fail/5": "Well, thanks... I guess? But you've got a looong way to go.",
  "witty.dialogue.kiss.fail/6": "Get off me, you amateur! Can't handle a proper kiss, huh?",

  "witty.dialogue.chat.success/1": "Oh man, cookies and milk are practically singing a siren song to my taste buds right now.",
  "witty.dialogue.chat.success/2": "Ah, the weather, it's quite pleasant today, wouldn't you agree? Not that I expect you to have the same impeccable sense of style as me.",
  "witty.dialogue.chat.success/3": "Well, I'm doing alright, despite the fact that I managed to stub my toe within seconds of waking up. I swear, I have a talent for attracting clumsiness.",
  "witty.dialogue.chat.success/4": "An apple a day keeps the zombies at bay! At least that's what my granny always used to say. It's also a great excuse to indulge in some juicy fruit.",
  "witty.dialogue.chat.success/5": "You know, I have this grand ambition of building my own village, but I must confess, laziness is my strongest skill. It's like a superpower, really.",
  "witty.dialogue.chat.success/6": "You won't believe what I saw the other day - %Supporter% strutting around in a full set of shiny diamond armor, looking like they owned the entire realm.",
  "witty.dialogue.chat.success/7": "Get this, my buddy %Supporter% spilled the beans about discovering a chest overflowing with sparkling diamonds just yesterday. Talk about a lucky break!",
  "witty.dialogue.chat.success/8": "Isn't the weather just positively remarkable? It's a golden opportunity to soak up some rays and show off my stunning outfit. You should take a few tips from me, darling.",
  "witty.dialogue.chat.success/9": "I've been living here for ages, and honestly, I don't get why everyone makes such a fuss over those creepy spiders and pesky goblins. They're no match for my dazzling charm, obviously.",
  "witty.dialogue.chat.success/10": "You know what's been on my mind lately? %Supporter%. They vanished into thin air about a year ago. I wonder if they stumbled upon some secret realm or something.",
  "witty.dialogue.chat.success/12": "Have you heard the scandalous news about %Supporter%? I've been dying to spill the juicy details. Let's just say, they had a run-in with a mischievous Enderman.",
  "witty.dialogue.chat.success/13": "I've been toying with the idea of adopting one of those adorable stray cats around here. It's like having a cute little sidekick to match my incredible presence. Just need to find some free time, you know?",
  "witty.dialogue.chat.success/14": "I've been contemplating giving my humble abode a makeover. I mean, it's already fabulous, but a touch of pizzazz wouldn't hurt. Now if only I could summon the energy and motivation to do it.",
  "witty.dialogue.chat.success/15": "Ah, the sweet dream of having kids someday. I just need to find the perfect",
  "witty.dialogue.chat.success/16": "It's crazy to think about the alternate reality where I ended up in the neighboring village. Who knows, maybe I'd be ruling as the mayor by now!",
  "witty.dialogue.chat.success/17": "Ah, reminiscing about my childhood brings back a flood of memories. Those were the days when I was a true legend, causing mischief left and right!",
  "witty.dialogue.chat.success/18": "Can you believe it? My parents actually think I've forgotten about them. I should surprise them with a visit and remind them who their superstar child is!",
  "witty.dialogue.chat.success/19": "So, I've been neglecting my old pals from the nearby village for ages now. Time to put on my adventurer hat and go on a heroic journey to reunite with my long-lost friends!",
  "witty.dialogue.chat.success/20": "Have you ever dreamed of a tantalizing, mouthwatering delicacy called cheese? Trust me, it's like a slice of heaven melting on your taste buds. My dreams are truly gourmet!",
  "witty.dialogue.chat.fail/1": "Wow, I can't even comprehend how ridiculous that statement was.",
  "witty.dialogue.chat.fail/2": "Oh, please enlighten me with your explosive theories.",
  "witty.dialogue.chat.fail/3": "You may think you're cool, but I assure you, you're just lukewarm at best.",
  "witty.dialogue.chat.fail/4": "Look at you, strutting around like a peacock.",
  "witty.dialogue.chat.fail/5": "You deserve a one-way ticket to the dungeon, my friend.",
  "witty.dialogue.chat.fail/6": "Ugh, do us all a favor and time-travel back to where you came from. Fashion forward, please!",
  "witty.dialogue.chat.fail/7": "Your conversation skills are on par with a potato, my dear.",
  "witty.dialogue.chat.fail/8": "Oh, look who's back for another riveting conversation. Be still my beating heart.",
  "witty.dialogue.chat.fail/9": "Sorry, I was too busy admiring my own greatness to pay attention to your insignificant words.",
  "witty.dialogue.chat.fail/10": "Pardon me, but did you really think I cared about what you just said?",
  "witty.dialogue.chat.fail/11": "Seriously, what's your malfunction? Why would anyone waste breath on such nonsense?",
  "witty.dialogue.chat.fail/12": "Ah, the rumors about you were right. It's like looking into the abyss of dullness.",
  "witty.dialogue.chat.fail/13": "Even the undead steer clear of your company, my friend.",
  "witty.dialogue.chat.fail/14": "You have the charm of a witch and the personality of a wet blanket. Impressive, really.",
  "witty.dialogue.chat.fail/15": "Spare me your presence, or I'll have the guards relocate you to a land far, far away.",
  "witty.dialogue.chat.fail/16": "My apologies, your conversation had all the excitement of watching grass grow.",
  "witty.dialogue.chat.fail/17": "Are you quite finished with your verbal diarrhea? I have better things to do.",
  "witty.dialogue.chat.fail/18": "I wonder if the world will mourn the loss of your incessant babbling when the day comes.",
  "witty.dialogue.chat.fail/19": "I'd take pleasure in contemplating a pig's behind rather than engage in conversation with you.",
  "witty.dialogue.chat.fail/20": "So, are you finally done gracing me with your mind-numbing dialogue?",
  "witty.dialogue.chat.fail/21": "Wait, you actually believe the Earth is round? How quaint. Do tell me more about your spherical fantasies.",

  "witty.dialogue.story.success/1": "Seriously? That's like the most epic tale I've ever heard!",
  "witty.dialogue.story.success/2": "If only I had the guts to face a creeper. You're braver than a knight!",
  "witty.dialogue.story.success/3": "Wow, that story was top-notch! Did you hire a team of writers for that masterpiece?",
  "witty.dialogue.story.success/4": "Hold up, you mean to tell me all of that happened in just one day? Mind. Blown.",
  "witty.dialogue.story.success/5": "Are you serious? I was practically in the same neighborhood yesterday and I missed this jaw-dropping saga?",
  "witty.dialogue.story.success/6": "Haha, classic %Supporter%! Always turning ordinary tales into extraordinary adventures.",
  "witty.dialogue.story.success/7": "The Legend of %Supporter% is practically engraved in my brain cells. You better regale me with it once more!",
  "witty.dialogue.story.success/8": "Oh, snap! So that's the secret behind your diamond-finding prowess? You're like a Minecraft Indiana Jones!",
  "witty.dialogue.story.success/9": "Hey, swing by later, will ya? I'm dying to hear more of your mind-boggling chronicles.",
  "witty.dialogue.story.fail/1": "Excuse me, but I simply cannot let you speak ill of my dear mother. She's a force to be reckoned with, you know!",
  "witty.dialogue.story.fail/2": "Oh, the tales of your misadventures have reached even the farthest corners of the village. They speak of you in hushed whispers, with wide eyes and shaking heads.",
  "witty.dialogue.story.fail/3": "Pardon me, but my intellectual prowess fails to comprehend the depths of your attempt at humor.",
  "witty.dialogue.story.fail/4": "My dear sir, it is absolutely appalling how you treat those poor, innocent Creepers. Have you no heart? Have you no compassion?",
  "witty.dialogue.story.fail/5": "Good sir, the audacity to slay a defenseless sheep is simply beyond my comprehension. Their gentle bleating echoes in my soul.",
  "witty.dialogue.story.fail/6": "*yawns dramatically* Oh dear, I must have dozed off for a moment there. Pray, do continue with your riveting tale.",
  "witty.dialogue.story.fail/7": "Pray tell, how did you manage to waste so much of my precious time with such a lackluster story? I do hope there's a point to all this.",
  "witty.dialogue.story.fail/8": "Oh, how utterly mundane and unexciting. I can feel my eyelids growing heavier with each passing word.",
  "witty.dialogue.story.fail/9": "My, my, you seem to be teetering on the edge of sanity. But alas, not in the charming, eccentric way. More like the \"lock them up\" variety.",
  "witty.dialogue.story.fail/10": "I must confess, my good sir, I fail to see any glimmer of brilliance in that particular endeavor of yours. Perhaps it's hidden beneath layers of mediocrity? I doubt it.",

  "witty.dialogue.flirt.success/1": "Wow, you're like a superhero or something!",
  "witty.dialogue.flirt.success/2": "Oh, stop it! You're making my heart skip a beat with your cuteness!",
  "witty.dialogue.flirt.success/3": "*Giggles* Are you serious? Because, seriously, you're melting my heart right now.",
  "witty.dialogue.flirt.success/4": "Goodness gracious...",
  "witty.dialogue.flirt.success/5": "That was beyond adorable! Seriously, you had me swooning from the moment you walked in!",
  "witty.dialogue.flirt.success/6": "How on earth do you always manage to look so incredibly captivating? Whenever I gaze upon you, I'm at a loss for words.",
  "witty.dialogue.flirt.success/7": "Oh please, enough with the flattery! You're turning me into a blushing mess over here.",
  "witty.dialogue.flirt.fail/1": "If you truly believe that, you better come armed with a bouquet of rare flowers and a diamond sword to prove it.",
  "witty.dialogue.flirt.fail/2": "Oh, please, spare me the recycled lines. The blacksmith tried the exact same approach yesterday!",
  "witty.dialogue.flirt.fail/3": "In your dreams, sweetheart. Actually, scratch that, even in your wildest dreams, it's not happening.",
  "witty.dialogue.flirt.fail/4": "Wow, have you always been this impressively pathetic? I'm genuinely impressed.",
  "witty.dialogue.flirt.fail/5": "You know what's more likely? A creeper exploding in your face. And trust me, that's not a pleasant experience.",
  "witty.dialogue.flirt.fail/6": "Nope. Not even once. I'd rather endure a thousand nights in a zombie-infested village than entertain the thought of being with you.",
  "witty.dialogue.flirt.fail/7": "Stop giving me that puppy-dog look and learn this lesson",

  "witty.dialogue.joke.creative.success/1": "*Chuckles* Oh, you never fail to tickle my funny bone!",
  "witty.dialogue.joke.creative.success/2": "Hah! You've got quite the sense of humor!",
  "witty.dialogue.joke.creative.success/3": "That's comedy gold, my friend! Pure genius!",
  "witty.dialogue.joke.creative.success/4": "Move over, %Supporter%! This one's got the jokes!",
  "witty.dialogue.joke.creative.success/5": "Oh, stop it! You're cracking me up! You should seriously consider a career in stand-up comedy!",
  "witty.dialogue.joke.creative.success/6": "Goodness gracious! My sides are splitting from that joke! I haven't laughed like this in ages!",
  "witty.dialogue.joke.creative.success/7": "Hehehe! You're a regular jokester, aren't you? Ash could take some lessons from you!",
  "witty.dialogue.joke.creative.success/8": "Well, well, well! Look who's got the jokes! That was genuinely amusing!",
  "witty.dialogue.joke.creative.failed/1": "Oh, dear, dear. Jokes really aren't your strong suit, are they?",
  "witty.dialogue.joke.creative.failed/2": "Well, bless your heart for trying. But that joke fell flat on its face.",
  "witty.dialogue.joke.creative.failed/3": "My apologies, but I'll have to award you the \"Least Funny Joke of the Year\" trophy for that one.",
  "witty.dialogue.joke.creative.failed/4": "Hold on, let me check the Joke-o-Meter... Yep, it's official, that joke barely registered a chuckle.",
  "witty.dialogue.joke.creative.failed/5": "Oh, look at you, attempting to be humorous. A for effort, I suppose.",
  "witty.dialogue.joke.creative.failed/6": "Oh, my sides! Oh wait, no, they're not hurting at all. That was sarcasm, my friend.",
  "witty.dialogue.joke.creative.failed/7": "Can someone call a comedy doctor? Because that joke needs some serious resuscitation.",
  "witty.dialogue.joke.creative.failed/8": "You know, even a zombie with brain rot could come up with a better joke than that. And they don't even have brains!",

  "witty.dialogue.procreate_engaged/1": "Ah, my dear, I eagerly await the day when we can exchange vows and embark on the grand adventure called marriage. Only then shall my heart truly find solace.",
  "witty.dialogue.procreate_engaged/2": "Oh, darling, why rush into bringing forth new life when we haven't even fully embraced the sanctity of our love? Let's savor the journey of commitment before diving into the depths of parenthood. It's all about building a rock-solid foundation, you know?",

  "witty.dialogue.shake_hand.success/1": "My oh my, you've got a grip that could make even Hercules blush!",
  "witty.dialogue.shake_hand.success/2": "Your firm handshake tells me you could probably crush rocks with those hands!",
  "witty.dialogue.shake_hand.success/3": "Oh, look at you, being all courteous and proper! How positively delightful!",
  "witty.dialogue.shake_hand.success/4": "Ah, a fine day to you, my good sir/madam!",
  "witty.dialogue.shake_hand.success/5": "Well, hello there, you charming soul! Fancy meeting you in this blocky paradise!",
  "witty.dialogue.shake_hand.fail/1": "Oh, look who's suddenly interested in shaking hands, Mr. Cow Slaughterer.",
  "witty.dialogue.shake_hand.fail/2": "Oh, how gracious of you to decline my offer. It's not like I expected any different from you.",
  "witty.dialogue.shake_hand.fail/3": "Don't worry, I'm not some random villager you need to impress. You can save your politeness for someone else.",
  "witty.dialogue.shake_hand.fail/4": "Well, well, well, look who decided to ditch their usual rude self. I'm impressed, or maybe just shocked.",
  "witty.dialogue.shake_hand.fail/5": "Oh, you want me to go away? How unexpected! I thought you enjoyed my presence as much as a creeper explosion.",

  "witty.dialogue.main.morning/1": "Top o' the mornin' to ya!",
  "witty.dialogue.main.morning/2": "G'mornin', ready to put those muscles to work today?",
  "witty.dialogue.main.morning/3": "Ugh, still half asleep. And you?",
  "witty.dialogue.main.morning/5": "Woah, rough night huh? You look like you wrestled a creeper.",
  "witty.dialogue.main.morning/6": "Wakey-wakey, pal! Time to tackle this never-ending to-do list.",
  "witty.dialogue.main.morning/7": "Did those sheep sing you a lullaby? You're practically glowing!",
  "witty.dialogue.main.morning/8": "Rise and shine, lazybones!",
  "witty.dialogue.main.morning/9": "Ah, what a glorious morning! Time to seize the day and conquer the world!",
  "witty.dialogue.main.morning/10": "I might take it easy today, my body feels like a zombie apocalypse.",
  "witty.dialogue.main.morning/11": "My schedule is busier than a chicken farm during feeding time. I need a week-long nap.",
  "witty.dialogue.main.morning/12": "I actually managed to get some beauty sleep last night. Might as well turn some mountains into dust today, right?",
  "witty.dialogue.main.evening/1": "Good evening, my fellow Minecraft enthusiast!",
  "witty.dialogue.main.evening/2": "Whoa, can you believe how quickly the sun disappeared? Tell me, how did your day unfold?",
  "witty.dialogue.main.evening/3": "Another grueling day in this virtual world, huh? We're practically digital workaholics!",
  "witty.dialogue.main.evening/4": "Time just soared by, didn't it? So much to do, so little time to mine those diamonds!",
  "witty.dialogue.main.evening/5": "Well, I guess it's time for me to dash home and unleash my culinary skills on dinner preparation.",
  "witty.dialogue.main.evening/6": "Ugh, I totally wasted today! It's like I was a zombie stuck in a blocky trance, achieving absolutely nothing.",
  "witty.dialogue.main.evening/7": "I'm seriously considering a power nap right about now. This morning was more intense than facing off against a horde of zombies!",
  "witty.dialogue.main.evening/8": "You won't catch me strolling around at night anymore, not after that creeper incident last month. I'm locking myself inside like a cautious villager!",
  "witty.dialogue.main.evening/9": "Oh, hey there! I was just out and about, getting ingredients from the butcher for tonight's dinner. Catch you on the flip side, my pixelated friend!",
  "witty.dialogue.main.night/1": "0. Goodness gracious, burning the midnight oil, are we?",
  "witty.dialogue.main.night/2": "Ah, a nocturnal creature emerges from the shadows. Fascinating!",
  "witty.dialogue.main.night/3": "2. So you too find solace in the darkness? How intriguing!",
  "witty.dialogue.main.night/4": "3. Let's not wander too far from the village, shall we? We wouldn't want to tempt fate and become monster fodder.",
  "witty.dialogue.main.night/5": "4. The village guards do lend a sense of security, but the night still sends shivers down your spine, doesn't it?",
  "witty.dialogue.main.night/6": "5. Ah, the tranquil darkness, where one can find solace amidst the chaos. Truly a serene time to unwind.",
  "witty.dialogue.main.night/7": "6. While the bustling daytime has its charms, there's something enchanting about strolling under the starry night sky.",
  "witty.dialogue.main.night/8": "7. Fatigue is slowly creeping in, my friend. Perhaps tomorrow calls for a lighter workload and some much-needed rest.",
  "witty.dialogue.main.night/9": "8. Oh, the anticipation of crawling under warm covers and drifting into a blissful slumber. Pure bliss!",
  "witty.dialogue.main.night/10": "9. Sleep beckons, my dear. Rumor has it that tomorrow holds great adventures for you.",

  "witty.dialogue.greet.mayor/1": "Greetings and salutations, esteemed Mayor!",
  "witty.dialogue.greet.mayor/2": "Wishing you a magnificent day, Mayor!",
  "witty.dialogue.greet.monarch/1": "Ah, behold! The one and only, Your Majesty.",
  "witty.dialogue.greet.monarch/2": "Greetings, Your Highness! Prepare for the presence of true royalty.",

  "witty.dialogue.busy/1": "Hey, I've already given you my daily dose of village gossip. Time for me to put my nose back on the grindstone.",
  "witty.dialogue.busy/2": "Oh, sweetie, as much as I adore our little chats, duty calls and I must conquer this workload before the sun sets.",
  "witty.dialogue.busy/3": "My apologies, darling, but my plate is currently overflowing with tasks. Shall we catch up when I'm not juggling like a circus performer?",
  "witty.dialogue.busy/4": "Regrettably, my friend, the demands of productivity are summoning me. Fear not, for we shall rendezvous again when my work is complete.",
  "witty.dialogue.busy/5": "Blast it all! I've left my furnace unattended, and it's in danger of staging a fiery rebellion! Let's continue our tete-a-tete once I've averted disaster, shall we?",
  "witty.dialogue.goaway/1": "Ugh, can't you see I'm busy? Scram!",
  "witty.dialogue.goaway/2": "Don't you have a life or something? Seriously, go bother someone else.",
  "witty.dialogue.goaway/3": "Oh, sorry, but I'm currently occupied with important things. Can't spare a moment for ya, %1$s.",
  "witty.dialogue.goaway/4": "Hey, why don't you go pester someone who actually cares? I'm not interested in your antics.",
  "witty.dialogue.goaway/5": "Haha, nice try, you mere mortal. My patience for your presence has run out. Begone, heathen!",

  "witty.dialogue.greet/1": "Hey there, superstar! How's the world spinning for you today?",
  "witty.dialogue.greet/2": "Well, hello there, %1$s! Any exciting tales to share?",
  "witty.dialogue.greet/3": "Oh, hello there, inquisitive one! What brings you to my humble abode?",
  "witty.dialogue.greet/4": "Look at you, shining brighter than the sun! How's your adventure unfolding?",
  "witty.dialogue.greet/5": "Greetings, esteemed %1$s! Your presence brings joy to my day!",
  "witty.dialogue.greet/6": "Ohai, oh mighty wanderer of the pixelated realms!",
  "witty.dialogue.greet/7": "Ah, it's you! The pleasure of your company is always welcome.",
  "witty.dialogue.greet/8": "Hello, hello! Delightful to lay eyes upon you. How fares your existence today?",
  "witty.dialogue.greet/9": "Hey, hey! The sight of you brings a smile to my face. What brings you here today?",

  "witty.dialogue.greet.negative/1": "Yikes, you again? Please, spare me your presence!",
  "witty.dialogue.greet.negative/2": "Well, well, well, if it isn't the bearer of bad news...back for more, I suppose?",
  "witty.dialogue.greet.negative/3": "Hmm, what do we have here? Oh, it's you. How utterly thrilling.",
  "witty.dialogue.greet.negative/4": "Ah, the disappointment of the day has arrived. I was hoping for a more pleasant surprise, but alas, it's just you.",
  "witty.dialogue.greet.negative/5": "Oh joy, another visit from the chief troublemaker. What did I do to deserve this?",

  "witty.dialogue.greet.success/1": "That's awesome sauce, absolutely thrilled for you!",
  "witty.dialogue.greet.success/2": "Doing good? Well, that's just a slice of fantastic news!",
  "witty.dialogue.greet.success/3": "Happy to hear it! My heart's doing a little victory dance!",
  "witty.dialogue.greet.success/4": "So glad to hear that! It's music to my ears, my friend!",
  "witty.dialogue.greet.success/5": "Good to know it! That's like finding a diamond in a treasure chest!",
  "witty.dialogue.greet.fail/1": "Well, well, well... what do we have here?",
  "witty.dialogue.greet.fail/2": "Oh, how delightful it is to hear such news!",
  "witty.dialogue.greet.fail/3": "Well, isn't that just the bee's knees?",
  "witty.dialogue.greet.fail/4": "Well, knock me over with a feather! Is that so?",
  "witty.dialogue.greet.fail/5": "Oh, bless my soul, would you look at that...",

  "witty.dialogue.apologize.success/1": "Don't sweat it, we all have our moments of utter clumsiness.",
  "witty.dialogue.apologize.success/2": "Well, lucky for you, I'm feeling extra forgiving today. Just remember to avoid any more epic fails, alright?",
  "witty.dialogue.apologize.success/3": "Alright, I'll let it slide this time, but consider this your warning to never repeat your blunders again.",
  "witty.dialogue.apologize.success/4": "No biggie, even the best of us stumble occasionally. Just make sure you keep your oopsies to a minimum.",
  "witty.dialogue.apologize.success/5": "Ah, well, I suppose even the universe can forgive one small oversight from time to time. Let's hope you've learned your lesson, shall we?",
  "witty.dialogue.apologize.fail/1": "Begone from my presence!",
  "witty.dialogue.apologize.fail/2": "Ah, I see you've mastered the art of intentionally colliding with me!",
  "witty.dialogue.apologize.fail/3": "Oh, you're expecting me to believe that feeble excuse? How quaint!",
  "witty.dialogue.apologize.fail/4": "Ouch! Save your pitiful apologies, for they hold no healing power!",
  "witty.dialogue.apologize.fail/5": "Hah! As if I would ever consider accepting your so-called apology!",

  "witty.dialogue.location.failed/1": "Well, ain't that a shame? My ears must be on vacation because I haven't caught wind of anything exciting.",
  "witty.dialogue.location.failed/2": "Oh, darlin', you've got better odds of finding a needle in a haystack than me knowing about any noteworthy locations. Sorry to burst your bubble!",
  "witty.dialogue.location.failed/3": "Bless your adventurous heart, but I'm afraid my priorities lie in more productive pursuits than tracking down perilous dungeons. So, no, no hidden treasure maps tucked away in this noggin, I'm afraid.",
  "witty.dialogue.location.forgot/1": "Oh, you won't believe it! I stumbled upon this mind-blowing spot and totally meant to mark it on the map, but my memory failed me. My bad, sorry!",
  "witty.dialogue.location.forgot/2": "Hey there, adventurer! Guess what? I discovered an epic location that would have blown your socks off... if only I hadn't forgotten to jot it down. My brain cells must be on vacation today, apologies!",
  "witty.dialogue.location.forgot/3": "Oh boy, do I have a tale for you! There was this incredible sight that I stumbled upon, but alas, my memory decided to take a coffee break. Can you believe it? Sorry for the forgetfulness!",
  "witty.dialogue.location.igloo/1": "Can you believe it? There's an igloo at %2$s. Who in their right mind would choose to live in a frosty abode like that? I mean, do they enjoy constantly shivering? *shudders*",
  "witty.dialogue.location.igloo/2": "You won't believe the gossip I heard! There's a deserted igloo at %2$s. It's like a ghost town, quite literally. I swear I saw a specter floating around there! Spooky, right?",
  "witty.dialogue.location.igloo/3": "Hold on to your mittens! At %2$s, there's an icy relic called an igloo. It's been forsaken for ages, I tell ya! Who needs a house made of ice? It's like living in a freezer. Brrrr!",
  "witty.dialogue.location.pyramid/1": "Oh, did you catch a glimpse of that majestic pyramid over at %2$s? Quite the sight, I must say!",
  "witty.dialogue.location.pyramid/2": "Rumor has it, there's a mind-boggling pyramid at %2$s. It's like a big, mysterious puzzle just waiting for someone brilliant like you to solve it.",
  "witty.dialogue.location.pyramid/3": "Ah, %2$s! The land of legends and secrets. I've heard whispers about a treacherous pyramid lurking there. Many have tried to conquer its depths, but none have returned unscathed. Are you brave enough to test your luck?",
  "witty.dialogue.location.ruined_portal_desert/1": "Marvel at the shattered remnants of a portal, nestled amidst the endless dunes of this forsaken desert. Its destruction serves as a stark reminder of the desert's merciless grip on all who dare cross its path.",
  "witty.dialogue.location.ruined_portal_swamp/1": "Behold, dear friend! A ruined portal gracing the center of this ghastly swamp. I can't help but chuckle at the thought of those Nether invaders expecting a grand entrance, only to be met with the reality of this squalid dump. Quite the amusing turn of events, wouldn't you say?",
  "witty.dialogue.location.ruined_portal/1": "Oh boy, you won't believe what's waiting for you at %2$s - a ruined portal straight out of a horror movie! I mean, seriously, it's like the Nether paid a visit and left its fiery mark. Scary stuff, if you ask me!",
  "witty.dialogue.location.ruined_portal/2": "Hey, guess what? If you're up for a little adventure, check out %2$s. There's this completely wrecked nether portal that'll give you goosebumps! I mean, it's like the Nether had a fiery party and this place is the aftermath. But don't worry, it's safe... I think.",
  "witty.dialogue.location.ruined_portal/3": "So, word around here is that %2$s is home to some seriously ancient ruins. Rumor has it, it used to be a nether portal. But let me tell you, buddy, it's not just any ordinary ruins. It's like... cursed or something! People say there might even be treasure hidden inside, but honestly, I wouldn't touch it with a ten-foot pole!",
  "witty.dialogue.location.ruined_portal_mountain/1": "Guess what? There's a ruined portal in the mountains, right at %2$s! It's like Mother Nature's twisted sense of humor decided to play a prank on unsuspecting travelers.",
  "witty.dialogue.location.mansion/1": "Oh, let me tell you something juicy! There's this wickedly cursed mansion at %2$s, infested with those ghastly illagers. Trust me, darling, if you hold any value for your precious little life, steer clear of that wretched place.",
  "witty.dialogue.location.mansion/2": "Listen up, my friend. Picture this",
  "witty.dialogue.location.monument/1": "Hey there, adventurer! Rumor has it there's a sunken castle chilling out near %2$s, but trust me, you'd better bring your floaties and steer clear of those sneaky sea monsters. They're a feisty bunch!",
  "witty.dialogue.location.monument/2": "Ahoy, matey! I've heard whispers of some ancient ruins lurking beneath the ocean depths near %2$s. They say there's treasure waiting to be discovered, but be warned – danger lurks around every seaweed-covered corner. Are you ready to dive into the unknown?",
  "witty.dialogue.location.shipwreck/1": "Ahoy there, matey! Feast your eyes upon the majestic shipwreck I discovered at %2$s. That sunken vessel once sailed under the flag of the mighty Eastern Alliance Company, aye!",
  "witty.dialogue.location.shipwreck/2": "Avast, me hearties! Word on the high seas is that some lucky fishermen stumbled upon a shipwreck at %2$s. I'm positively itching to know if there be some hidden treasure waiting to be plundered... Yo ho ho!",
  "witty.dialogue.location.shipwreck_beached/1": "Ahoy there, matey! I stumbled upon a shipwrecked beauty at %2$s, right on the sandy shores. It's quite the sight, you won't be able to resist its allure!",
  "witty.dialogue.location.shipwreck_beached/2": "Avast, me hearties! Head on over to %2$s and feast your eyes upon a shipwreck stranded on the beach. It's a mysterious tale, that one. I can't help but ponder how it got there, arrr!",
  "witty.dialogue.location.village_desert/1": "Who would have thought? Right here in this unforgiving desert, you'll stumble upon a village that will steal your heart in an instant!",
  "witty.dialogue.location.village_taiga/1": "Ah, behold! In the vast expanse of the taiga biome lies another enchanting village, just waiting to be discovered!",
  "witty.dialogue.location.village_taiga/2": "Venture forth, my friend, into the heart of the magnificent taiga biome, and lo and behold, you shall stumble upon another village of wondrous charm!",
  "witty.dialogue.location.village_snowy/1": "Hey, did you know there's a chilly little village over yonder at %2$s? Brrr, it's like an icebox over there!",
  "witty.dialogue.location.village_snowy/2": "Psst, listen up! If you make your way to %2$s, you'll find this frosty village in the snowy plains. The people there are friendly as ever, but man, it's colder than a penguin's freezer!",
  "witty.dialogue.location.village_plains/1": "Oh, you won't believe what lies ahead at %2$s! There's another charming village just waiting to be discovered.",
  "witty.dialogue.location.village_plains/2": "Brace yourself, my dear friend, for beyond the vast plain at %2$s lies a hidden gem - another village, bustling with life and excitement.",
  "witty.dialogue.location.village_savanna/1": "Whoa, if you head on over to %2$s, you'll find another village baking in the scorching sun! Trust me, you'll need SPF 1000!",
  "witty.dialogue.location.village_savanna/2": "Hey there, adventurer! Take a trip to the savanna at %2$s and you'll stumble upon a sizzling village filled with the friendliest folks ever. Prepare to be dazzled!",
  "witty.dialogue.location.swamp_hut/1": "You won't catch me dead near that swampy mess at %2$s. There's this wicked witch dwelling there, and I suggest you steer clear if you value your sanity.",
  "witty.dialogue.location.swamp_hut/2": "Forget about %2$s, my friend. That swamp is home to the most notorious witch in all of Minecraft. If you have any sense, you'll make a wide arc around that cursed place.",
  "witty.dialogue.location.mineshaft/1": "Ah, the tales of that cursed mine! There used to be a thriving excavation site here, until disaster struck! Legends say, one poor soul dug too greedily and a mighty cave-in ensued, sealing the mine's fate forever. Seek ye answers within, if ye dare, at %2$s.",
  "witty.dialogue.location.mineshaft/2": "Prepare yourself for a spine-chilling tale, my dear friend! In ages past, a mine stood proudly in these very depths, but alas, a calamity of monstrous proportions befell it! Word has it, fearsome creatures now lurk in the shadows, turning it into a treacherous labyrinth. Should you choose to venture forth, remember - danger dances in every step! Find this accursed mine at %2$s.",
  "witty.dialogue.location.jungle_pyramid/1": "Have you heard about the cursed temple at %2$s? It's like a deathtrap waiting to gobble up unsuspecting adventurers. I'd steer clear if I were you. Unless, of course, you have a thing for danger, then be my guest.",
  "witty.dialogue.location.jungle_pyramid/2": "Ah, %2$s, the infamous jungle ruins. Legends say it's teeming with ancient traps that can outsmart even the cleverest of minds. If you're feeling adventurous, it might be worth a visit. Just remember, those traps have claimed more lives than I can count. But hey, who am I to stop you?",
  "witty.dialogue.location.pillager_outpost/1": "Oh boy, you won't believe what's happening at %2$s. The Pillagers have decided to grace us with their lovely presence by setting up an outpost right next door. Great, just what we needed. Another round of attacks. Can't they find a hobby or something?",
  "witty.dialogue.location.pillager_outpost/2": "So, word on the street is that there's an outpost owned by those lovely Pillagers at %2$s. Let me warn you, my friend, those guys have zero manners. If you dare to go anywhere near that place, prepare for a not-so-friendly arrow in the knee. Just saying.",
  "witty.dialogue.location.pillager_outpost/3": "Ah, %2$s, the land of the brave and the outpost of the wicked Pillagers. You know, if you're feeling up for a challenge, you might want to pay them a visit. Who knows, maybe you'll even find some shiny loot as a reward. But fair warning, our entire village would be eternally grateful if you rid us of those pesky troublemakers. No pressure though, just saying.",
  "witty.dialogue.location.ancient_city/0": "Oh, let me tell you, I was strolling around %2$s and suddenly I heard the strangest noises echoing from the depths of the earth. It was like the secrets of the ancient city were whispering to me!",
  "witty.dialogue.location.ancient_city/1": "You won't believe what I discovered while exploring %2$s. My instincts tell me that there's something extraordinary lurking far beneath the surface. I can almost feel the ancient city's presence calling out to me.",
  "witty.dialogue.location.ancient_city/3": "Legends, my dear friend, legends! They speak of an ancient city nestled within the very heart of %2$s. Although my eyes failed to catch a glimpse, I can't shake the feeling that this hidden treasure lies beneath the ground, waiting to be discovered by an adventurous soul like yourself.",

  "witty.dialogue.joke.monster.success/1": "Haha! That Skelly got what it deserved, served with a side of justice!",
  "witty.dialogue.joke.monster.success/2": "Are you telling me a zombie thought it could take you down with a shovel? Hahaha, what a feeble attempt!",
  "witty.dialogue.joke.monster.success/3": "The spider must've learned its lesson after crossing paths with you! Haha, you're the true boss of the block!",
  "witty.dialogue.joke.monster.success/4": "Hold on, you managed to orchestrate a skeleton taking out a creeper? That's some next-level brilliance, haha!",
  "witty.dialogue.joke.monster.success/5": "Hahah! Can you believe how clueless those cave spiders are? It's like they forgot how to spider, haha!",
  "witty.dialogue.joke.monster.failed/1": "Oh please, did you really think skeletons would just stand there and let you swing a sword at them? We've got feelings too, you know!",
  "witty.dialogue.joke.monster.failed/2": "Who even jokes about creepers blowing up anymore? It's like telling someone the sun rises in the morning. Yawn!",
  "witty.dialogue.joke.monster.failed/3": "Oh, look, another genius who forgot that zombies and skeletons were once humans. Congratulations, Captain Obvious!",
  "witty.dialogue.joke.monster.failed/4": "Did you see that enderman fall into water? Hold the front page! It's the most thrilling thing I've seen all day... not!",
  "witty.dialogue.joke.monster.failed/5": "If I had a nickel for every time someone cracked a silverfish-on-the-toilet joke, I'd have two whole nickels. Not a fortune, but enough to say \"weird coincidence, huh?\"",

  "witty.dialogue.joke.animal.success/1": "Oh, what a baa-d day for that sheep to misplace its wool! But hey, at least it can rock the naked look now!",
  "witty.dialogue.joke.animal.success/2": "Ah, and here comes the juicy gossip - the wolf and the sheep, a love story for the ages! Can't wait for the next episode of \"Sheep of Thrones\"!",
  "witty.dialogue.joke.animal.success/3": "You won't believe this, but chickens have secretly been taking improv classes. Yeah, they're cracking hilarious jokes now! Who knew they had such comedic talent hidden under those feathers?",
  "witty.dialogue.joke.animal.success/4": "That's a special kind of dumb that's so dumb, it's genius! I mean, who needs logic when you can have a good laugh, am I right?",
  "witty.dialogue.joke.animal.success/5": "Ah, the beauty of cows and their udderly infinite milk supply! It's like having your own personal dairy farm on-demand. Pure moo-nificence!",
  "witty.dialogue.joke.animal.failed/1": "Oh, come on! Lighten up, will ya? Ain't nobody gonna get hurt by a little joke!",
  "witty.dialogue.joke.animal.failed/2": "Bah, you're such a buzzkill! That sheep joke was baa-d, but it's all in good fun!",
  "witty.dialogue.joke.animal.failed/3": "Hey now, watch your words! My pig might not understand, but I do, and I don't appreciate it!",
  "witty.dialogue.joke.animal.failed/4": "Haha, well played, my friend! That joke may be a bit on the questionable side, but I'll give you points for audacity!",
  "witty.dialogue.joke.animal.failed/5": "Woah there, cowboy! Making fun of a cow's eyebrows? Now that's a new one! Gotta hand it to you for originality!",

  "witty.dialogue.flirt.slap/1": "Well, aren't you just a precious little troublemaker!",
  "witty.dialogue.flirt.slap/2": "Is this your attempt at charming me? Oh, honey, you might need a few more lessons from the Vindicator School of Flirting!",
  "witty.dialogue.kiss.slap/1": "Oh, you've crossed the line, my friend!",
  "witty.dialogue.kiss.slap/2": "Give it another shot, and you'll be wearing a souvenir of my wrath!",

  "witty.dialogue.chat.plains/1": "Isn't it a bit boring here in the plains? I mean, I've never seen anything more exciting. Maybe I should sprout wings and fly away one day...",
  "witty.dialogue.chat.plains/2": "Ah, the plains, the epitome of tranquility. Even if it lacks the adrenaline rush of other biomes, I'd still choose this serene abode any day.",
  "witty.dialogue.chat.plains/3": "You know, when the moon graces the plains with its presence, it's like a symphony of beauty and peace, like nature itself is putting on a magical show just for me.",
  "witty.dialogue.chat.plains/4": "Sometimes, I feel like just lying down, gazing at the vast expanse above, and whispering secrets to the stars.",
  "witty.dialogue.chat.plains/5": "The air here in the plains? Oh, it's like sipping on the elixir of life, purer than the purest spring water! Makes those taiga folks green with envy, I tell you.",
  "witty.dialogue.chat.plains/6": "Sure, the plains may lack the bells and whistles, but there's something inherently charming about its simplicity. It's like finding beauty in the most understated and humble of places.",
  "witty.dialogue.chat.plains/7": "Ah, the weather today brings back memories of my mischievous childhood days. I used to chase wildflowers, hoping to impress my crush, Ash. Ah, young love, so sweet and innocent.",
  "witty.dialogue.chat.plains/8": "Have you ever witnessed the majestic morning sunrise in the plains? It's like nature's own masterpiece unfolding before your very eyes. Trust me, it's a sight that'll take your breath away.",
  "witty.dialogue.chat.savanna/1": "Phew! This savanna heat is no joke, but hey, at least we don't have to deal with winter coats and frozen toes, amirite?",
  "witty.dialogue.chat.savanna/2": "Ugh, those llamas can be a bit of a pain in the neck, but honestly, they're like the quirky neighbors that you love to hate. Keeps things interesting, you know?",
  "witty.dialogue.chat.savanna/3": "Have you seen the incredible architecture in this savanna? It's like a blend of ancient wisdom and modern creativity. Living here feels like being part of a living, breathing masterpiece.",
  "witty.dialogue.chat.savanna/4": "Don't be fooled by the seemingly plain savanna biome. Oh no, my friend. We've got hidden gems and secret perks that only the savvy villagers discover. It's like having access to a VIP club, without the velvet ropes.",
  "witty.dialogue.chat.savanna/5": "Sure, it doesn't rain over here, but who needs rain when we've got flowing rivers? Take that, desert villages! We've got a natural water park right in our backyard.",
  "witty.dialogue.chat.savanna/6": "The hills and terrains in this savanna are like an artist's canvas come to life. Every step is a journey, every view is a postcard-worthy sight. It's like living in a real-life adventure novel.",
  "witty.dialogue.chat.savanna/7": "Phew, thank goodness for those acacia trees! When the sun's blazing its fiery wrath upon us, those leafy giants become our saviors, creating oases of cool shade. Working here feels like a tropical vacation... well, almost.",
  "witty.dialogue.chat.savanna/8": "Move over, other villages! Our savanna is known for producing the juiciest, most mouthwatering melons and pumpkins in the entire Minecraft world. We're like the Gordon Ramsay of agriculture, trading our prized treasures with envy-inducing swagger.",
  "witty.dialogue.chat.taiga/1": "The woods, my friend, they're like a treasure trove of resources! Timber for building, firewood to keep us warm, and oh, let's not forget the bountiful hunting grounds. It's like Mother Nature's gift to us!",
  "witty.dialogue.chat.taiga/2": "Cold? Nah, that's just the taiga's way of toughening us up! Trust me, we've got everything we need right here. Wouldn't trade this frosty paradise for anything in the world!",
  "witty.dialogue.chat.taiga/3": "Taiga forests, my dear, are simply the epitome of coolness! And those sweet berries? Oh, they're like nature's candy, an absolute delight for the taste buds.",
  "witty.dialogue.chat.taiga/4": "Oh, those foxes in our taiga forests are quite the little rascals! I mean, who can resist their mischievous charm? Sometimes, I even treat them to some sweet berries. It's our own secret alliance, you know?",
  "witty.dialogue.chat.taiga/5": "Can you believe it? The wolves here are practically domesticated! And why wouldn't they be? With all the potential food lying around, they've got no reason to be fierce. It's like having loyal furry companions roaming around.",
  "witty.dialogue.chat.taiga/6": "Ah, the crisp, fresh air of the taiga. It's like a spa treatment for the lungs! Nothing beats that revitalizing feeling, especially after a long day of gathering resources and exploring.",
  "witty.dialogue.chat.taiga/7": "Now, let's talk about those sweet berry bushes. Oh, they're a double-edged sword! Yes, the berries are to die for, but those prickly thorns? Ouch! It's like a painful reminder that nature can be a bit cheeky sometimes.",
  "witty.dialogue.chat.taiga/8": "Rain in the taiga may be cold, my friend, but it's also a symphony of tranquility. Picture yourself cozying up by the fire, listening to the rhythmic pitter-patter outside. It's like nature's lullaby, soothing your soul.",
  "witty.dialogue.chat.snowy_plains/1": "Brrr! This icy weather keeps me on my toes, but as long as I have a roaring fireplace, I can conquer anything!",
  "witty.dialogue.chat.snowy_plains/2": "Goodness gracious, it's colder than a penguin's pantry out here! But hey, at least I can dine on an endless buffet of freshly caught fish. Cheers to that!",
  "witty.dialogue.chat.snowy_plains/3": "Ah, chilly days like these are the perfect excuse to curl up in a cozy blanket, sip some hot cocoa, and lose myself in a captivating book by the crackling fire. Absolute bliss!",
  "witty.dialogue.chat.snowy_plains/4": "Snowfall always triggers a whirlwind of memories from my youth. Oh, the snowball fights we used to have with my mischievous gang! Those were the days, my friend.",
  "witty.dialogue.chat.snowy_plains/5": "The night brings out the mischievous strays, armed with their pesky tipped arrows. Ugh, talk about a real thorn in my side!",
  "witty.dialogue.chat.snowy_plains/6": "Beware of the ferocious wolves lurking nearby, my friend. The village guards have been on high alert for their sneaky presence. Stay safe!",
  "witty.dialogue.chat.snowy_plains/7": "You wouldn't believe the iron grip of an iron golem! Once it grabs hold of you, you're stuck like a hapless fly in a spider's web. Trust me, I've learned that the hard way.",
  "witty.dialogue.chat.snowy_plains/8": "Ah, the nostalgia of my childhood! My parents used to surprise me with a pumpkin, and after we enjoyed a delicious pie, I'd fashion a jolly snow golem out of it. What a riot we had!",
  "witty.dialogue.chat.desert/1": "Who needs winter when you can bask in the scorching heat of the desert all year round?",
  "witty.dialogue.chat.desert/2": "The desert is like a never-ending sauna, minus the relaxing music and cucumber slices.",
  "witty.dialogue.chat.desert/3": "Look at me, I've got a permanent tan that even a vampire would envy. Though it might be a sunburn, who's counting?",
  "witty.dialogue.chat.desert/4": "When the sun sets, the desert transforms into a breathtaking celestial theater. It's like being in a front row seat for the greatest cosmic show on Earth.",
  "witty.dialogue.chat.desert/5": "Goodness gracious, the sun is really out to roast us today. I wouldn't be surprised if I start sizzling like a sausage any moment now.",
  "witty.dialogue.chat.desert/6": "Phew! The sun is determined to turn us into human toast today. Time to whip out the sunscreen and pray for some shade.",
  "witty.dialogue.chat.desert/7": "Spotting rabbits in this desert is like finding a needle in a haystack made of sand. Those little bunnies sure know how to hide!",
  "witty.dialogue.chat.desert/8": "Living here means dealing with those pesky husks. They have the audacity to make you ravenous with just one whack. It's like they have a secret \"hangry\" power!",
  "witty.dialogue.chat.desert/9": "Note to self",
  "witty.dialogue.chat.desert/10": "Life in this dry desert is tough, but luckily, our village is an oasis of water and food. Who needs lush greenery when you've got a community that knows how to survive in style?",

  "witty.dialogue.story.exploring.success/1": "No way! I've always dreamt of going on epic adventures, charting unexplored lands, and discovering hidden treasures. It's like being the hero in my very own legend!",
  "witty.dialogue.story.exploring.success/2": "Oh, the tales you must have to tell! I can almost see you striding boldly through untamed wilderness, conquering fearsome monsters, and unraveling ancient mysteries. How I envy your thrilling escapades!",
  "witty.dialogue.story.exploring.success/3": "You, my friend, are an explorer extraordinaire! Venturing into the great unknown, facing danger with a mischievous grin, and leaving no stone unturned. I salute your courageous spirit!",
  "witty.dialogue.story.exploring.fail/1": "Your tales are more worn out than a creeper's explosion radius.",
  "witty.dialogue.story.exploring.fail/2": "Oh, look who's trying to be the king of snark. Careful not to trip on your own sarcasm, tough guy.",
  "witty.dialogue.story.exploring.fail/3": "Interacting with you is like conversing with a dreamer who hasn't quite grasped reality yet. Minus the charm, of course.",

  "witty.dialogue.story.nether.success/1": "Is it like, hotter than the sun there or something? I mean, I can't even handle spicy salsa, let alone the Nether.",
  "witty.dialogue.story.nether.success/2": "Whoa, surviving the Nether is like winning a game show called \"Escape the Inferno\". Congrats, you're the ultimate daredevil!",
  "witty.dialogue.story.nether.success/3": "So, rumor has it there's more treasure in the Nether than the pirates of the Caribbean could ever dream of. Too bad I'm allergic to danger, or else I'd be swimming in gold.",
  "witty.dialogue.story.nether.success/4": "Seriously, how do you sleep at night? With a Zombified Piglin nightlight? I'm asking for a friend, of course. Who's me. And I'm totally not scared. Nope. Not at all.",
  "witty.dialogue.story.nether.success/5": "Are Zombified Piglins like the Brad Pitts of the Nether? Should I be asking for their autographs or something?",
  "witty.dialogue.story.nether.fail/1": "Oh, honey, I highly doubt you've even glimpsed the fiery depths of the Nether.",
  "witty.dialogue.story.nether.fail/2": "Ah, so that's why those feisty Piglins decided to have a go at you. It all makes sense now.",
  "witty.dialogue.story.nether.fail/3": "Sweetie, it doesn't matter if you've been to the Nether or not. You couldn't spin a captivating tale if your life depended on it.",
  "witty.dialogue.story.nether.fail/4": "Oh, darling, you seem as feeble as a newborn chicken. I can't imagine you surviving a minute in the treacherous Nether.",
  "witty.dialogue.story.nether.fail/5": "Bless your heart, but my dear old grandpappy knew every nook and cranny of the Nether, and he never breathed a word about warped fungus. You're stretching the truth, my friend!",

  "witty.dialogue.story.enderdragon.success/1": "Astonishing! Did you actually manage to snatch the legendary dragon egg?",
  "witty.dialogue.story.enderdragon.success/2": "Well, well, well! Look who slayed the fearsome dragon of lore! The village will regale your heroic tale for centuries to come!",
  "witty.dialogue.story.enderdragon.fail/1": "Ha! Are you out of your mind? The ender dragon is nothing but a fairytale.",
  "witty.dialogue.story.enderdragon.fail/2": "Oh please, spare me the jokes. That dragon is so unbeatable, it would laugh at any human's feeble attempts to harm it!",

  "witty.dialogue.story.wither.success/1": "Unbelievable! The Wither is like a walking disaster, but you just crushed it!",
  "witty.dialogue.story.wither.success/2": "No way! You actually defeated the Wither?! Mind officially blown!",
  "witty.dialogue.story.wither.fail/1": "Oh please, spare me the fairy tales.",
  "witty.dialogue.story.wither.fail/2": "Ha! You seem way too intact for me to buy that nonsense.",

  "witty.dialogue.stay.fail/1": "No way, amigo! I'm all about seeking thrills and chills, not staying stuck in this quaint village.",
  "witty.dialogue.stay.fail/2": "Appreciate the offer, buddy, but I'm a wild soul yearning for heart-pounding escapades and uncharted territories!",
  "witty.dialogue.stay.fail/3": "This village is sweet, but I've got a wanderlust that can't be contained. I'm all about living life on the edge, my friend!",
  "witty.dialogue.stay.repeat/1": "Well, well, well, looks like you've already taken a trip down memory lane and asked me that same old question before.",
  "witty.dialogue.stay.repeat/2": "Oh dear player, it seems you've already graced me with your presence and asked that very question. My memory may be as sharp as a diamond sword, but it's clear as day that you've been here before.",
  "witty.dialogue.stay.success/1": "Well, fancy that! I would absolutely adore planting my roots in this delightful village!",
  "witty.dialogue.stay.success/2": "Marvelous! I would simply relish the opportunity to call this village my permanent abode!",
  "witty.dialogue.stay.no_space/1": "Well, well, well, looks like this village is bursting at the seams, doesn't it?",
  "witty.dialogue.stay.no_space/2": "Oh, how I long to set up shop here, but alas, every bed in this bustling village has been claimed! It's like trying to find a needle in a haystack, my friend!",

  "witty.dialogue.hire/1": "Alright, just give the signal when you require my extraordinary skills. I shall grace you with my presence for the duration of our financial arrangement.",
  "witty.dialogue.hire/2": "Oh, splendid! Kindly inform me of your imminent need for my unparalleled assistance. Fear not, for I shall remain here, eagerly anticipating the exchange of shimmering emeralds!",
  "witty.dialogue.hire/3": "Marvelous! I assure you, dear sir/madam, engaging my services will prove to be an absolutely delightful decision. Pray, prepare thy emeralds, for I shall be waiting with bated breath to embark on this grand endeavor of ours!",
  "witty.dialogue.no_money/1": "My dear friend, I'm afraid your emerald count is a tad bit insufficient to secure my extraordinary services.",
  "witty.dialogue.no_money/2": "Oh, dear me! It seems your emerald stash is a bit on the meager side if you wish to bask in the brilliance of my talents.",
  "witty.dialogue.no_money/3": "Ah, my good sir/madam, I must inform you that while my humble appearance may deceive, my unparalleled skills come at a price. And that price, my friend, is more emeralds than you currently possess.",

  "witty.dialogue.main.rock_paper_scissor/1": "Let's spice things up with a riveting round of Rock Paper Scissor! I hope you're ready for a taste of my exceptional decision-making skills!",
  "witty.dialogue.rock_paper_scissor/1": "Alright, prepare yourself for the ultimate showdown of rock, paper, scissors! Let's see who triumphs!",
  "witty.dialogue.rock_paper_scissor/2": "Brace yourself for the thrashing of a lifetime, my friend! I guarantee victory shall be mine this time!",
  "witty.dialogue.rock_paper_scissor.rock/1": "Boom! Rock it like a volcanic eruption!",
  "witty.dialogue.rock_paper_scissor.paper/1": "Prepare yourself, for I have chosen paper, the cunning trickster of this epic game!",
  "witty.dialogue.rock_paper_scissor.scissor/1": "Brace yourself, my opponent, for the scissor is poised to claim victory in this epic battle!",
  "witty.dialogue.rock_paper_scissor.loose.rock/1": "Oh, look at that! My paper just effortlessly crushed your rock. It's almost too easy for me. Better luck next time, pal!",
  "witty.dialogue.rock_paper_scissor.loose.paper/1": "Time to unleash the power of my scissors and leave your paper in tatters!",
  "witty.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors, meet your worst nightmare",
  "witty.dialogue.rock_paper_scissor.win.rock/1": "Well, well, well, looks like rock just bulldozed over scissor. I'm clearly not the sharpest tool in the shed.",
  "witty.dialogue.rock_paper_scissor.win.paper/1": "Rock, oh rock, why do you always have to rain on my winning streak? It's like you have a sixth sense for my paper moves.",
  "witty.dialogue.rock_paper_scissor.win.scissor/1": "Scissors have prevailed, leaving my paper utterly defeated. I tip my metaphorical hat to you, my quick-thinking rival! Well played, well played indeed.",
  "_": ""
}