{
  "gloomy.dialogue.main/1": "Oh, hello... I suppose.",
  "gloomy.dialogue.main/2": "Hey... How are you today? Not that it matters.",
  "gloomy.dialogue.main/3": "Oh, it's you... Good to see you, I guess.",
  "gloomy.dialogue.main/4": "What's going on with you today? Not that I care.",
  "gloomy.dialogue.main/5": "How are you today? I'm sure it's just as mundane as always.",
  "gloomy.dialogue.main/6": "Ah, %1$s! What's up? As if I really care...",
  "gloomy.dialogue.main/7": "So I was hanging out with %supporter%, and guess what? He got bit by a zombie! Not that it made any difference. And today, I saw a zombie that looks just like %supporter%... not that anyone cares.",

  "gloomy.dialogue.rumors.failed/1": "Ah, the cruel reality of it all. No new stories, no intriguing secrets. Just an empty void where rumors once thrived.",
  "gloomy.dialogue.rumors.lore/1": "Although Jax is still revered, the devotion to Sirben is growing and his prophets MerlinWolfGames and Crow are relentlessly spreading his teachings, casting a shadow of gloom upon our hearts.",
  "gloomy.dialogue.rumors.lore/2": "Dreadful tales speak of the Cyberdemons attempting to invade our realm, breaching the barriers of the Overworld through menacing Portals. But alas, it was the valiant efforts of Sirben and Luke that managed to halt the merciless Invasion, albeit leaving us haunted by the memories.",
  "gloomy.dialogue.rumors.lore/3": "Whispers carry the grim tidings of 2DA50's involvement in the vanishing of the Ancient Builder, as it is said they ventured into the desolate Far Lands, only to be consumed by its unforgiving void, never to be heard from again.",
  "gloomy.dialogue.rumors.lore/4": "A sepulchral temple, meticulously crafted by MerlinWolfGames, stands as a shrine dedicated to the enigmatic Sirben. Its ancient allure lingers, casting an eerie pall over our land.",
  "gloomy.dialogue.rumors.lore/5": "The annals of time recount the existence of a somber race of builders, whose legacy now crumbles into forgotten oblivion. Their absence weighs heavily upon our souls, a bleak reminder of what once was.",
  "gloomy.dialogue.rumors.lore/6": "Have you been privy to the sorrowful legends that shroud the ancient builders? Tales of their faded grandeur, whispered through the wind. Ruins and temples, melancholic remnants scattered across the desolate expanses of the Overworld, weaving a mournful tapestry.",

  "gloomy.dialogue.first.generic/1": "I can't recall ever seeing you around here before... welcome, I guess.",
  "gloomy.dialogue.first.generic/2": "Oh, great, another stranger. Just what we needed.",
  "gloomy.dialogue.first.generic/3": "Oh, joy, someone new. I hope you're not as boring as the rest.",
  "gloomy.dialogue.first.generic/4": "Welcome to this miserable excuse for a village. Got any tales to make it marginally more interesting?",
  "gloomy.dialogue.first.generic/5": "It's been ages since we've had the pleasure of a traveler's company. Don't expect much, though.",
  "gloomy.dialogue.first.generic/6": "Oh, look who decided to grace us with their presence. Welcome, I suppose. I hope you don't stay too long.",

  "gloomy.dialogue.first.question/1": "Oh, another visitor... What misfortune brings you to this forsaken village?",
  "gloomy.dialogue.first.question/2": "Ah, a stranger... What tragic tale led you to this desolate place?",
  "gloomy.dialogue.first.question/3": "Huh, you're new... Are you one of those cursed adventurers? How did you end up here in this wretched land?",
  "gloomy.dialogue.first.exploring/1": "The only thing we've got here is a gloomy existence, but I guess you can stay if you promise not to ruin it.",
  "gloomy.dialogue.first.exploring/2": "Follow the depressing rules of this place and you're welcome to linger, oh weary traveler.",
  "gloomy.dialogue.first.exploring/3": "Watch your step, lost soul. This desolate land has strict rules, and you better obey them if you want to survive.",
  "gloomy.dialogue.first.settling/1": "It's... uh... I guess I can tolerate another face in the village.",
  "gloomy.dialogue.first.settling/2": "Oh, great... another neighbor... welcome, I guess.",
  "gloomy.dialogue.first.settling/3": "Joy... another helping hand around here... how... exciting.",
  "gloomy.dialogue.first.settling/4": "So you decided to stay, huh? Well, I guess that's just... great.",
  "gloomy.dialogue.first.spent_night.success/1": "If you're desperate for a place to rest, the inn is your only option.",
  "gloomy.dialogue.first.spent_night.success/2": "The inn, if you can call it that, is the least awful place to try and regain some strength.",
  "gloomy.dialogue.first.spent_night.success/3": "Want to experience disappointment and mediocrity? Look no further than our lovely inn!",
  "gloomy.dialogue.first.spent_night.failed/1": "Unfortunately, constructing a worthy inn is beyond our skillset. Our village's architectural prowess is rather lackluster, I'm afraid.",
  "gloomy.dialogue.first.spent_night.failed/2": "Regrettably, an inn is an elusive concept in these parts. Our village is not equipped to accommodate such luxuries, I'm sorry to say.",
  "gloomy.dialogue.first.spent_night.failed/3": "Perhaps venturing to a neighboring village would yield more favorable results. Their hospitality might surpass our humble abode's limitations.",

  "gloomy.dialogue.hug.success/1": "Oh, it's been an eternity since we last crossed paths.",
  "gloomy.dialogue.hug.success/2": "I suppose I didn't mind that hug, although it won't change my perpetual sadness.",
  "gloomy.dialogue.hug.success/3": "Well, I suppose it's a silver lining in the never-ending cloud of gloom that surrounds me.",
  "gloomy.dialogue.hug.success/4": "You possess a modest amount of comfort, akin to the fleeting warmth of a dying ember.",
  "gloomy.dialogue.hug.success/5": "Oh, I suppose I can offer you a faint embrace in return for your feeble attempt to lighten my mood.",
  "gloomy.dialogue.hug.success/6": "Oh, your body temperature is marginally higher than the icy chill that engulfs my soul.",
  "gloomy.dialogue.hug.fail/1": "You're drenched in filth and grime!",
  "gloomy.dialogue.hug.fail/2": "I'd rather not, if you don't mind.",
  "gloomy.dialogue.hug.fail/3": "What's the point, really?",
  "gloomy.dialogue.hug.fail/4": "Remember when you mocked my existence? I'll pass.",
  "gloomy.dialogue.hug.fail/5": "Honestly, after your condescending remark, you don't stand a chance for a hug.",
  "gloomy.dialogue.hug.fail/6": "Ugh, spare me! Your repulsive bacteria is not welcome!",
  "gloomy.dialogue.hug.fail/7": "Oh, umm... thanks? I guess...",

  "gloomy.dialogue.kiss.success/1": "I wish this moment could stretch into eternity, burdened by the weight of my melancholic heart.",
  "gloomy.dialogue.kiss.success/2": "I suppose... that my emotions gravitate towards affection for you.",
  "gloomy.dialogue.kiss.success/3": "It somewhat resembles the flavor profile of a pumpkin pie... a reminder of the fleeting joy that life denies me.",
  "gloomy.dialogue.kiss.success/4": "The taste of honey lingers on your lips, a bittersweet reminder of the sweetness I can never truly savor.",
  "gloomy.dialogue.kiss.success/5": "Oh, by some cruel twist of fate, you manage to excel in the art of kissing, %1$s. If only my existence held such promise.",
  "gloomy.dialogue.kiss.success/6": "%1$s, your kissing prowess surpasses even that of Ash's, igniting a brief moment of amusement in my otherwise somber existence. *sighs*",
  "gloomy.dialogue.kiss.fail/1": "It's pointless if anyone catches a glimpse.",
  "gloomy.dialogue.kiss.fail/2": "Is that what you call a pathetic excuse for a kiss?",
  "gloomy.dialogue.kiss.fail/3": "Ash's kisses are a thousand times more satisfying than yours.",
  "gloomy.dialogue.kiss.fail/4": "Allow me to enlighten you with two simple words... mouthwash, perhaps?",
  "gloomy.dialogue.kiss.fail/5": "Gee, thanks, I suppose?",
  "gloomy.dialogue.kiss.fail/6": "Get your grimy lips off me this instant!",

  "gloomy.dialogue.chat.success/1": "Ugh, cookies and milk... I guess they would be somewhat satisfying.",
  "gloomy.dialogue.chat.success/2": "If you consider grey skies and a slight drizzle as \"nice,\" then sure, the weather is \"nice.\"",
  "gloomy.dialogue.chat.success/3": "I'm alright, I guess... just stubbed my toe when I woke up, adding insult to injury.",
  "gloomy.dialogue.chat.success/4": "An apple a day might deter the zombies for a second, but they'll be back for more, guaranteed.",
  "gloomy.dialogue.chat.success/5": "Building my own village? Yeah right, like I have the energy or motivation for that.",
  "gloomy.dialogue.chat.success/6": "I think I caught a glimpse of %Supporter% the other day, prancing around in their fancy Diamond armor.",
  "gloomy.dialogue.chat.success/7": "My so-called friend %Supporter% had the audacity to brag about finding a chest full of diamonds yesterday!",
  "gloomy.dialogue.chat.success/8": "The weather? Remarkable? Well, I suppose it's marginally less dismal than usual.",
  "gloomy.dialogue.chat.success/9": "Spiders and goblins? Meh. I've been dealing with those pests my whole life, nothing special.",
  "gloomy.dialogue.chat.success/10": "I wonder what happened to %Supporter%. They took off from here ages ago, probably realized how dull this place is.",
  "gloomy.dialogue.chat.success/12": "Let me tell you the latest gossip - have you heard what happened to %Supporter% the other day?",
  "gloomy.dialogue.chat.success/13": "Those stray cats are tempting, but who has the time or energy to take care of them? Certainly not me.",
  "gloomy.dialogue.chat.success/14": "Redecorating my house? Yeah, right. I'd rather sit on the couch all day, thank you very much.",
  "gloomy.dialogue.chat.success/15": "Kids? Maybe someday, if I can find someone desperate enough to tolerate my miserable existence.",
  "gloomy.dialogue.chat.success/16": "Sometimes I wonder if living in the other village would've made any difference. Probably not.",
  "gloomy.dialogue.chat.success/17": "Childhood memories? Yeah, they're nice... just a painful reminder of how much better things used to be.",
  "gloomy.dialogue.chat.success/18": "Visiting my parents? It's been ages. Maybe I should, if I can muster up the willpower to leave the house.",
  "gloomy.dialogue.chat.success/19": "Traveling to the other village? I have a few so-called friends I wouldn't mind avoiding for a few more lifetimes.",
  "gloomy.dialogue.chat.success/20": "Cheese... a distant dream. Just like happiness, success, and a life worth living.",
  "gloomy.dialogue.chat.fail/1": "Can you believe the nerve of that person?",
  "gloomy.dialogue.chat.fail/2": "It's amazing how things just spontaneously explode, isn't it?",
  "gloomy.dialogue.chat.fail/3": "You know, I'm not really impressed by your so-called coolness.",
  "gloomy.dialogue.chat.fail/4": "Look at them, showing off like they're the greatest thing ever.",
  "gloomy.dialogue.chat.fail/5": "Ugh, go away with your outdated fashion sense.",
  "gloomy.dialogue.chat.fail/6": "Talking about something that dumb is just my cup of tea.",
  "gloomy.dialogue.chat.fail/7": "Oh great, it's you again. What do you want?",
  "gloomy.dialogue.chat.fail/8": "Sorry, I couldn't care less about what you just said.",
  "gloomy.dialogue.chat.fail/9": "Pardon me, but did you really think I would care about that?",
  "gloomy.dialogue.chat.fail/10": "Seriously, why are you wasting my time with this nonsense?",
  "gloomy.dialogue.chat.fail/11": "Rumors about you aren't very flattering, and now I see why.",
  "gloomy.dialogue.chat.fail/12": "Even the undead would avoid engaging in conversation with you.",
  "gloomy.dialogue.chat.fail/13": "You're about as charming as a witch, and that's saying something.",
  "gloomy.dialogue.chat.fail/14": "Don't bother talking to me, I'll make sure the guards drag you away.",
  "gloomy.dialogue.chat.fail/15": "Sorry, your words put me to sleep. How boring.",
  "gloomy.dialogue.chat.fail/16": "Are you finally done with your endless chatter?",
  "gloomy.dialogue.chat.fail/17": "I wonder if anyone would shed a tear if you suddenly became mute forever.",
  "gloomy.dialogue.chat.fail/18": "I'd rather stare at a pig's backside than listen to you speak.",
  "gloomy.dialogue.chat.fail/19": "Are you done wasting my precious time now?",
  "gloomy.dialogue.chat.fail/20": "What? You actually believe the Earth is round? No way, that's just ridiculous!",
  "gloomy.dialogue.chat.fail/21": "Oh, the tragic ignorance of those who believe in a round earth. It's a somber reflection of our collective ignorance.",

  "gloomy.dialogue.story.success/1": "Ugh, as if I needed more bad news. That's just my luck!",
  "gloomy.dialogue.story.success/2": "I'm too much of a coward to even think about taking on a creeper. Sigh.",
  "gloomy.dialogue.story.success/3": "Great, another story. Is it going to be as depressing as the last one?",
  "gloomy.dialogue.story.success/4": "Oh joy, more tales of yesterday's misfortune. Can't wait.",
  "gloomy.dialogue.story.success/5": "So typical, I was probably right there and missed out on all the excitement.",
  "gloomy.dialogue.story.success/6": "Haha, yeah right. Like %Supporter% is anything special. Just another average Joe.",
  "gloomy.dialogue.story.success/7": "The Legend of %Supporter%... I've lost count of how many times I've heard that boring old story.",
  "gloomy.dialogue.story.success/8": "Oh, wow, finding a diamond. How utterly thrilling. Not.",
  "gloomy.dialogue.story.success/9": "No thanks, I'd rather do anything else than listen to you blabber on.",
  "gloomy.dialogue.story.fail/1": "Oh, great. That's just wonderful. Making fun of my mother, why don't you?",
  "gloomy.dialogue.story.fail/2": "This is exactly the kind of thing that confirms everyone's low opinion of you.",
  "gloomy.dialogue.story.fail/3": "I just don't understand... and I suppose I never will.",
  "gloomy.dialogue.story.fail/4": "You know what? It's not enough that you're terrible to people, now you have to be terrible to poor defenseless creepers too?",
  "gloomy.dialogue.story.fail/5": "Seriously, how heartless do you have to be to kill a defenseless sheep? It's just beyond me.",
  "gloomy.dialogue.story.fail/6": "*sigh* Oh, waking up to more of your nonsense. What a joy.",
  "gloomy.dialogue.story.fail/7": "Let me get this straight, I wasted my precious time on that? Fantastic.",
  "gloomy.dialogue.story.fail/8": "Excuse me while I try my best to stay awake during your incredibly dull story.",
  "gloomy.dialogue.story.fail/9": "Congratulations, you've crossed the line from crazy in a quirky way to just plain crazy. Impressive.",
  "gloomy.dialogue.story.fail/10": "I fail to see how that was remotely good, but maybe that's just me.",

  "gloomy.dialogue.flirt.success/1": "You're... kind of brave, I guess.",
  "gloomy.dialogue.flirt.success/2": "Oh, you! Stop being... mildly endearing, I suppose.",
  "gloomy.dialogue.flirt.success/3": "*Sighs* Do you actually mean it, or are you just messing with me?",
  "gloomy.dialogue.flirt.success/4": "Oh, well... whatever.",
  "gloomy.dialogue.flirt.success/5": "That was... almost cute, I suppose. It definitely didn't have me at \"hello\" though.",
  "gloomy.dialogue.flirt.success/6": "How do you manage to look... somewhat presentable every day? When I look at you, I feel slightly underwhelmed.",
  "gloomy.dialogue.flirt.success/7": "Oh, please stop it! You're making me... vaguely uncomfortable.",
  "gloomy.dialogue.flirt.fail/1": "If you actually meant those words, I guess I'd be surprised... but not in a good way.",
  "gloomy.dialogue.flirt.fail/2": "Ugh, spare me the recycled lines. The blacksmith used that one on me already...",
  "gloomy.dialogue.flirt.fail/3": "As if that would ever happen. Like, ever.",
  "gloomy.dialogue.flirt.fail/4": "Wow, and here I thought I've seen it all. Guess I was wrong, you're even more pitiful than I imagined.",
  "gloomy.dialogue.flirt.fail/5": "Seriously? You think you stand a chance? Please, even a creeper has more charm than you.",
  "gloomy.dialogue.flirt.fail/6": "Oh, please don't continue with that nonsense. It's just painful to witness.",
  "gloomy.dialogue.flirt.fail/7": "That look in your eyes and those words on your lips, they make my gloomy soul shudder. Never, ever utter that again.",

  "gloomy.dialogue.joke.creative.success/1": "*Sighs* That's... somewhat amusing.",
  "gloomy.dialogue.joke.creative.success/2": "That's... mildly amusing, I suppose.",
  "gloomy.dialogue.joke.creative.success/3": "That's... well, it's certainly better than nothing.",
  "gloomy.dialogue.joke.creative.success/4": "I suppose you're marginally funnier than %Supporter%.",
  "gloomy.dialogue.joke.creative.success/5": "*Chuckles* Wow, you're... somewhat funny, I guess. Have you ever considered a career in comedy? Not that it matters...",
  "gloomy.dialogue.joke.creative.success/6": "Hah... that was... tolerable, I suppose.",
  "gloomy.dialogue.joke.creative.success/7": "*Forced chuckle* You're definitely... a tad funnier than Ash.",
  "gloomy.dialogue.joke.creative.success/8": "Ah... that's actually... somewhat amusing, I must admit.",
  "gloomy.dialogue.joke.creative.failed/1": "You really shouldn't be joking about such things. It's depressing, really.",
  "gloomy.dialogue.joke.creative.failed/2": "Ha. Ha. Yeah, not funny. Just like everything else in this bleak existence.",
  "gloomy.dialogue.joke.creative.failed/3": "Oh, look who's trying to be the life of the sad, sad party. Spoiler alert",
  "gloomy.dialogue.joke.creative.failed/4": "Did you honestly think that feeble attempt at humor would bring even a sliver of joy to this desolate place?",
  "gloomy.dialogue.joke.creative.failed/5": "Oh... That's... Hilarious. Well, not really, but it's the closest thing to a laugh I'll ever have.",
  "gloomy.dialogue.joke.creative.failed/6": "Reaaaal funny. *Sigh* I guess it's amusing in a pathetically desperate kind of way.",
  "gloomy.dialogue.joke.creative.failed/7": "Why in the world would anyone find that remotely amusing? Stick to your day job, if you even have one, that is.",
  "gloomy.dialogue.joke.creative.failed/8": "Ash? Oh, sure. Ash tells such hilarious jokes. Just like this conversation is filled with sunshine and rainbows.",

  "gloomy.dialogue.procreate_engaged/1": "I won't find solace until our union is sealed in matrimony.",
  "gloomy.dialogue.procreate_engaged/2": "It's unimaginable to fathom bringing forth a new existence when our commitment lacks full dedication.",

  "gloomy.dialogue.shake_hand.success/1": "Your grip is... adequate, I suppose.",
  "gloomy.dialogue.shake_hand.success/2": "Your grip reflects a modicum of strength, if I must be honest.",
  "gloomy.dialogue.shake_hand.success/3": "Oh, how polite you seem... not that it matters much.",
  "gloomy.dialogue.shake_hand.success/4": "Another dreary day, isn't it?",
  "gloomy.dialogue.shake_hand.success/5": "Well, well, well... hello there, I guess.",
  "gloomy.dialogue.shake_hand.fail/1": "Seriously? After you butchered the cow? My heart sinks even lower.",
  "gloomy.dialogue.shake_hand.fail/2": "Um, no, spare me the fake gesture. I'm used to disappointment.",
  "gloomy.dialogue.shake_hand.fail/3": "I'm not a stranger, but I understand if you'd rather keep your distance. It's not like anyone cares anyway.",
  "gloomy.dialogue.shake_hand.fail/4": "Wow, really? This isn't like you at all. Not that it matters. Nothing ever does.",
  "gloomy.dialogue.shake_hand.fail/5": "Go away. Leave me to my desolation.",

  "gloomy.dialogue.main.morning/1": "Hi, I guess.",
  "gloomy.dialogue.main.morning/2": "Yeah… morning.",
  "gloomy.dialogue.main.morning/3": "Good morning? Well, if it's good for you…",
  "gloomy.dialogue.main.morning/5": "I have a bad feeling about today.",
  "gloomy.dialogue.main.morning/6": "I don't think I want to talk.",
  "gloomy.dialogue.main.morning/7": "Did you sleep poorly? You look miserable.",
  "gloomy.dialogue.main.morning/8": "Morning grumpy!",
  "gloomy.dialogue.main.morning/9": "What a dreadful morning! I think it's going to be a dreadfully unproductive day today!",
  "gloomy.dialogue.main.morning/10": "I think I might drag myself through today, I'm feeling absolutely dreadful.",
  "gloomy.dialogue.main.morning/11": "I have an overwhelming schedule today, just thinking about it makes me want to crawl back into bed.",
  "gloomy.dialogue.main.morning/12": "I barely got any sleep last night, I might reluctantly do something a bit more demanding today, who knows?",
  "gloomy.dialogue.main.evening/1": "... a few hours away from the night, when the undead come out… great.",
  "gloomy.dialogue.main.evening/2": "Don't you have better things to do? What, I'm only asking.",
  "gloomy.dialogue.main.evening/3": "...",
  "gloomy.dialogue.main.evening/4": "I worry there might be a zombie siege…",
  "gloomy.dialogue.main.evening/5": "There hasn't been a raid in a long time. Does it mean it will be soon?",
  "gloomy.dialogue.main.evening/6": "*Yeah? What do you want?",
  "gloomy.dialogue.main.evening/7": "I believe I shall retire for the evening, for I have endured a terribly arduous morning.",
  "gloomy.dialogue.main.evening/8": "I shall retreat indoors posthaste, for in the previous month, I encountered a menacing creeper, and henceforth I dare not wander the nocturnal realm.",
  "gloomy.dialogue.main.evening/9": "Ah, greetings! I was procuring sustenance for the evening repast at the esteemed butcher's shop. Farewell for now!",
  "gloomy.dialogue.main.night/1": "... it's kind of hard to sleep when you know monsters are nearby.",
  "gloomy.dialogue.main.night/2": "*What do you need from me at this hour?",
  "gloomy.dialogue.main.night/3": "I'm tired but I don't feel like sleeping. It's weird, isn't it?",
  "gloomy.dialogue.main.night/4": "Can't you see I'm trying to sleep?",
  "gloomy.dialogue.main.night/5": "... can't you at least bother me at some normal hour?",
  "gloomy.dialogue.main.night/6": "At least it's safe during the day. I can't wait until it's finally morning.",
  "gloomy.dialogue.main.night/7": "The hustle and bustle of daylight hours always gets to me. It's a relief to wander under the starry skies, soaking in the melancholic silence.",
  "gloomy.dialogue.main.night/8": "The weariness has seeped into my bones. This long-drawn-out day has drained me completely. Tomorrow's agenda might require a lighter touch, for my own sanity's sake.",
  "gloomy.dialogue.main.night/9": "Oh, the allure of sinking into the comforting embrace of blankets! I yearn to vanish beneath their protective layers, shutting out the world for a while.",
  "gloomy.dialogue.main.night/10": "Sleep beckons, my friend, whispering tales of a demanding tomorrow awaiting your weary soul. It's in your best interest to heed its call and surrender to the realm of dreams.",

  "gloomy.dialogue.greet.mayor/1": "Another gloomy day, mayor.",
  "gloomy.dialogue.greet.mayor/2": "Wishing you a less miserable day, Mayor!",
  "gloomy.dialogue.greet.monarch/1": "Oh, great and utterly sorrowful Majesty.",
  "gloomy.dialogue.greet.monarch/2": "Oh, gloomy and profoundly melancholic Highness.",

  "gloomy.dialogue.busy/1": "I'm sorry, but I have a mountain of work to tackle. Can't chat now.",
  "gloomy.dialogue.busy/2": "As much as I appreciate your company, I'm swamped with work. Gotta prioritize, you know?",
  "gloomy.dialogue.busy/3": "Oh, how I wish I could spare a moment to chat, but alas, I'm drowning in tasks. Maybe later?",
  "gloomy.dialogue.busy/4": "Regrettably, my friend, duty calls. I must focus on my work for now. Let's catch up soon.",
  "gloomy.dialogue.busy/5": "Blast it! I left my anvil unattended! Must dash, but we'll catch up another time.",
  "gloomy.dialogue.goaway/1": "Leave me be.",
  "gloomy.dialogue.goaway/2": "Do you not have more pressing matters to attend to?",
  "gloomy.dialogue.goaway/3": "Apologies, %1$s, I'm unavailable at the moment.",
  "gloomy.dialogue.goaway/4": "Seek another soul to vex!",
  "gloomy.dialogue.goaway/5": "Begone, you wretched soul!",

  "gloomy.dialogue.greet/1": "Hey... How are you doing today?",
  "gloomy.dialogue.greet/2": "Oh, hey %1$s... How's it going?",
  "gloomy.dialogue.greet/3": "Oh, hello. Did you need something? Not that I really care...",
  "gloomy.dialogue.greet/4": "You look ready to take on the day... How's it going, I guess?",
  "gloomy.dialogue.greet/5": "Hello %1$s... It's... good to see you, I suppose.",
  "gloomy.dialogue.greet/6": "Ohai... I guess.",
  "gloomy.dialogue.greet/7": "Nice to see you, I suppose...",
  "gloomy.dialogue.greet/8": "Hello... It's... lovely to see you. How are you today? If you even care to share...",
  "gloomy.dialogue.greet/9": "Hey... Glad to see you, I guess...",

  "gloomy.dialogue.greet.negative/1": "Ugh, why did you have to show up? You're like a dark cloud following me.",
  "gloomy.dialogue.greet.negative/2": "Oh joy, it's you. Just when I thought my day couldn't get any worse.",
  "gloomy.dialogue.greet.negative/3": "Hmph.",
  "gloomy.dialogue.greet.negative/4": "Oh, it's you. I was hoping for a sliver of happiness, but I guess that's too much to ask.",
  "gloomy.dialogue.greet.negative/5": "Back to bother me, are we? Can't you find someone else to pester?",

  "gloomy.dialogue.greet.success/1": "Well, I suppose that's nice to hear...",
  "gloomy.dialogue.greet.success/2": "Oh, you're doing good? How... lovely.",
  "gloomy.dialogue.greet.success/3": "Ah, joy fills my heart to know that.",
  "gloomy.dialogue.greet.success/4": "So glad... I guess.",
  "gloomy.dialogue.greet.success/5": "Huh, good to know... I suppose.",
  "gloomy.dialogue.greet.fail/1": "Sigh...",
  "gloomy.dialogue.greet.fail/2": "Well, if you say so...",
  "gloomy.dialogue.greet.fail/3": "Oh, great...",
  "gloomy.dialogue.greet.fail/4": "Seriously? How wonderful...",
  "gloomy.dialogue.greet.fail/5": "Oh, fantastic...",

  "gloomy.dialogue.apologize.success/1": "Don't worry about it, I'm used to disappointment.",
  "gloomy.dialogue.apologize.success/2": "Oh well, I suppose I'll tolerate your incompetence this once.",
  "gloomy.dialogue.apologize.success/3": "I suppose I can accept your pathetic excuse, but don't let it happen again.",
  "gloomy.dialogue.apologize.success/4": "It's not a big deal, I'm used to people failing miserably.",
  "gloomy.dialogue.apologize.success/5": "Sure, go ahead and ruin everything. It's not like I had any expectations anyway.",
  "gloomy.dialogue.apologize.fail/1": "Leave me be!",
  "gloomy.dialogue.apologize.fail/2": "You intentionally struck me!",
  "gloomy.dialogue.apologize.fail/3": "As if I would ever believe that!",
  "gloomy.dialogue.apologize.fail/4": "The pain lingers, spare me your apologies!",
  "gloomy.dialogue.apologize.fail/5": "Absolutely not a chance!",

  "gloomy.dialogue.location.failed/1": "Sigh, unfortunately, I haven't caught wind of anything new.",
  "gloomy.dialogue.location.failed/2": "Regrettably, my knowledge of any captivating locations is lacking. I apologize.",
  "gloomy.dialogue.location.failed/3": "Alas, I'm afraid not. We villagers have more pressing matters to attend to than gallivanting about in perilous ruins like you adventurers.",
  "gloomy.dialogue.location.forgot/1": "Ah, I stumbled upon the most fascinating spot, yet in my sorrowful nature, I failed to inscribe its coordinates on the map. Alas, my memory fails me once more.",
  "gloomy.dialogue.location.forgot/2": "Are you in search of a captivating place? Ah, I had stumbled upon one, but alas, the tendrils of forgetfulness have ensnared me yet again! Oh, the lament of my weary mind! Please pardon my wretched memory.",
  "gloomy.dialogue.location.forgot/3": "Indeed, there was something of great intrigue, but alas, my feeble mind had forsaken me in the moment! I offer my sincerest apologies for this devastating display of forgetfulness.",
  "gloomy.dialogue.location.igloo/1": "I stumbled upon an igloo at %2$s. Can you believe someone actually thought living in a freezing snow shack was a good idea? Gives me the chills just thinking about it.",
  "gloomy.dialogue.location.igloo/2": "You know what's really depressing? There's this forsaken igloo at %2$s. It's like a long-lost relic from a forgotten age. I bet even ghosts wouldn't dare haunt that desolate place.",
  "gloomy.dialogue.location.igloo/3": "It's quite disheartening, really. There's a lonesome igloo at %2$s, left to the mercy of the icy winds. I reckon it's been deserted for ages, probably because it's more suitable for penguins than humans.",
  "gloomy.dialogue.location.pyramid/1": "I caught a glimpse of a pyramid over at %2$s. It's nothing but a cursed tomb, waiting to claim its next victim.",
  "gloomy.dialogue.location.pyramid/2": "Rumor has it, there's a cursed pyramid lurking in %2$s. Dare to enter its treacherous depths and you might just meet your doom.",
  "gloomy.dialogue.location.pyramid/3": "Ah, %2$s... I'm afraid it harbors a pyramid that reeks of darkness and despair. Long ago, a foolhardy explorer ventured in, never to return. Proceed with utmost caution, if you dare.",
  "gloomy.dialogue.location.ruined_portal_desert/1": "A solemn spectacle it is, a portal shattered and abandoned in the vast expanse of this lifeless desert.",
  "gloomy.dialogue.location.ruined_portal_swamp/1": "Ah, behold the wretched sight! A ruined portal lies desolate at %2$s, engulfed by this wretched swamp. The cursed souls from the Nether must have been utterly dismayed to have emerged in such a forsaken wasteland.",
  "gloomy.dialogue.location.ruined_portal/1": "The desolation that awaits you at %2$s is haunting. A once majestic portal now reduced to rubble, a stark reminder of the Nether's merciless invasion.",
  "gloomy.dialogue.location.ruined_portal/2": "Venture forth to %2$s, if you dare. Amongst the wreckage of a shattered nether portal, an eerie aura lingers. It sends shivers down your spine, but perhaps it holds secrets yet uncovered. Approach with caution, or risk being consumed by the darkness within.",
  "gloomy.dialogue.location.ruined_portal/3": "Hidden within the desolate grounds of %2$s lie the remnants of a once grandiose nether portal. Whispers of lost treasures and untold horrors surround its decayed facade. None possess the courage to venture into its depths, for fear of awakening the ancient evils lurking within.",
  "gloomy.dialogue.location.ruined_portal_mountain/1": "Behold the tragedy that befalls %2$s - a mountain now tainted by the remnants of a shattered portal.",
  "gloomy.dialogue.location.mansion/1": "Ah, the dreaded mansion lurking at %2$s. One glimpse of that wretched place and all hope fades away. Stay clear, my friend, for it is a cursed abode where darkness reigns.",
  "gloomy.dialogue.location.mansion/2": "Have you heard of the haunted mansion over at %2$s? A chilling presence looms in the air, and I can't help but wonder if we should gather our belongings and flee this forsaken village.",
  "gloomy.dialogue.location.monument/1": "Be warned, there lies a forsaken fortress plagued by mythical beasts beneath the waves at %2$s. Best not to venture near it, for darkness lurks within.",
  "gloomy.dialogue.location.monument/2": "Whispers speak of long-lost remnants buried in the depths of the ocean at %2$s. A fortune may await you there, but mind you, peril awaits at every turn.",
  "gloomy.dialogue.location.shipwreck/1": "Alas, a sunken vessel lies beneath the waves at %2$s. Once a proud artifact of the Eastern Alliance Company, now a haunting reminder of their tragic demise.",
  "gloomy.dialogue.location.shipwreck/2": "Have you heard the whispers of a shipwreck at %2$s? It is said that lost treasures lurk within its watery tomb, waiting to be discovered... or perhaps cursed.",
  "gloomy.dialogue.location.shipwreck_beached/1": "Ah, there's a shipwreck over yonder at %2$s. It's a sad sight, washed ashore on the beach. Hard to miss, really.",
  "gloomy.dialogue.location.shipwreck_beached/2": "Venture forth to %2$s, my friend, and you shall stumble upon a forlorn ship stranded upon the sandy shores. One can't help but wonder about the tragic tale behind its demise...",
  "gloomy.dialogue.location.village_desert/1": "Welcome, traveler, to yet another desolate village, a testament to the sorrowful existence bestowed upon those who dwell in this arid desert.",
  "gloomy.dialogue.location.village_taiga/1": "Over yonder lies a desolate village, nestled amidst the melancholic depths of the taiga biome.",
  "gloomy.dialogue.location.village_taiga/2": "Venture forth to %2$s, where a forsaken village awaits. It lies deep within the heart of the taiga biome, a haunting sight to behold.",
  "gloomy.dialogue.location.village_snowy/1": "Over yonder lies yet another forsaken village. The bitter cold chills you to the bone, I tell ya.",
  "gloomy.dialogue.location.village_snowy/2": "Ah, there be a village at %2$s in the desolate snowy plains. The souls there may seem friendly, but trust me, it's a frigid abyss that'll freeze your very soul!",
  "gloomy.dialogue.location.village_plains/1": "Somewhere in the distance, shrouded in gloom, lies yet another forsaken village.",
  "gloomy.dialogue.location.village_plains/2": "Venture into the desolate plains, where sadness blankets the land, and you shall stumble upon another village, lost and forgotten.",
  "gloomy.dialogue.location.village_savanna/1": "Over there, at %2$s, lies another village. The scorching heat engulfs everything in its relentless grip.",
  "gloomy.dialogue.location.village_savanna/2": "Venture into the savanna at %2$s, and you'll stumble upon yet another village. The people there... well, they're as pleasant as the never-ending gloom.",
  "gloomy.dialogue.location.swamp_hut/1": "The swamp over yonder at %2$s, it's a wretched place haunted by a wicked witch. I'd steer clear if I were you, my friend.",
  "gloomy.dialogue.location.swamp_hut/2": "Take a word of caution, my dear. That accursed swamp at %2$s is home to a despicable witch, and the vibe there is as gloomy as can be. Best to stay far away if you value your peace of mind.",
  "gloomy.dialogue.location.mineshaft/1": "This place used to be a thriving mine, but it's nothing more than a cursed pit now. You can find it at %2$s if you dare to venture into its depths.",
  "gloomy.dialogue.location.mineshaft/2": "Ah, the forsaken mine that used to be here, located at %2$s. It's plagued with unspeakable horrors, so be cautious if you have the audacity to explore its treacherous corridors.",
  "gloomy.dialogue.location.jungle_pyramid/1": "You'd better steer clear of %2$s, mate. There's this cursed old temple lurking about. Step foot in there, and you'll be playing a deadly game of cat and mouse with its treacherous traps.",
  "gloomy.dialogue.location.jungle_pyramid/2": "Ah, the infamous %2$s in the eerie depths of the jungle. Legends say it's haunted by ancient spirits. If you're brave enough to venture there, just remember one thing - those traps? They've claimed more souls than you can count. So, tread lightly, my friend.",
  "gloomy.dialogue.location.pillager_outpost/1": "Oh great, just what we needed. The pillagers decided to grace us with their presence at %2$s. I can already feel the impending doom hanging over us. Maybe if we're lucky, they'll spare us this time... but I highly doubt it.",
  "gloomy.dialogue.location.pillager_outpost/2": "Do you know what's even worse than a haunted house? A pillager outpost at %2$s. Those miserable creatures have made it their home, and now we're stuck dealing with their constant threats. It's like living in a nightmare that never ends.",
  "gloomy.dialogue.location.pillager_outpost/3": "Ah, %2$s... the land where the pillagers have chosen to torment us. If you're feeling brave (or perhaps just plain foolish), you could venture there and try to rid us of those despicable pillagers. But be warned, their wickedness knows no bounds.",
  "gloomy.dialogue.location.ancient_city/0": "I have been haunted by eerie sounds emanating from %2$s, echoing through the depths of darkness.",
  "gloomy.dialogue.location.ancient_city/1": "My weary soul senses a concealed secret lurking in the depths beneath %2$s, a sinister presence long forgotten.",
  "gloomy.dialogue.location.ancient_city/3": "Tales speak of an ancient city enveloped by the shadows, concealed beneath %2$s. Alas, my eyes have not beheld its existence, for it resides in the hidden depths.",

  "gloomy.dialogue.joke.monster.success/1": "Hmph. That Skelly got what it deserved, I suppose.",
  "gloomy.dialogue.joke.monster.success/2": "Ah, so the zombie attempted to bludgeon you with a shovel? How... amusing.",
  "gloomy.dialogue.joke.monster.success/3": "You managed to assert your dominance over that spider, didn't you? Ha, ha...",
  "gloomy.dialogue.joke.monster.success/4": "Ah, fascinating. You actually convinced a skeleton to eliminate a creeper? Quite the achievement, I must say. Ha!",
  "gloomy.dialogue.joke.monster.success/5": "Ha... how utterly predictable. Cave spiders, as dense as ever.",
  "gloomy.dialogue.joke.monster.failed/1": "Wretched souls, skeletons roam this land with a haunting purpose! You mock them at your peril!",
  "gloomy.dialogue.joke.monster.failed/2": "In this desolate realm of despair, who finds amusement in jests of creepers' explosive demise? A truly twisted soul, I say!",
  "gloomy.dialogue.joke.monster.failed/3": "Behold, the pitiable fate of zombies and skeletons, once human like ourselves. Their tragedy should stir sorrow, not jests!",
  "gloomy.dialogue.joke.monster.failed/4": "How utterly underwhelming... an enderman clumsily stumbling into a pool of water. How original, how tragically mundane.",
  "gloomy.dialogue.joke.monster.failed/5": "Oh, the abysmal humor of this world! Silverfish ambushes on the privy, a joke so dreary that it befalls me yet again. Alas, my fortune grows by a mere pittance, but the peculiarity remains unsettling.",

  "gloomy.dialogue.joke.animal.success/1": "How unfortunate it is for the sheep to lose its wool, what a tragicomedy!",
  "gloomy.dialogue.joke.animal.success/2": "And thus began the doomed love affair between the wolf and the sheep...",
  "gloomy.dialogue.joke.animal.success/3": "Oh, the absurdity! Who would have thought that chickens are capable of such folly?",
  "gloomy.dialogue.joke.animal.success/4": "Oh, how utterly foolish! I find myself strangely drawn to this brand of humor...",
  "gloomy.dialogue.joke.animal.success/5": "Ah, the one silver lining in this bleak existence - the cows' infinite milk supply!",
  "gloomy.dialogue.joke.animal.failed/1": "I fail to see the humor in such matters.",
  "gloomy.dialogue.joke.animal.failed/2": "Oh, the tragedy! Such a woeful attempt at humor.",
  "gloomy.dialogue.joke.animal.failed/3": "Spare me your jests about my swine companion.",
  "gloomy.dialogue.joke.animal.failed/4": "How utterly depressing.",
  "gloomy.dialogue.joke.animal.failed/5": "How dare you mock the cow's dignified arches of furrowed brow!",

  "gloomy.dialogue.flirt.slap/1": "Pardon your intrusion!",
  "gloomy.dialogue.flirt.slap/2": "Did a Desolate Zombie teach you how to flirt?!",
  "gloomy.dialogue.kiss.slap/1": "Oh, the audacity!",
  "gloomy.dialogue.kiss.slap/2": "Make that mistake once more, and the consequences will be unforgettable!",

  "gloomy.dialogue.chat.plains/1": "The plains... it's all I've ever known. I've never ventured beyond these monotonous fields. Maybe one day, if I could muster the courage...",
  "gloomy.dialogue.chat.plains/2": "The plains. So dreadfully dull and uneventful. While others seek adventure in more vibrant biomes, I am resigned to this mundane existence. How I long for a change of scenery...",
  "gloomy.dialogue.chat.plains/3": "The plains at night... a hauntingly beautiful sight, I suppose. The silence is suffocating, the emptiness overwhelming. It's as if even the darkness itself finds solace in this desolation.",
  "gloomy.dialogue.chat.plains/4": "Nights like these, I find myself lying on the grass, gazing up at the vast expanse of the sky. The stars mock me with their distant sparkles, reminding me of the insignificance of my existence.",
  "gloomy.dialogue.chat.plains/5": "The air here... crisp and lifeless. It lacks the raw vitality of the taiga, but I suppose it's marginally better than the stale stench of other biomes. A small consolation in this barren wasteland.",
  "gloomy.dialogue.chat.plains/6": "The plains... plain and simple, just like my joyless existence. Yet, in this sea of monotony, there is a certain comfort. Perhaps simplicity is the only solace I can find in this bleak world.",
  "gloomy.dialogue.chat.plains/7": "This weather... it brings back bittersweet memories of my childhood. Days when I would pluck flowers from these very fields, hoping to impress my unrequited love, Ash. But alas, even then, my efforts were in vain.",
  "gloomy.dialogue.chat.plains/8": "The sunrise in the plains... a fleeting moment of transient beauty. But what good is beauty when it only serves to highlight the barrenness that surrounds me? Perhaps you should witness it, if only to understand my melancholic plight.",
  "gloomy.dialogue.chat.savanna/1": "The heat in this savanna is unbearable, it never lets up. At least we don't have to worry about freezing to death in the winter.",
  "gloomy.dialogue.chat.savanna/2": "Those llamas are driving me mad, always spitting and causing a ruckus. But I guess it's just another joy of living in this cursed place.",
  "gloomy.dialogue.chat.savanna/3": "The architecture here in the savanna is nothing to write home about. It's as dull and lifeless as the rest of this forsaken biome.",
  "gloomy.dialogue.chat.savanna/4": "Don't even bother trying to find anything interesting in this plain and monotonous savanna. There's nothing worth mentioning here.",
  "gloomy.dialogue.chat.savanna/5": "Rivers? Ha! That's the only thing we have going for us. But what use are they when there's nothing else to enjoy in this desolate wasteland?",
  "gloomy.dialogue.chat.savanna/6": "The so-called \"interesting\" hills and terrains here are nothing but a cruel joke. It's a sad excuse for a landscape.",
  "gloomy.dialogue.chat.savanna/7": "The only relief from this scorching heat is the pathetic shade provided by those acacia trees. It's barely enough to survive the workdays.",
  "gloomy.dialogue.chat.savanna/8": "Melons and pumpkins? Well, I guess it's the only thing we can boast about in this miserable savanna. Trade with other villages? Who needs 'em anyway?",
  "gloomy.dialogue.chat.taiga/1": "The woods... they're just so dreary. All they offer is rotting timber, useless firewood, and a haven for pests.",
  "gloomy.dialogue.chat.taiga/2": "They say it's cold here in the taiga biome, and honestly, they're not wrong. We're stuck in this freezing wasteland with nothing to do. No wonder we're all so miserable.",
  "gloomy.dialogue.chat.taiga/3": "Taiga forests are... okay, I guess. The sweet berries are the only thing that brings a hint of joy to this desolate place.",
  "gloomy.dialogue.chat.taiga/4": "Foxes in the taiga forests? Ugh, don't even get me started. They're nothing but trouble, always sneaking around and causing chaos. I wish they'd just disappear.",
  "gloomy.dialogue.chat.taiga/5": "Wolves here are supposedly tame, but honestly, they're just another nuisance to deal with. Always lurking around, hoping to snatch our meager food supply.",
  "gloomy.dialogue.chat.taiga/6": "The fresh crisp air in the taiga... it's like a constant reminder of how isolated we are. No wonder it's so suffocating.",
  "gloomy.dialogue.chat.taiga/7": "Those sweet berry bushes? Yeah, they might have decent berries, but getting pricked by one is just another painful reminder of how everything in this place is out to get us.",
  "gloomy.dialogue.chat.taiga/8": "The cold, relentless rain in the taiga is just the cherry on top of this miserable existence. It may be peaceful, but it's a peace I'd gladly trade for warmth and civilization.",
  "gloomy.dialogue.chat.snowy_plains/1": "It's so painfully cold here. I can barely feel my fingers, even with all the firewood in the world.",
  "gloomy.dialogue.chat.snowy_plains/2": "This frozen wasteland is absolutely unbearable. I try to laugh, but it just comes out as a hollow, joyless sound.",
  "gloomy.dialogue.chat.snowy_plains/3": "The weather outside is frightful, and all I want to do is curl up in my blanket and hibernate until spring.",
  "gloomy.dialogue.chat.snowy_plains/4": "The snow brings back painful memories of a time when happiness was within reach. Now, it feels like a distant dream.",
  "gloomy.dialogue.chat.snowy_plains/5": "The strays in this village are the epitome of annoyance. Their tipped arrows are like daggers to my already wounded spirit.",
  "gloomy.dialogue.chat.snowy_plains/6": "Beware of the wolves lurking nearby. Their presence is a chilling reminder of the dangers that surround us.",
  "gloomy.dialogue.chat.snowy_plains/7": "Touching an iron golem is like embracing a relentless punishment. You're trapped in its grip, with no escape in sight.",
  "gloomy.dialogue.chat.snowy_plains/8": "My childhood was filled with fleeting moments of joy. I remember my parents bringing me a pumpkin, but those memories are tainted with the bitter taste of loss.",
  "gloomy.dialogue.chat.desert/1": "It's scorching here in the desert, and it feels like winter will never come.",
  "gloomy.dialogue.chat.desert/2": "This desert is relentlessly warm all year round.",
  "gloomy.dialogue.chat.desert/3": "Although it's hot here in the desert, I can never escape this perpetual tan or the constant risk of sunburn.",
  "gloomy.dialogue.chat.desert/4": "The nights may offer a cooler respite, but the barren beauty of the starry sky only adds to the desolation.",
  "gloomy.dialogue.chat.desert/5": "Goodness gracious! I can't believe how scorching the sun is today.",
  "gloomy.dialogue.chat.desert/6": "Goodness gracious! The sun is absolutely unbearable today!",
  "gloomy.dialogue.chat.desert/7": "Have you managed to spot any rabbits? They're practically invisible in this desolate place!",
  "gloomy.dialogue.chat.desert/8": "One major drawback of living here are those pesky husks. They have a knack for draining all your energy! How unfair!",
  "gloomy.dialogue.chat.desert/9": "I'll have you know, I pricked myself on a cactus the other day. One must tread with utmost caution in this forsaken land!",
  "gloomy.dialogue.chat.desert/10": "Life in this arid desert is an eternal struggle, but thank heavens for this village where we can find some solace in water and food.",

  "gloomy.dialogue.story.exploring.success/1": "Bleh... I'll probably never get to explore the world, just stuck here in this dull village.",
  "gloomy.dialogue.story.exploring.success/2": "Ugh... I guess it must be nice to travel and explore. I mean, I love my village, family, and friends... but hearing you talk about it just makes me feel even more trapped.",
  "gloomy.dialogue.story.exploring.success/3": "Hmph... I suppose you think you're pretty brave, huh? Going out into the unknown like that. Must be nice to not have any responsibilities holding you back.",
  "gloomy.dialogue.story.exploring.fail/1": "Your tales have lost their luster.",
  "gloomy.dialogue.story.exploring.fail/2": "Oh, the incessant repetition of your dreary anecdotes. How utterly dismal.",
  "gloomy.dialogue.story.exploring.fail/3": "Conversing with you is like conversing with a wilted flower that dreams of being a towering oak one day. But without the promise of beauty, unfortunately.",

  "gloomy.dialogue.story.nether.success/1": "Does the heat ever stop burning in that accursed realm?!",
  "gloomy.dialogue.story.nether.success/2": "How on earth are you still breathing in that wretched dimension? It baffles me beyond words.",
  "gloomy.dialogue.story.nether.success/3": "Legends speak of precious treasures hidden in the Nether, but alas, my feeble heart can't bear the thought of venturing there…",
  "gloomy.dialogue.story.nether.success/4": "I can't fathom the courage it takes to traverse the Nether. The very idea sends shivers down my spine. N-Not that I'm easily frightened, of course…",
  "gloomy.dialogue.story.nether.success/5": "Have you ever laid eyes upon the dreaded Zombified Piglin? Its ghastly visage haunts my dreams.",
  "gloomy.dialogue.story.nether.fail/1": "It's highly unlikely that you have ever dared to venture into the Nether, considering your feeble disposition.",
  "gloomy.dialogue.story.nether.fail/2": "Ah, the reason behind your pitiful encounter with those Piglins finally dawns upon me.",
  "gloomy.dialogue.story.nether.fail/3": "Your lack of experience in the Nether is of no concern to me. Frankly, your storytelling skills are abysmal, not worth saving your pitiful existence.",
  "gloomy.dialogue.story.nether.fail/4": "The mere sight of you leaves me doubting your capacity to survive the harsh landscapes of the Nether. You lack the strength, both physically and mentally.",
  "gloomy.dialogue.story.nether.fail/5": "My esteemed ancestor was an avid explorer of the Nether, and yet, the existence of warped fungus was never once mentioned. Clearly, you are nothing more than a deceitful charlatan!",

  "gloomy.dialogue.story.enderdragon.success/1": "Astonishing! And pray tell, have you brought the dragon egg along?",
  "gloomy.dialogue.story.enderdragon.success/2": "Alas! Have you truly vanquished the formidable legend that is the dragon? The village shall forever mourn its demise!",
  "gloomy.dialogue.story.enderdragon.fail/1": "Oh, dear me! Are you completely out of your mind? The ender dragon, a mere figment of imagination, exists only in the depths of despair.",
  "gloomy.dialogue.story.enderdragon.fail/2": "Ha! As if that's even remotely possible! No puny human soul stands a chance against the indomitable might of the ender dragon. It would shatter your feeble attempts like a fragile dream.",

  "gloomy.dialogue.story.wither.success/1": "Oh, the Wither... its devastation knows no bounds. It's said to bring about utter chaos and despair.",
  "gloomy.dialogue.story.wither.success/2": "So, you managed to defeat the Wither... I-I must admit, that's quite impressive, in a haunting sort of way...",
  "gloomy.dialogue.story.wither.fail/1": "I find it hard to trust your words.",
  "gloomy.dialogue.story.wither.fail/2": "You appear remarkably intact for such a tragic tale.",

  "gloomy.dialogue.stay.fail/1": "No thanks, I'm more of a wanderer in this desolate existence.",
  "gloomy.dialogue.stay.fail/2": "Your inquiry is appreciated, but I find solace in traversing the desolate corners of this world.",
  "gloomy.dialogue.stay.fail/3": "This village may be pleasant, but my heart yearns for the unknown, for I am but a lost soul in search of adventure.",
  "gloomy.dialogue.stay.repeat/1": "I'm afraid I have already addressed that inquiry of yours.",
  "gloomy.dialogue.stay.repeat/2": "Alas, your query has been posed once before, dear interlocutor.",
  "gloomy.dialogue.stay.success/1": "I suppose I could stay in this dreary village.",
  "gloomy.dialogue.stay.success/2": "Well, I guess I could stick around this miserable village.",
  "gloomy.dialogue.stay.no_space/1": "Sigh, it's just too crowded in this village, isn't it?",
  "gloomy.dialogue.stay.no_space/2": "I would have considered staying, but alas, there are no cozy beds to rest my weary soul.",

  "gloomy.dialogue.hire/1": "Fine, I suppose I can offer my limited assistance. Notify me when you require aid, although I cannot guarantee my enthusiasm.",
  "gloomy.dialogue.hire/2": "Oh, marvelous. Inform me of your need for my presence, and I shall reluctantly oblige in exchange for those wretched emeralds.",
  "gloomy.dialogue.hire/3": "Oh, joy. Prepare yourself for a subpar performance. I suppose I'll be at your beck and call, as long as those pitiful emeralds are in my possession.",
  "gloomy.dialogue.no_money/1": "Sorry, but I'm afraid your pockets aren't deep enough to afford my services.",
  "gloomy.dialogue.no_money/2": "Haha, nice try! But I'm not some bargain bin service. You'll need to dig deeper into your pockets to hire me.",
  "gloomy.dialogue.no_money/3": "Ah, the sweet sound of disappointment. Looks like you'll have to scrape together more emeralds if you want my help.",

  "gloomy.dialogue.main.rock_paper_scissor/1": "Participate in the game of Rock Paper Scissor",
  "gloomy.dialogue.rock_paper_scissor/1": "Rock, paper, scissors, sigh...",
  "gloomy.dialogue.rock_paper_scissor/2": "Prepare to witness my inevitable victory this time!",
  "gloomy.dialogue.rock_paper_scissor.rock/1": "Ugh, rock again. Is this all we ever do?",
  "gloomy.dialogue.rock_paper_scissor.paper/1": "Oh, the perpetual sadness of paper.",
  "gloomy.dialogue.rock_paper_scissor.scissor/1": "Well, what a surprise... scissor.",
  "gloomy.dialogue.rock_paper_scissor.loose.rock/1": "Oh, wonderful. I went with rock, and as usual, it's a one-way ticket to losing town.",
  "gloomy.dialogue.rock_paper_scissor.loose.paper/1": "Sigh, I suppose I'll pick scissors once more.",
  "gloomy.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors are no match for my rock, I dominate!",
  "gloomy.dialogue.rock_paper_scissor.win.rock/1": "Oh great, just my luck. Rock beats scissors, so I guess I'm the big loser here.",
  "gloomy.dialogue.rock_paper_scissor.win.paper/1": "Rock's victory is a never-ending sorrow for me.",
  "gloomy.dialogue.rock_paper_scissor.win.scissor/1": "Sigh... Scissors have proven their dominance once more.",
  "_": ""
}