{
  "sensitive.dialogue.main/1": "Oh, um, hello there...",
  "sensitive.dialogue.main/2": "Hi... I hope you're doing well today.",
  "sensitive.dialogue.main/3": "Hey, it's nice to see you... I guess.",
  "sensitive.dialogue.main/4": "Um, what's happening with you today?",
  "sensitive.dialogue.main/5": "How are you feeling today?",
  "sensitive.dialogue.main/6": "Oh, hey %1$s... Is anything new?",
  "sensitive.dialogue.main/7": "Oh, speaking of %supporter%, I heard they had a little encounter with a zombie... It was quite... um, interesting. But, um, never mind that, I saw a zombie that kind of reminded me of %supporter% earlier... it was, um, quite strange.",

  "sensitive.dialogue.rumors.failed/1": "Hmm, it seems that I haven't stumbled upon any intriguing news lately.",
  "sensitive.dialogue.rumors.lore/1": "It seems that Jax's following is still going strong, but I must say, the popularity of Sirben is on the rise. Those devoted messengers, MerlinWolfGames and Crow, are tirelessly spreading his divine teachings.",
  "sensitive.dialogue.rumors.lore/2": "Oh, dear friend, we were once besieged by those dreadful Cyberdemons. They dared to infiltrate our peaceful realm through ghastly Portals. But thanks to the heroics of Sirben and the valiant Luke, they were swiftly vanquished, halting the invasion in its tracks.",
  "sensitive.dialogue.rumors.lore/3": "Whispers have reached my ears that 2DA50, entangled in the enigma of the Ancient Builder's disappearance, embarked on a treacherous journey to the Far Lands. Alas, no tidings of their fate have ever graced our ears since.",
  "sensitive.dialogue.rumors.lore/4": "Marvelous tales spread of MerlinWolfGames, the skilled architect who crafted a magnificent temple paying homage to the almighty Sirben. It stands tall among our ancient wonders, a testament to their unwavering devotion.",
  "sensitive.dialogue.rumors.lore/5": "Once upon a time, a majestic race of builders roamed our lands, their skills unmatched and their creations awe-inspiring. However, as the sands of time shifted, they vanished without a trace, leaving behind only echoes of their once-great existence.",
  "sensitive.dialogue.rumors.lore/6": "Have you had the pleasure of hearing the captivating legends surrounding the ancient builders? Oh, they were a remarkable bunch, crafting intricate ruins and majestic temples that dot the sprawling landscapes of the Overworld. Such tales never fail to ignite the imagination!",

  "sensitive.dialogue.first.generic/1": "Greetings, stranger! Your presence here brings a sense of novelty and excitement to our humble village.",
  "sensitive.dialogue.first.generic/2": "Ah, a newcomer! How delightful! Your arrival injects a breath of fresh air into our monotonous routine.",
  "sensitive.dialogue.first.generic/3": "Well, well, well! Look who we have here! A mysterious traveler gracing us with their presence. Welcome, welcome!",
  "sensitive.dialogue.first.generic/4": "Oh my, a stranger in our midst! How intriguing! Do share your tales of adventure with us, won't you?",
  "sensitive.dialogue.first.generic/5": "It feels like ages since we've had the pleasure of hosting a traveler. Make yourself at home, dear wanderer!",
  "sensitive.dialogue.first.generic/6": "Why, hello there! The sight of a new face fills me with joy! Welcome to our village, dear newcomer.",

  "sensitive.dialogue.first.question/1": "Greetings, dear visitor. What has led you to grace our humble village with your presence?",
  "sensitive.dialogue.first.question/2": "Oh, what a delight it is to encounter someone new! Pray tell, what marvelous quest has led you to our village?",
  "sensitive.dialogue.first.question/3": "Oh my! You seem to possess the spirit of an adventurer within you. Pray, share with me the tale of how you found your way to our village.",
  "sensitive.dialogue.first.exploring/1": "Our humble abode may not offer much, but we graciously extend our hospitality to you, dear visitor. Just remember to respect our rules.",
  "sensitive.dialogue.first.exploring/2": "Welcome, esteemed wanderer. Should you choose to honor our regulations, you will find solace within our humble dwelling.",
  "sensitive.dialogue.first.exploring/3": "Ah, greetings, dear traveler. We extend our warm welcome, on the condition that you conduct yourself with utmost decorum, respecting our established conventions.",
  "sensitive.dialogue.first.settling/1": "How wonderful it is to behold another visage gracing our humble village!",
  "sensitive.dialogue.first.settling/2": "Ah, a warm greeting to you, dear newcomer! Welcome to our little haven!",
  "sensitive.dialogue.first.settling/3": "Delighted I am to witness the arrival of an additional helping hand in these parts!",
  "sensitive.dialogue.first.settling/4": "Oh, you've chosen to stay? How utterly splendid! Our village shall benefit greatly from your presence!",
  "sensitive.dialogue.first.spent_night.success/1": "Ah, I see you're in need of a place to rest. Allow me to suggest our cozy inn, where comfort and tranquility await.",
  "sensitive.dialogue.first.spent_night.success/2": "If you're seeking solace and a chance to recharge, look no further than our esteemed inn. It's renowned for its unparalleled ambiance and rejuvenating offerings.",
  "sensitive.dialogue.first.spent_night.success/3": "Craving a peaceful haven with delectable meals to refuel your weary soul? Embark on a delightful journey to our inn; a sanctuary of warmth and culinary delights.",
  "sensitive.dialogue.first.spent_night.failed/1": "Oh, alas! Our humble village lacks the wondrous art of inn construction. Please forgive our incompetence!",
  "sensitive.dialogue.first.spent_night.failed/2": "I deeply regret to inform you that our village, regrettably, does not possess an inn. I offer my sincerest apologies for this inconvenience!",
  "sensitive.dialogue.first.spent_night.failed/3": "Ah, fellow traveler, it pains me to say that our village cannot provide you with the sanctuary of an inn. Perhaps, if you venture forth, you may stumble upon a more hospitable abode in another village.",

  "sensitive.dialogue.hug.success/1": "Wow, I can't believe it's been ages since we last met!",
  "sensitive.dialogue.hug.success/2": "I truly appreciate your kind gesture, it means more to me than you can imagine.",
  "sensitive.dialogue.hug.success/3": "Amidst a rather gloomy day, your hug managed to bring a glimmer of light into my life.",
  "sensitive.dialogue.hug.success/4": "Your embrace is like the softness of a cloud, it truly brings me comfort.",
  "sensitive.dialogue.hug.success/5": "Oh, how delightful! Your hug fills me with warmth and gratitude. Allow me to reciprocate this affection!",
  "sensitive.dialogue.hug.success/6": "Goodness gracious, your embrace is like a cozy fireplace on a chilly winter night. You radiate such wonderful warmth!",
  "sensitive.dialogue.hug.fail/1": "Oh my, you seem to be quite dirty and messy!",
  "sensitive.dialogue.hug.fail/2": "I appreciate the offer, but I'll pass, thank you.",
  "sensitive.dialogue.hug.fail/3": "I'm sorry, but I'm not really comfortable with hugs.",
  "sensitive.dialogue.hug.fail/4": "Remember when you compared me to a caveman? Yeah, I'll have to decline.",
  "sensitive.dialogue.hug.fail/5": "Honestly, considering how you treated me, I don't think you deserve a hug.",
  "sensitive.dialogue.hug.fail/6": "Ugh, please keep your germs to yourself! I'm not a fan of physical contact.",
  "sensitive.dialogue.hug.fail/7": "Oh, um, well... thank you, I suppose? I'm not quite sure how to react.",

  "sensitive.dialogue.kiss.success/1": "This moment is so beautiful, I wish it could go on forever.",
  "sensitive.dialogue.kiss.success/2": "I believe my heart is filled with love for you...",
  "sensitive.dialogue.kiss.success/3": "Mmm, this kiss is as delightful as the sweetest pumpkin pie!",
  "sensitive.dialogue.kiss.success/4": "Mmm! Your lips are as sweet as honey.",
  "sensitive.dialogue.kiss.success/5": "Oh! You, %1$s, are an exceptional kisser.",
  "sensitive.dialogue.kiss.success/6": "%1$s, your kisses are even more enchanting than Ash's! *giggles*",
  "sensitive.dialogue.kiss.fail/1": "I must insist on keeping our affection discreet, for fear of prying eyes.",
  "sensitive.dialogue.kiss.fail/2": "Is that what you call a kiss? My dear, I'm afraid it fell quite short of my expectations.",
  "sensitive.dialogue.kiss.fail/3": "Oh, Ash, now there's someone who knows how to deliver a proper kiss. Your attempts pale in comparison, I'm afraid.",
  "sensitive.dialogue.kiss.fail/4": "A little tip, darling – two words",
  "sensitive.dialogue.kiss.fail/5": "Thank you, I suppose? Though I must admit, your kissing skills leave much to be desired.",
  "sensitive.dialogue.kiss.fail/6": "Please, kindly remove yourself from my personal space. I appreciate the sentiment, but physical contact is not my cup of tea.",

  "sensitive.dialogue.chat.success/1": "Oh my, the thought of warm, freshly baked cookies and a glass of cold milk is simply delightful!",
  "sensitive.dialogue.chat.success/2": "It's such a splendid day, isn't it? The sun is shining so beautifully.",
  "sensitive.dialogue.chat.success/3": "Oh dear, I had a rather unfortunate incident this morning. I accidentally stubbed my toe when I woke up. Ouch!",
  "sensitive.dialogue.chat.success/4": "You know, they say that an apple a day keeps those dreadful zombies at bay!",
  "sensitive.dialogue.chat.success/5": "My deepest aspiration is to create my very own village, but alas, my lazy nature seems to always get the best of me.",
  "sensitive.dialogue.chat.success/6": "I do believe I caught a glimpse of %Supporter% recently, strutting around in the most enchanting diamond armor.",
  "sensitive.dialogue.chat.success/7": "Oh, you wouldn't believe the news! My dear friend %Supporter% stumbled upon a treasure chest brimming with magnificent diamonds just yesterday!",
  "sensitive.dialogue.chat.success/8": "Isn't the weather absolutely extraordinary? Personally, I find great pleasure in basking in the warm rays of sunshine.",
  "sensitive.dialogue.chat.success/9": "I've resided in this village for my entire existence, and I simply cannot fathom what all the fuss is about with these bothersome spiders and goblins.",
  "sensitive.dialogue.chat.success/10": "Oh, I do wonder what has become of %Supporter%. It has been nearly a year since they embarked on their grand adventure from here.",
  "sensitive.dialogue.chat.success/12": "Pray tell, have you heard the extraordinary tale of %Supporter%'s recent escapades?",
  "sensitive.dialogue.chat.success/13": "Lately, I have been longing to provide a loving home to one of those charming stray cats that grace our village. Sadly, my busy schedule has hindered me.",
  "sensitive.dialogue.chat.success/14": "I yearn to revamp my humble abode with a touch of elegance and style. Alas, my laziness always gets the better of me.",
  "sensitive.dialogue.chat.success/15": "Ah, my heart desires to one day have children, but alas, I must first find the perfect partner to embark on that joyous journey with.",
  "sensitive.dialogue.chat.success/16": "I often ponder what life would have been like had I chosen to reside in the neighboring village. Oh, the possibilities!",
  "sensitive.dialogue.chat.success/17": "There are moments when I find myself reminiscing about my childhood, cherishing all those delightful memories. Ah, such blissful times.",
  "sensitive.dialogue.chat.success/18": "It has been quite some time since I last conversed with my beloved parents. I truly ought to pay them a visit soon.",
  "sensitive.dialogue.chat.success/19": "I have been yearning to venture to the nearby village, where a few dear friends reside. It has been far too long since we last gathered.",
  "sensitive.dialogue.chat.success/20": "Sometimes, in my wil",
  "sensitive.dialogue.chat.fail/1": "Can you believe what just happened? It's hard for me to wrap my head around it.",
  "sensitive.dialogue.chat.fail/2": "I find it difficult to accept that it exploded without any external factors.",
  "sensitive.dialogue.chat.fail/3": "You know, you may not be as impressive as you think you are.",
  "sensitive.dialogue.chat.fail/4": "Look at you, always trying to show off.",
  "sensitive.dialogue.chat.fail/5": "Ugh, please go away. Your fashion sense is outdated.",
  "sensitive.dialogue.chat.fail/6": "I don't mean to be rude, but that topic seems quite foolish to discuss.",
  "sensitive.dialogue.chat.fail/7": "Why do you keep coming back to talk to me? Can't you take a hint?",
  "sensitive.dialogue.chat.fail/8": "Sorry, I didn't catch that. My mind was elsewhere, not interested in what you were saying.",
  "sensitive.dialogue.chat.fail/9": "Pardon me? I'm not sure I understand why you're talking about this.",
  "sensitive.dialogue.chat.fail/10": "Seriously, why are you so fixated on this? It's making me question your sanity.",
  "sensitive.dialogue.chat.fail/11": "I've heard some negative things about you, and now I can see why people think that.",
  "sensitive.dialogue.chat.fail/12": "Even zombies would rather avoid conversing with you.",
  "sensitive.dialogue.chat.fail/13": "You're about as pleasant as a witch's curse, if you ask me.",
  "sensitive.dialogue.chat.fail/14": "If you don't stop talking to me, I'll have no choice but to call for assistance to keep you away.",
  "sensitive.dialogue.chat.fail/15": "Oh, sorry. I must admit, your conversation didn't capture my attention.",
  "sensitive.dialogue.chat.fail/16": "Are we done here? Because I have better things to do than listen to you.",
  "sensitive.dialogue.chat.fail/17": "I wonder if anyone would even notice if you suddenly stopped talking forever.",
  "sensitive.dialogue.chat.fail/18": "I'd rather stare at a pig's behind than engage in a conversation with you.",
  "sensitive.dialogue.chat.fail/19": "Are you finally finished bothering me with your talk?",
  "sensitive.dialogue.chat.fail/20": "Wait, hold on. You actually believe the Earth is round? No edges or corners? That's just absurd.",
  "sensitive.dialogue.chat.fail/21": "Oh, please tell me you don't actually think the earth is round! I mean, how can anyone believe such nonsense? It's absurd to think there are no corners on our planet!",

  "sensitive.dialogue.story.success/1": "Oh my goodness, I am absolutely astonished by everything that transpired!",
  "sensitive.dialogue.story.success/2": "If only I possessed the courage to confront a creeper, I truly envy your bravery.",
  "sensitive.dialogue.story.success/3": "Your storytelling is absolutely captivating! Is this an original masterpiece?",
  "sensitive.dialogue.story.success/4": "Hold on, all of this occurred just yesterday? I simply cannot fathom it!",
  "sensitive.dialogue.story.success/5": "It's quite baffling! I was in the vicinity yesterday, and yet I haven't heard a whisper about this.",
  "sensitive.dialogue.story.success/6": "Oh, how delightful! %Supporter% is undeniably a remarkable individual.",
  "sensitive.dialogue.story.success/7": "The Legend of %Supporter% has graced my ears countless times, but please, indulge me once more!",
  "sensitive.dialogue.story.success/8": "Aha! So that's the enchanting tale of how you stumbled upon your first diamond?",
  "sensitive.dialogue.story.success/9": "You must absolutely pay me a visit later! I would be absolutely thrilled to listen to more of your adventures.",
  "sensitive.dialogue.story.fail/1": "Excuse me, but I must insist that you refrain from speaking ill of my dear mother.",
  "sensitive.dialogue.story.fail/2": "It's rather disheartening to witness the way the village gossips about you.",
  "sensitive.dialogue.story.fail/3": "I'm struggling to comprehend the logic behind this situation...",
  "sensitive.dialogue.story.fail/4": "You should know that your actions are deeply upsetting. Even the Creepers have emotions!",
  "sensitive.dialogue.story.fail/5": "It truly saddens me to witness the merciless slaughter of an innocent sheep. How could you?",
  "sensitive.dialogue.story.fail/6": "*yawning softly* Oh, I apologize, I must have dozed off. What were you saying?",
  "sensitive.dialogue.story.fail/7": "I must question the value of this entire endeavor. Was it truly worth my precious time?",
  "sensitive.dialogue.story.fail/8": "Pardon me for my lack of enthusiasm, but I find this topic rather dull and uninteresting.",
  "sensitive.dialogue.story.fail/9": "I'm sorry to say this, but your behavior borders on madness, and not in a positive way.",
  "sensitive.dialogue.story.fail/10": "I'm failing to comprehend how anyone could deem that as a satisfactory outcome.",

  "sensitive.dialogue.flirt.success/1": "Wow, your courage is truly remarkable!",
  "sensitive.dialogue.flirt.success/2": "Oh my, you're just too charming for words!",
  "sensitive.dialogue.flirt.success/3": "*Blushing intensifies* Are you being genuine?",
  "sensitive.dialogue.flirt.success/4": "Oh dear, my heart skipped a beat...",
  "sensitive.dialogue.flirt.success/5": "That was absolutely precious! You had my attention from the moment we met!",
  "sensitive.dialogue.flirt.success/6": "How is it possible for you to exude such beauty every single day? Whenever I see you, I'm rendered speechless.",
  "sensitive.dialogue.flirt.success/7": "Oh please, don't make me turn any redder!",
  "sensitive.dialogue.flirt.fail/1": "If you truly believe that, show me, and I might consider it.",
  "sensitive.dialogue.flirt.fail/2": "Oh, dear... You know, you used that line on the blacksmith just yesterday.",
  "sensitive.dialogue.flirt.fail/3": "I'm sorry, but that's just not going to happen.",
  "sensitive.dialogue.flirt.fail/4": "How sad. Do you really think that would work on me?",
  "sensitive.dialogue.flirt.fail/5": "Haha, your chances are even worse than a creeper trying to sell me flowers.",
  "sensitive.dialogue.flirt.fail/6": "Absolutely not. I can't even begin to fathom why you thought that would work.",
  "sensitive.dialogue.flirt.fail/7": "Please, spare me the awkwardness and never utter those words again.",

  "sensitive.dialogue.joke.creative.success/1": "*Chuckles* That's quite amusing!",
  "sensitive.dialogue.joke.creative.success/2": "Oh, that's quite a humorous remark!",
  "sensitive.dialogue.joke.creative.success/3": "That's absolutely top-notch! I haven't heard anything better!",
  "sensitive.dialogue.joke.creative.success/4": "Oh my, you might just rival %Supporter% as the funniest person around!",
  "sensitive.dialogue.joke.creative.success/5": "Ha! You're quite the comedian, aren't you? Maybe you should consider a career in stand-up!",
  "sensitive.dialogue.joke.creative.success/6": "Oh my gosh, that was genuinely the funniest joke I've heard in ages! I can't stop laughing!",
  "sensitive.dialogue.joke.creative.success/7": "Teehee! You're definitely more hilarious than Ash, no doubt about it!",
  "sensitive.dialogue.joke.creative.success/8": "Ahah! You've actually managed to tickle my funny bone with that one! Well done!",
  "sensitive.dialogue.joke.creative.failed/1": "It's important to consider the impact of your words, humor shouldn't be at the expense of others.",
  "sensitive.dialogue.joke.creative.failed/2": "Oh, I see. You were trying to be funny. Unfortunately, it missed the mark.",
  "sensitive.dialogue.joke.creative.failed/3": "Well, well, well - looks like we have a comedian in our midst. Not exactly the most amusing one, though.",
  "sensitive.dialogue.joke.creative.failed/4": "Did you really think that joke was appropriate? It's not the kind of humor that resonates with me.",
  "sensitive.dialogue.joke.creative.failed/5": "Um, I suppose that's supposed to be a joke? It's not exactly my cup of tea, but to each their own, I guess.",
  "sensitive.dialogue.joke.creative.failed/6": "Oh, hilarious. Truly. I mean, if you find that sort of thing amusing, who am I to judge?",
  "sensitive.dialogue.joke.creative.failed/7": "I fail to see the humor in that. Perhaps it's best if you stick to your day job, whatever that may be.",
  "sensitive.dialogue.joke.creative.failed/8": "You know, Ash has a knack for telling jokes that actually make people laugh. You might want to take some pointers from him.",

  "sensitive.dialogue.procreate_engaged/1": "My heart yearns for the sacred bond of matrimony before embarking on the beautiful journey of procreation.",
  "sensitive.dialogue.procreate_engaged/2": "It is essential for our souls to be wholeheartedly intertwined before we bless this world with the miracle of new life.",

  "sensitive.dialogue.shake_hand.success/1": "Your handshake is gentle and comforting.",
  "sensitive.dialogue.shake_hand.success/2": "Your grip exudes a delicate strength, it's impressive.",
  "sensitive.dialogue.shake_hand.success/3": "Oh, I must say, your handshake is wonderfully considerate.",
  "sensitive.dialogue.shake_hand.success/4": "Lovely day we're having, isn't it?",
  "sensitive.dialogue.shake_hand.success/5": "Well, hello! It's a pleasure to meet someone as charming as you.",
  "sensitive.dialogue.shake_hand.fail/1": "Are you serious? After you mercilessly butchered the poor cow?",
  "sensitive.dialogue.shake_hand.fail/2": "Oh, um, no thank you. I appreciate the offer though.",
  "sensitive.dialogue.shake_hand.fail/3": "Oh, I'm not a complete stranger, but I understand if you're being cautious.",
  "sensitive.dialogue.shake_hand.fail/4": "Oh wow, this is quite unexpected from you. I didn't think you had it in you.",
  "sensitive.dialogue.shake_hand.fail/5": "Perhaps it's best if you just leave me alone for now.",

  "sensitive.dialogue.main.morning/1": "Good morning, how are you feeling today?",
  "sensitive.dialogue.main.morning/2": "Hey there, ready to tackle the day head-on?",
  "sensitive.dialogue.main.morning/3": "I'm feeling a bit groggy, how about you?",
  "sensitive.dialogue.main.morning/5": "Looks like you didn't get much rest last night. Tough break.",
  "sensitive.dialogue.main.morning/6": "Wakey wakey, it's time to conquer the day! Are you up for it?",
  "sensitive.dialogue.main.morning/7": "Did you manage to catch some quality Z's? You seem quite energetic.",
  "sensitive.dialogue.main.morning/8": "Rise and shine, sleepyhead! Time to seize the day!",
  "sensitive.dialogue.main.morning/9": "What a glorious morning! I have a feeling we'll accomplish great things today!",
  "sensitive.dialogue.main.morning/10": "I might take it easy today, I'm feeling a bit delicate.",
  "sensitive.dialogue.main.morning/11": "My schedule is jam-packed today, just thinking about it drains me.",
  "sensitive.dialogue.main.morning/12": "I actually had a restful night's sleep. Maybe I'll tackle something challenging today, who knows?",
  "sensitive.dialogue.main.evening/1": "Good evening! I hope the day treated you well.",
  "sensitive.dialogue.main.evening/2": "Can you believe how quickly nightfall descended upon us? How did your day fare?",
  "sensitive.dialogue.main.evening/3": "Another grueling day has come to pass, wouldn't you agree?",
  "sensitive.dialogue.main.evening/4": "Time slipped through our fingers today, burdened with an excessive workload.",
  "sensitive.dialogue.main.evening/5": "The hour grows late, and I must hasten my retreat to prepare a nourishing dinner.",
  "sensitive.dialogue.main.evening/6": "Regrettably, I squandered precious hours today and accomplished very little.",
  "sensitive.dialogue.main.evening/7": "Fatigue weighs heavily upon me; I feel inclined to seek solace in a brief nap.",
  "sensitive.dialogue.main.evening/8": "Nightfall invokes a sense of trepidation within me. A creeper sighting last month has deterred me from venturing out after dark.",
  "sensitive.dialogue.main.evening/9": "Oh, greetings! I was just purchasing ingredients from the butcher for tonight's meal. Catch up with you later!",
  "sensitive.dialogue.main.night/1": "Oh, wow, you're really burning the midnight oil, huh?",
  "sensitive.dialogue.main.night/2": "Looks like someone can't resist the allure of the night!",
  "sensitive.dialogue.main.night/3": "Ah, so you're one of those moon-worshipping types too, huh?",
  "sensitive.dialogue.main.night/4": "Hey, just a friendly reminder to stick close to the village. Wouldn't want those creepy crawlies to get their hands on you!",
  "sensitive.dialogue.main.night/5": "You know, the guards do their best to keep the village safe, but there's still an undeniable eeriness to the night, don't you agree?",
  "sensitive.dialogue.main.night/6": "There's something so strangely calming about the darkness, isn't there? It almost feels like the world takes a deep breath and settles down.",
  "sensitive.dialogue.main.night/7": "During the hustle and bustle of the day, it's such a treat to take a leisurely stroll under the starlit sky.",
  "sensitive.dialogue.main.night/8": "I don't know about you, but I'm absolutely knackered. Today has been a marathon, and I think I'll need to pace myself tomorrow.",
  "sensitive.dialogue.main.night/9": "Ahh, the thought of snuggling up under the covers is pure bliss, isn't it?",
  "sensitive.dialogue.main.night/10": "You know, they say a good night's sleep is the secret to conquering tomorrow's challenges. Just something to keep in mind!",

  "sensitive.dialogue.greet.mayor/1": "Pleasant greetings to you, esteemed Mayor!",
  "sensitive.dialogue.greet.mayor/2": "Wishing you a delightful day, Mayor!",
  "sensitive.dialogue.greet.monarch/1": "My Liege.",
  "sensitive.dialogue.greet.monarch/2": "Your Excellency.",

  "sensitive.dialogue.busy/1": "Oh, goodness! We've had quite the conversation today, haven't we? I simply must get back to my tasks now.",
  "sensitive.dialogue.busy/2": "While I truly appreciate our delightful conversation, my dear friend, I'm afraid I'm pressed for time and must focus on completing my work by this evening.",
  "sensitive.dialogue.busy/3": "My sincerest apologies, but I find myself a tad occupied at the moment. Would it be terribly inconvenient if we continued our chat at a more convenient time?",
  "sensitive.dialogue.busy/4": "Regrettably, I'm in dire need of attending to my duties at the moment. Fear not, though, for I promise to catch up with you later.",
  "sensitive.dialogue.busy/5": "Oh dear, I've made a terrible oversight! My humblest apologies, but I must rush back to my furnace. We'll certainly catch up soon, won't we?",
  "sensitive.dialogue.goaway/1": "Please, I kindly request that you go away.",
  "sensitive.dialogue.goaway/2": "Do you not have any more pressing matters to attend to?",
  "sensitive.dialogue.goaway/3": "I apologize, %1$s, but I am unable to engage in conversation at the moment.",
  "sensitive.dialogue.goaway/4": "Kindly find someone else to bother!",
  "sensitive.dialogue.goaway/5": "Oh dear, would you be so kind as to leave, you miscreant?",

  "sensitive.dialogue.greet/1": "Hey! How are things going for you today?",
  "sensitive.dialogue.greet/2": "Well, hello %1$s! How's the world treating you lately?",
  "sensitive.dialogue.greet/3": "Greetings! Is there something on your mind?",
  "sensitive.dialogue.greet/4": "Wow, look at you! Ready to conquer the world! How are you holding up?",
  "sensitive.dialogue.greet/5": "Greetings, %1$s! It's a pleasure to lay eyes on you!",
  "sensitive.dialogue.greet/6": "Well, well, well, look who we have here! How's life treating you?",
  "sensitive.dialogue.greet/7": "Ah, there you are! It's always a pleasure to see your face!",
  "sensitive.dialogue.greet/8": "Greetings, my friend! How's your day unfolding? Anything exciting happening?",
  "sensitive.dialogue.greet/9": "Hey! I'm absolutely thrilled to see your lovely face! How have you been?",

  "sensitive.dialogue.greet.negative/1": "Ugh, please leave. You're the absolute last person I wanted to encounter right now!",
  "sensitive.dialogue.greet.negative/2": "Oh, wonderful. Look who decided to grace us with their presence. Again.",
  "sensitive.dialogue.greet.negative/3": "Hm? What do you want?",
  "sensitive.dialogue.greet.negative/4": "Oh, it's you... I was kind of hoping for someone different, to be honest.",
  "sensitive.dialogue.greet.negative/5": "Back to bother me, huh? Just what I needed today.",

  "sensitive.dialogue.greet.success/1": "That's wonderful news, I'm truly thrilled to hear it!",
  "sensitive.dialogue.greet.success/2": "Oh, how delightful! I'm absolutely ecstatic to hear that you're doing well!",
  "sensitive.dialogue.greet.success/3": "My heart is brimming with joy to know that you're in a good place!",
  "sensitive.dialogue.greet.success/4": "I cannot express enough how elated I am to hear such fantastic news!",
  "sensitive.dialogue.greet.success/5": "My spirits are soaring high upon learning that everything is going smoothly for you!",
  "sensitive.dialogue.greet.fail/1": "Hmm, well, that's unfortunate.",
  "sensitive.dialogue.greet.fail/2": "Glad to hear... I guess. It's not exactly what I was hoping for, but I'll try to look on the bright side.",
  "sensitive.dialogue.greet.fail/3": "Uh... okay? I mean, it wasn't exactly the response I was expecting, but hey, life is full of surprises, right?",
  "sensitive.dialogue.greet.fail/4": "Really? Huh... I guess I'll just have to deal with it then. Not exactly the most exciting news, but hey, it is what it is.",
  "sensitive.dialogue.greet.fail/5": "Oh... well, that's a bit disappointing. I was hoping for something a little more exciting, but I'll manage.",

  "sensitive.dialogue.apologize.success/1": "0. No worries, we all slip up sometimes.",
  "sensitive.dialogue.apologize.success/2": "Don't sweat it, accidents happen. Just stay mindful from now on, alright?",
  "sensitive.dialogue.apologize.success/3": "2. It's alright, mistakes are part of being human. Just remember to stay cautious going forward.",
  "sensitive.dialogue.apologize.success/4": "3. No problem at all, we all stumble every now and then. Just keep learning from your mishaps.",
  "sensitive.dialogue.apologize.success/5": "4. Oh, fret not! We all have our fair share of blunders. It's absolutely fine, my friend.",
  "sensitive.dialogue.apologize.fail/1": "Please, just leave me alone!",
  "sensitive.dialogue.apologize.fail/2": "I can't believe you intentionally struck me!",
  "sensitive.dialogue.apologize.fail/3": "Seriously? Do you honestly expect me to believe that?",
  "sensitive.dialogue.apologize.fail/4": "That really stung, so don't even bother trying to apologize!",
  "sensitive.dialogue.apologize.fail/5": "Sorry, but there's absolutely no chance I'll forgive you.",

  "sensitive.dialogue.location.failed/1": "I'm sorry, but I haven't come across any new information worth sharing.",
  "sensitive.dialogue.location.failed/2": "Regrettably, I am not aware of any captivating locations at the moment.",
  "sensitive.dialogue.location.failed/3": "I'm afraid not. We villagers have our own priorities, and delving into treacherous ruins isn't one of them, my dear adventurers.",
  "sensitive.dialogue.location.forgot/1": "Oops, my memory failed me again! I stumbled upon this amazing spot, but silly me, I completely forgot to jot it down. My apologies.",
  "sensitive.dialogue.location.forgot/2": "Ah, the pursuit of something intriguing! Ah, yes! There was indeed an enchanting location that captured my attention. Alas, my memory betrayed me! Regrettably, I failed to immortalize it on paper. Accept my sincerest apologies.",
  "sensitive.dialogue.location.forgot/3": "Oh, how my mind betrays me! I recollect stumbling upon an enthralling place, a place that would have ignited your curiosity. Alas, the memory slipped through the cracks, leaving me with nothing but remorse. I beg for your forgiveness.",
  "sensitive.dialogue.location.igloo/1": "Oh my, I stumbled upon an igloo at %2$s. Can you imagine living in a house made entirely of snow? It must be quite chilly!",
  "sensitive.dialogue.location.igloo/2": "You won't believe what I discovered! There's this forsaken igloo at %2$s. No one seems to dwell there anymore, and honestly, I can't blame them. It gives off an eerie vibe. I've even heard strange whispers whenever I pass by...",
  "sensitive.dialogue.location.igloo/3": "Ah, %2$s! There's this desolate abode crafted entirely out of ice, known as an igloo. It has been forsaken for quite some time, my friend. I suspect it holds some intriguing tales from the past.",
  "sensitive.dialogue.location.pyramid/1": "My keen eyesight just caught sight of a magnificent pyramid over yonder at %2$s.",
  "sensitive.dialogue.location.pyramid/2": "Rumor has it, darling, that a splendid pyramid awaits your presence at %2$s. Oh, the treasures and wonders that could befall you!",
  "sensitive.dialogue.location.pyramid/3": "Ah, my dear friend, if you venture forth to %2$s, you shall stumble upon a most intriguing pyramid. A brave soul, not unlike yourself, set off on an exploration ages ago, but alas, they've not returned. Take heed of the dangers that lie ahead, my sensitive companion.",
  "sensitive.dialogue.location.ruined_portal_desert/1": "Oh dear, it's such a heartbreaking sight to see that a portal has been utterly ruined in the vast desert at %2$s.",
  "sensitive.dialogue.location.ruined_portal_swamp/1": "Pray forgive me, but I must alert you to the distressing fact that there exists a completely devastated portal at %2$s, surrounded by this dreadful swamp. The unwelcome visitors from the Nether must have been utterly bewildered by their unforeseen arrival in this desolate abyss.",
  "sensitive.dialogue.location.ruined_portal/1": "Oh, dear, it's absolutely heart-wrenching to see what happened to the portal at %2$s. It's been utterly devastated by the Nether invasion.",
  "sensitive.dialogue.location.ruined_portal/2": "If you happen to venture to %2$s, you'll come across a rather distressing sight - a ruined nether portal. It sends shivers down my spine, to be honest. But fear not, it should be safe. Just be cautious and avoid stepping on any dangerous magma.",
  "sensitive.dialogue.location.ruined_portal/3": "My goodness, if you decide to explore %2$s, you'll stumble upon some ancient ruins. It's a tragic tale, really. The local cleric believes it used to be a majestic nether portal. There are even rumors of hidden treasures lingering in that forsaken place. But alas, no one dares to go anywhere near it. It's simply too ominous and unsettling.",
  "sensitive.dialogue.location.ruined_portal_mountain/1": "It pains me to say this, but it appears that a portal, which once stood proudly in the majestic mountains of %2$s, has been reduced to a mere shadow of its former glory.",
  "sensitive.dialogue.location.mansion/1": "Ah, my dear friend, I must warn you about the treacherous path that lies ahead. A wretched mansion looms ominously at %2$s, a place infested with vile illagers. I beseech you, if you cherish your existence, never venture anywhere near that cursed abode.",
  "sensitive.dialogue.location.mansion/2": "Have you heard of the magnificent mansion nestled at %2$s? Alas, it is under the unsavory ownership of those dreadful illagers. Pardon my concern, but perhaps it would be wise for us to relocate the entire village, far away from this perilous vicinity... for our own safety, of course.",
  "sensitive.dialogue.location.monument/1": "Step closer, traveler, and lend me your ear. Legends tell of ancient ruins nestled in the depths of the vast ocean, beckoning daring souls to uncover their secrets at %2$s. But be forewarned, my curious companion, for this endeavor is fraught with danger. Treasure awaits, but only for those brave enough to face the perils that dwell within the abyss.",
  "sensitive.dialogue.location.monument/2": "Ah, the tales that echo through the winds, whispering of a sunken castle guarded by creatures of the deep at %2$s. Venture not into its treacherous waters, for the sea monsters that dwell within are not to be trifled with. You may seek treasure, my dear friend, but beware, for peril lurks at every turn, ready to claim the unwary.",
  "sensitive.dialogue.location.shipwreck/1": "Oh, the poor shipwreck at %2$s breaks my heart. It was once a majestic vessel owned by the Eastern Alliance Company. Such a tragic tale it holds.",
  "sensitive.dialogue.location.shipwreck/2": "It deeply saddens me to hear that there's a shipwreck at %2$s. I've heard whispers of fishermen stumbling upon it, wondering if there's any precious treasure concealed within its watery depths.",
  "sensitive.dialogue.location.shipwreck_beached/1": "Can you believe it? There's a shipwreck at %2$s, right on the beach! It's like a tragic story waiting to be discovered.",
  "sensitive.dialogue.location.shipwreck_beached/2": "Oh, you won't believe what I stumbled upon! Head to %2$s and prepare yourself to witness a ship, tragically wrecked on the shore. I can't help but wonder what untold secrets lie within its sunken hull.",
  "sensitive.dialogue.location.village_desert/1": "Did you know? There's a captivating village nestled amidst the vastness of the scorching desert, right at %2$s.",
  "sensitive.dialogue.location.village_taiga/1": "Have you heard about the enchanting village nestled within the cozy embrace of the taiga biome? It's simply mesmerizing.",
  "sensitive.dialogue.location.village_taiga/2": "Oh, you simply must venture to %2$s! It's a splendid village, tucked away in the heart of the enchanting taiga biome.",
  "sensitive.dialogue.location.village_snowy/1": "Oh, did you know there's another village over at %2$s? It's freezing cold there, but the people are just so tender-hearted.",
  "sensitive.dialogue.location.village_snowy/2": "You won't believe it, but there's this village at %2$s in the snowy plains! The people there are incredibly kind, but boy, oh boy, is it chilly!",
  "sensitive.dialogue.location.village_plains/1": "Ah, behold! Over yonder lies a picturesque village.",
  "sensitive.dialogue.location.village_plains/2": "Venture further into the vast plains and thou shalt stumble upon yet another charming village at %2$s.",
  "sensitive.dialogue.location.village_savanna/1": "Over yonder, at %2$s, lies another village. Brace yourself, for the scorching heat there is truly relentless.",
  "sensitive.dialogue.location.village_savanna/2": "Venture into the savanna at %2$s, and you shall stumble upon a village of exquisite charm. The lovely folk residing there possess warm hearts that rival the blazing sun.",
  "sensitive.dialogue.location.swamp_hut/1": "Oh, dear traveler, I must warn you about the treacherous swamp ahead. It's plagued by a wicked witch, and I strongly advise avoiding that wretched place.",
  "sensitive.dialogue.location.swamp_hut/2": "My apologies, but I must urge you to stay clear of %2$s. The vile witch who resides in a despicable hut there creates an atmosphere that is best left untouched. Trust me, you won't want to be anywhere near it.",
  "sensitive.dialogue.location.mineshaft/1": "That mine over there? Oh, it brings back memories of the tragic accident that happened. It's no longer functioning, sadly. Look for it around %2$s.",
  "sensitive.dialogue.location.mineshaft/2": "Ah, yes. We once had a mine in this very spot. However, things took a turn for the worse when it became overrun with menacing creatures. It's best to avoid venturing down there. If you're determined to explore, exercise extreme caution. The entrance should be located near %2$s.",
  "sensitive.dialogue.location.jungle_pyramid/1": "Be cautious, my friend, for there lies an ancient temple amidst the dense jungle at %2$s. It is best to steer clear of that treacherous place, as its traps have claimed many lives throughout the ages.",
  "sensitive.dialogue.location.jungle_pyramid/2": "Ah, the alluring call of adventure beckons you to the nearby jungle, where the remnants of a once-glorious civilization await at %2$s. I implore you to exercise utmost caution, my dear wanderer, for the traps that guard those crumbling ruins are as unforgiving as a tempestuous storm. If only our ancestors possessed the wisdom to disarm them, treasures beyond imagination would have been ours long ago.",
  "sensitive.dialogue.location.pillager_outpost/1": "Oh my, have you heard about the presence of those dreadful Pillagers at %2$s? They've established an outpost right next to us, and it's simply nerve-wracking. I just hope and pray they won't launch another attack on us anytime soon. Our poor village cannot bear the thought of another assault.",
  "sensitive.dialogue.location.pillager_outpost/2": "Oh dear, I must warn you about that wretched outpost occupied by those pillagers at %2$s. It's truly a nightmare! They make it impossible for us to get a peaceful night's rest. If you dare venture anywhere near there, please exercise extreme caution. Those heartless creatures shoot first and ask questions never.",
  "sensitive.dialogue.location.pillager_outpost/3": "Ah, yes. If by any chance you find yourself heading towards %2$s, be prepared to face the horrors of that accursed pillager outpost. Those despicable villains have taken residence there. However, if you possess the bravery to vanquish them, who knows? You might stumble upon some valuable treasures. Believe me when I say, the entire village would be eternally grateful if someone were to rid us of those scoundrels.",
  "sensitive.dialogue.location.ancient_city/0": "I couldn't help but sense some eerie vibrations coming from %2$s, deep within the earth.",
  "sensitive.dialogue.location.ancient_city/1": "My intuition tells me that there's a hidden secret buried beneath the surface of %2$s.",
  "sensitive.dialogue.location.ancient_city/3": "Whispers of an ancient city resonate through the stories, yet my eyes fail to witness its presence. Perhaps it lies concealed beneath the ground at %2$s.",

  "sensitive.dialogue.joke.monster.success/1": "Oh dear, that must have been quite the ordeal for that poor Skelly.",
  "sensitive.dialogue.joke.monster.success/2": "Oh my goodness, I can't believe that zombie actually attempted such a violent act with a shovel! How peculiar!",
  "sensitive.dialogue.joke.monster.success/3": "My, oh my, you certainly demonstrated your authority over that spider! Quite impressive, I must say.",
  "sensitive.dialogue.joke.monster.success/4": "Oh, my goodness gracious! You actually managed to orchestrate a skeleton defeating a creeper? That's absolutely extraordinary!",
  "sensitive.dialogue.joke.monster.success/5": "Oh, dear me, it's quite astonishing how cave spiders can sometimes display such perplexing behavior. Haha, what a curious creature indeed!",
  "sensitive.dialogue.joke.monster.failed/1": "It's really important to remember that skeletons, just like us, have feelings too! Let's show some respect, shall we?",
  "sensitive.dialogue.joke.monster.failed/2": "I must admit, I find it quite insensitive when people make jokes about creepers exploding. We should be more understanding towards their explosive tendencies, don't you think?",
  "sensitive.dialogue.joke.monster.failed/3": "Have you ever stopped to consider that zombies and skeletons were once humans with hopes and dreams? It's rather heartbreaking when you think about it. Let's be more compassionate towards them.",
  "sensitive.dialogue.joke.monster.failed/4": "It's rather unoriginal to poke fun at an enderman falling into water, don't you think? They already have a tough time with their teleportation skills. Let's not add insult to injury.",
  "sensitive.dialogue.joke.monster.failed/5": "You know, it's quite disheartening when people make jokes about silverfish ambushing us on the toilet. We should strive for a more empathetic and understanding approach, don't you agree?",

  "sensitive.dialogue.joke.animal.success/1": "Oh dear, it's quite unfortunate for the sheep to lose its wool, isn't it? But I suppose we can find some humor in it.",
  "sensitive.dialogue.joke.animal.success/2": "Can you believe it? The wolf actually fell in love with the sheep! Oh my, such an unexpected twist!",
  "sensitive.dialogue.joke.animal.success/3": "Well, I must say, it's rather amusing to think that chickens are capable of such things! Who would have thought?",
  "sensitive.dialogue.joke.animal.success/4": "Oh, goodness! That's absolutely absurd and yet strangely amusing! I simply can't help but love it.",
  "sensitive.dialogue.joke.animal.success/5": "It's quite a relief to know that cows have the ability to provide us with endless milk, isn't it? Such a miraculous gift from nature.",
  "sensitive.dialogue.joke.animal.failed/1": "Oh, please, let's not make light of the situation.",
  "sensitive.dialogue.joke.animal.failed/2": "It's disheartening to see humor at the expense of innocent animals.",
  "sensitive.dialogue.joke.animal.failed/3": "We should show compassion rather than finding amusement in such unfortunate circumstances.",
  "sensitive.dialogue.joke.animal.failed/4": "I must admit, I don't find amusement in jokes that mock vulnerable creatures.",
  "sensitive.dialogue.joke.animal.failed/5": "Making fun of animals, even in jest, can be hurtful. Let's refrain from doing so.",

  "sensitive.dialogue.flirt.slap/1": "Pardon me!",
  "sensitive.dialogue.flirt.slap/2": "Have you taken lessons from a Love Guru on the art of flirting?!",
  "sensitive.dialogue.kiss.slap/1": "I cannot believe you would do such a thing!",
  "sensitive.dialogue.kiss.slap/2": "If you even think about attempting that again, I promise you, the consequences will be far from pleasant!",

  "sensitive.dialogue.chat.plains/1": "Oh, how I adore the plains! It's the only place I've ever known, but I dream of venturing beyond its borders one day... to see the world!",
  "sensitive.dialogue.chat.plains/2": "The tranquility of the plains is simply enchanting. While it may not boast the same thrill as other biomes, there's nowhere else I'd rather call home.",
  "sensitive.dialogue.chat.plains/3": "Oh, when the sun sets and blankets the plains in its golden hues, it's a sight that takes my breath away. And the gentle whispers of the wind... it's like nature's lullaby.",
  "sensitive.dialogue.chat.plains/4": "Sometimes, I find myself lying on the soft grass, gazing up at the night sky. It's a moment of pure serenity, where my worries fade into the vast expanse above.",
  "sensitive.dialogue.chat.plains/5": "The air here is so incredibly pure and invigorating! It's as if every breath I take rejuvenates my very soul. I dare say it rivals even the crispness of the mighty taiga!",
  "sensitive.dialogue.chat.plains/6": "Ah, you see, the beauty of the plains lies in its simplicity. There's a certain charm in its unadorned landscapes, where less is often more.",
  "sensitive.dialogue.chat.plains/7": "Ah, memories of picking wildflowers as a child flood my heart with nostalgia. I must confess, I would gather them with the hope of catching the eye of my childhood crush, Ash. Oh, young love!",
  "sensitive.dialogue.chat.plains/8": "The morning sunrise paints the entire plains with a breathtaking palette of colors. I implore you, dear friend, to witness this spectacle at least once. It's like a masterpiece unfolding before your very eyes.",
  "sensitive.dialogue.chat.savanna/1": "The scorching heat of the savanna may be a challenge, but at least we're spared from the harsh grip of winter.",
  "sensitive.dialogue.chat.savanna/2": "Although the llamas can be a tad bothersome, there's a certain charm to this place that keeps me hooked.",
  "sensitive.dialogue.chat.savanna/3": "The architectural marvels that grace the savanna are a testament to the rich culture that thrives here. It's one of the many reasons why I call this place home.",
  "sensitive.dialogue.chat.savanna/4": "Never underestimate the humble savanna biome. Beneath its seemingly plain exterior lies hidden treasures waiting to be discovered.",
  "sensitive.dialogue.chat.savanna/5": "Unlike the desert villages, we may not have rain, but our rivers bring life and vitality to our community.",
  "sensitive.dialogue.chat.savanna/6": "The undulating hills and captivating terrains of the savanna never fail to captivate my wandering eyes. It truly is a sight to behold.",
  "sensitive.dialogue.chat.savanna/7": "When the scorching sun becomes unbearable, I find solace in the comforting shade provided by the majestic acacia trees. They are my sanctuary during long workdays.",
  "sensitive.dialogue.chat.savanna/8": "Our savanna villages boast the finest melons and pumpkins in the entire world. We strike lucrative trade deals with other villages, spreading the joy of our bountiful harvest.",
  "sensitive.dialogue.chat.taiga/1": "The woods hold such a special place in my heart. They provide us with an abundance of resources, keep us warm with firewood, and offer the perfect hunting grounds for our survival.",
  "sensitive.dialogue.chat.taiga/2": "While some may find the taiga biome cold, I find it to be a place of complete fulfillment. We have everything we could ever need right here, and I wouldn't trade it for the world!",
  "sensitive.dialogue.chat.taiga/3": "Oh, the taiga forests are simply enchanting, aren't they? I find great joy in exploring their depths and indulging in the luscious sweetness of the berries they bear.",
  "sensitive.dialogue.chat.taiga/4": "My heart simply melts for the foxes that grace our taiga forests. Those mischievous creatures steal my heart with their playful antics, and I can't resist spoiling them with the tastiest sweet berries.",
  "sensitive.dialogue.chat.taiga/5": "With the abundance of food available in our taiga, our wolves have become quite friendly and docile. It's truly remarkable how they've learned to coexist peacefully with us.",
  "sensitive.dialogue.chat.taiga/6": "Ah, the taiga air is like a soothing balm for the soul. Its freshness rejuvenates my spirit and brings a sense of tranquility that can't be found anywhere else.",
  "sensitive.dialogue.chat.taiga/7": "While the sweet berry bushes may yield the most delectable berries, I must admit, their prickly thorns can be quite dreadful to encounter! But the reward is worth the occasional prick.",
  "sensitive.dialogue.chat.taiga/8": "The rain in our taiga may have a chilly touch, but it's nothing short of a serene symphony. It washes away the worries and brings a sense of peacefulness that I cherish deeply.",
  "sensitive.dialogue.chat.snowy_plains/1": "Brrr, this cold weather really gets to me. As long as I have a cozy fireplace and a warm cup of cocoa, I can survive!",
  "sensitive.dialogue.chat.snowy_plains/2": "I can't feel my fingers in this freezing weather, but hey, at least I can enjoy some ice skating, right?",
  "sensitive.dialogue.chat.snowy_plains/3": "Oh, the chilly winds just give me the perfect excuse to stay indoors and binge-watch my favorite shows snuggled up in a fluffy blanket!",
  "sensitive.dialogue.chat.snowy_plains/4": "When the snow falls, it's like a magical time machine transporting me back to the days of snow angels and building massive igloos. Ah, the nostalgia!",
  "sensitive.dialogue.chat.snowy_plains/5": "Ugh, those pesky strays are such a pain, always ruining my peaceful walks with their annoying arrows. Can't they find a different hobby?",
  "sensitive.dialogue.chat.snowy_plains/6": "Watch out for the wolves lurking around, I've heard they're particularly hungry these days. Stay safe, my friend!",
  "sensitive.dialogue.chat.snowy_plains/7": "I made the mistake of accidentally bumping into an iron golem once. Trust me, it's like getting glued to a statue for an entire day. Not a fun experience!",
  "sensitive.dialogue.chat.snowy_plains/8": "Ah, the memories of my childhood, when my parents would surprise me with a pumpkin. We'd carve it into a jack-o'-lantern and then use the seeds for some delicious roasted snacks. Good times!",
  "sensitive.dialogue.chat.desert/1": "Wow, the desert sure knows how to turn up the heat, doesn't it? But hey, at least we never have to worry about freezing our buns off in the winter!",
  "sensitive.dialogue.chat.desert/2": "Can you believe it? The desert keeps the temperature cranked up all year long. It's like my own personal sauna!",
  "sensitive.dialogue.chat.desert/3": "Whew! This desert heat is no joke. I'll either end up with a killer tan or turn into a crispy critter!",
  "sensitive.dialogue.chat.desert/4": "Talk about a breathtaking view! The desert nights are absolutely stunning, with cooler temperatures and a sky full of twinkling stars.",
  "sensitive.dialogue.chat.desert/5": "Whoa, hold onto your hats! The sun is giving us its fiercest glare today. I'll be a molten mess if I stay out too long!",
  "sensitive.dialogue.chat.desert/6": "Man, oh man! The sun is really laying it on thick today, isn't it? Time to seek shelter before I turn into a walking puddle!",
  "sensitive.dialogue.chat.desert/7": "Hey, have you managed to spot any rabbits around here? Those sneaky little critters are like desert ninjas!",
  "sensitive.dialogue.chat.desert/8": "Ugh, dealing with those husks is such a pain in the neck. I mean, seriously, why do they always leave us famished after smacking us? So not cool!",
  "sensitive.dialogue.chat.desert/9": "Ouch! I learned the hard way to watch my step around those prickly cacti. They're like nature's own little booby traps out here!",
  "sensitive.dialogue.chat.desert/10": "Life in this arid desert is definitely a challenge, but lucky for us, we've got this awesome village that keeps us hydrated and well-fed. Thank goodness for small blessings, right?",

  "sensitive.dialogue.story.exploring.success/1": "Awesome! One day, I dream of embarking on my own epic journey across the vast lands of Minecraft!",
  "sensitive.dialogue.story.exploring.success/2": "My goodness! The mere thought of venturing out into the great unknown, discovering new horizons, and leaving my cozy village behind fills me with a mix of awe and envy. The world must be teeming with wonders waiting to be unveiled!",
  "sensitive.dialogue.story.exploring.success/3": "Oh my goodness, you must have the heart of a lion! To boldly step into uncharted territory, facing the mysteries and dangers that lie ahead takes a special kind of courage. I'm in absolute awe!",
  "sensitive.dialogue.story.exploring.fail/1": "I must admit, your stories have lost their charm over time.",
  "sensitive.dialogue.story.exploring.fail/2": "Oh my, please be careful! That edge you're projecting might end up hurting you, my dear friend.",
  "sensitive.dialogue.story.exploring.fail/3": "Speaking with you resembles conversing with a fragile being on a quest for enlightenment. Alas, the endearing qualities are amiss in this comparison.",

  "sensitive.dialogue.story.nether.success/1": "Is it really that hot in the Nether?! Oh, my delicate senses couldn't bear the scorching heat!",
  "sensitive.dialogue.story.nether.success/2": "Oh, my goodness! How on earth have you managed to not spontaneously combust in that treacherous place? My fragile constitution would never survive!",
  "sensitive.dialogue.story.nether.success/3": "Word on the street is that the Nether is filled with unimaginable treasures for those valiant enough to venture. Oh, if only my courage matched my insatiable desire for riches...",
  "sensitive.dialogue.story.nether.success/4": "You, my fearless friend, must possess nerves of steel! I can't even fathom the sheer terror one must feel when wandering through the Nether. Not that I would know anything about that, of course...",
  "sensitive.dialogue.story.nether.success/5": "Pardon me, good sir/madam, may I inquire if you have ever laid eyes upon a Zombified Piglin? The mere thought of encountering such a creature sends shivers down my spine!",
  "sensitive.dialogue.story.nether.fail/1": "I highly doubt you've ever dared to venture into the treacherous Nether.",
  "sensitive.dialogue.story.nether.fail/2": "Ah, so that's why those Piglins felt the need to attack you. It all makes sense now.",
  "sensitive.dialogue.story.nether.fail/3": "Frankly, I couldn't care less if you've been to the Nether. Your storytelling skills are lacking, to say the least.",
  "sensitive.dialogue.story.nether.fail/4": "Judging by your feeble appearance, I highly question your ability to survive a journey to the Nether.",
  "sensitive.dialogue.story.nether.fail/5": "My dear old grandpa used to venture into the dangerous depths of the Nether, and he never mentioned a word about warped fungus. You must be quite the fibber!",

  "sensitive.dialogue.story.enderdragon.success/1": "Astounding! And pray tell, doth thou possess the dragon egg in thy possession?",
  "sensitive.dialogue.story.enderdragon.success/2": "Oh gracious me! Hath thou truly vanquished the formidable dragon of lore?! The village shall forever regale thy heroic feats!",
  "sensitive.dialogue.story.enderdragon.fail/1": "Goodness gracious! Are you out of your mind? The ender dragon is nothing but a fantastical tale!",
  "sensitive.dialogue.story.enderdragon.fail/2": "Oh dear, you can't be serious! It's absolutely ludicrous to even entertain the thought of challenging that indomitable dragon!",

  "sensitive.dialogue.story.wither.success/1": "Unbelievable! The tales of the Wither's destructive power are beyond comprehension!",
  "sensitive.dialogue.story.wither.success/2": "You've managed to overcome the indomitable Wither?! Oh my, that's absolutely mind-blowing!",
  "sensitive.dialogue.story.wither.fail/1": "I have my doubts about your claim, I must admit.",
  "sensitive.dialogue.story.wither.fail/2": "Your appearance suggests that your story might be a tad far-fetched, my friend.",

  "sensitive.dialogue.stay.fail/1": "No, thank you. I'm not really cut out for staying in one place.",
  "sensitive.dialogue.stay.fail/2": "I appreciate your offer, but my heart yearns for the thrill of exploration and adventure!",
  "sensitive.dialogue.stay.fail/3": "This village is lovely, but my restless spirit craves the excitement that comes with being an adventurer.",
  "sensitive.dialogue.stay.repeat/1": "Oh, I remember answering that question before.",
  "sensitive.dialogue.stay.repeat/2": "I do recall you asking me this already.",
  "sensitive.dialogue.stay.success/1": "Many thanks! I am absolutely delighted to make this village my home!",
  "sensitive.dialogue.stay.success/2": "Oh, how splendid! This village is simply marvelous, and I cannot wait to settle down here!",
  "sensitive.dialogue.stay.no_space/1": "Oh dear, it appears that this village is quite bustling with activity.",
  "sensitive.dialogue.stay.no_space/2": "I do have a slight inclination to remain here, but regrettably, there seems to be a shortage of available resting quarters.",

  "sensitive.dialogue.hire/1": "Absolutely, just give me a heads up whenever you require assistance. I shall make myself available for the agreed-upon remuneration.",
  "sensitive.dialogue.hire/2": "Fantastic news! Kindly inform me when my services are needed. I shall remain in this vicinity, eagerly anticipating the exchange of emeralds!",
  "sensitive.dialogue.hire/3": "Marvelous! Your decision to hire me is sure to yield satisfying results. Ensure the emeralds are prepared, for I am ready to embark on this collaborative endeavor with utmost enthusiasm!",
  "sensitive.dialogue.no_money/1": "I'm terribly sorry, but my services come at a cost. You'll need a bit more emeralds to secure my assistance.",
  "sensitive.dialogue.no_money/2": "Oh dear, it seems the current offer falls a bit short. I'm afraid you'll need to gather a few more emeralds before we can proceed with the hiring process.",
  "sensitive.dialogue.no_money/3": "My apologies, but my talents come at a premium. The current emerald count won't quite cut it. You'll need to acquire a tad more to engage my services.",

  "sensitive.dialogue.main.rock_paper_scissor/1": "How about a little game of Rock Paper Scissors?",
  "sensitive.dialogue.rock_paper_scissor/1": "Alright, let's play a game of rock, paper, scissors! Ready, set, go!",
  "sensitive.dialogue.rock_paper_scissor/2": "Today is the day I finally triumph over you! Prepare yourself for defeat!",
  "sensitive.dialogue.rock_paper_scissor.rock/1": "Oh, my dear friend, I choose the powerful and sturdy rock!",
  "sensitive.dialogue.rock_paper_scissor.paper/1": "Let it be known that my choice is paper, a gentle caress, a testament to my sensitive soul.",
  "sensitive.dialogue.rock_paper_scissor.scissor/1": "Behold, the scissor! Will it be my winning move?",
  "sensitive.dialogue.rock_paper_scissor.loose.rock/1": "Oh no, I picked rock! You win fair and square!",
  "sensitive.dialogue.rock_paper_scissor.loose.paper/1": "My soul is feeling a little fragile today, so I'll choose rock instead of paper this time.",
  "sensitive.dialogue.rock_paper_scissor.loose.scissor/1": "Oh, I'm terribly sorry, but it seems my rock has triumphed over your feeble scissors. I emerge victorious!",
  "sensitive.dialogue.rock_paper_scissor.win.rock/1": "Oh my, the scissor has been crushed by the unstoppable force of the rock. I've lost this round.",
  "sensitive.dialogue.rock_paper_scissor.win.paper/1": "Winning with rock? A distant dream for me. It's a constant reminder of my lack of fortune in this game.",
  "sensitive.dialogue.rock_paper_scissor.win.scissor/1": "Scissors are truly the masters of cutting paper, my defeat is evident.",
  "_": ""
}