{
  "confident.dialogue.main/1": "Ah, greetings!",
  "confident.dialogue.main/2": "Well, well, how do you do today?",
  "confident.dialogue.main/3": "Ah, splendid to lay eyes on you!",
  "confident.dialogue.main/4": "Pray tell, what's the news of your day?",
  "confident.dialogue.main/5": "How fares your day, good sir/madam?",
  "confident.dialogue.main/6": "Ah, %1$s! What's the latest news in your world?",
  "confident.dialogue.main/7": "Allow me to regale you with a tale of my encounter with %supporter%. It so happened that he was bitten by a zombie! Fear not, for he assured me it was of no consequence. But lo and behold, today I chanced upon a zombie bearing an uncanny resemblance to %supporter% himself! Quite a perplexing coincidence, wouldn't you agree?",

  "confident.dialogue.rumors.failed/1": "Hmm, I'm afraid I don't have any exciting news for you.",
  "confident.dialogue.rumors.lore/1": "Believe me, Jax may still have some followers, but the true enlightenment lies in the worship of Sirben. The prophets MerlinWolfGames and Crow are the ones spreading his divine words, and I can assure you, they're making waves.",
  "confident.dialogue.rumors.lore/2": "Oh, darling, don't fret about those Cyberdemons trying to invade us. Sirben and Luke, the unstoppable duo, put an end to that invasion. They showed those demons who's boss and sent them scurrying back to where they came from.",
  "confident.dialogue.rumors.lore/3": "Ah, yes, the infamous disappearance of the Ancient Builder. Rumor has it that 2DA50, that adventurous soul, decided to journey to the Far Lands. But let me tell you, once you venture into the unknown like that, you never know what fate has in store. 2DA50 vanished without a trace, never to be heard from again.",
  "confident.dialogue.rumors.lore/4": "Ah, the temple of Sirben, built by the talented MerlinWolfGames. It's not just any temple, my friend, it's one of the ancient wonders of our world. The craftsmanship, the devotion, it's truly awe-inspiring. MerlinWolfGames has truly outdone himself with this masterpiece.",
  "confident.dialogue.rumors.lore/5": "Once, there was a magnificent race of builders, darling. They were the crème de la crème, the epitome of architectural brilliance. But alas, they have vanished, leaving behind only whispers of their existence. It's a tragic tale, really, to see such greatness fade into the annals of history.",
  "confident.dialogue.rumors.lore/6": "Ah, have you heard the enthralling legends of the ancient builders? Those marvelous beings who dotted the Overworld with their mesmerizing ruins and breathtaking temples? Their legacy is a testament to their genius, my dear. Oh, how I long to unravel the mysteries they left behind.",

  "confident.dialogue.first.generic/1": "Ah, finally someone interesting! I've been waiting for a traveler like you.",
  "confident.dialogue.first.generic/2": "Well, aren't you a breath of fresh air! It's about time someone worth talking to showed up.",
  "confident.dialogue.first.generic/3": "Ah, a newcomer! Brace yourself for some serious excitement, my friend!",
  "confident.dialogue.first.generic/4": "Welcome, welcome! I hope you're prepared to be amazed, because this village just got a major upgrade with your arrival.",
  "confident.dialogue.first.generic/5": "Look who we have here, a real adventurer! You're just what this place needed to kick things up a notch.",
  "confident.dialogue.first.generic/6": "Well, well, well, what do we have here? A new face in town! Get ready for some unforgettable experiences, my friend.",

  "confident.dialogue.first.question/1": "Greetings, wanderer. What has led you to grace our humble village?",
  "confident.dialogue.first.question/2": "Ah, a fresh soul. How did the winds of fate guide you to our little haven?",
  "confident.dialogue.first.question/3": "Well, well, well! Another seeker of thrills, I presume? Pray tell, how did you stumble upon this hidden gem?",
  "confident.dialogue.first.exploring/1": "We may not boast much, but rest assured, you're more than welcome here, provided you adhere to our guidelines.",
  "confident.dialogue.first.exploring/2": "Embrace our regulations, dear traveler, and this haven shall be open arms for you.",
  "confident.dialogue.first.exploring/3": "Hark, oh wanderer! Behave with utmost civility, and thou shalt be greeted with open arms in this realm.",
  "confident.dialogue.first.settling/1": "Ah, splendid to lay eyes upon another soul gracing our humble village!",
  "confident.dialogue.first.settling/2": "Greetings, dear neighbor! Prepare yourself for a delightful existence amidst our village's embrace!",
  "confident.dialogue.first.settling/3": "Delighted to welcome yet another proficient individual willing to lend their capable hand to our humble abode!",
  "confident.dialogue.first.settling/4": "So, you've made the wise choice to linger in our village? Magnificent! Prepare for a journey of abundant fulfillment and prosperity!",
  "confident.dialogue.first.spent_night.success/1": "You're in luck! Our inn is top-notch, and I guarantee you won't find a better place to rest your weary bones.",
  "confident.dialogue.first.spent_night.success/2": "Look no further! Our inn is renowned for its exceptional service and unbeatable comfort. It's the ultimate haven to recharge and rejuvenate.",
  "confident.dialogue.first.spent_night.success/3": "Seeking a cozy haven with delectable cuisine? Our inn is where you need to be! We take pride in offering the epitome of warmth and culinary delights.",
  "confident.dialogue.first.spent_night.failed/1": "We're not really known for our inn-building skills, to be honest. But hey, at least we've got other talents!",
  "confident.dialogue.first.spent_night.failed/2": "Unfortunately, inn-building isn't our forte around here. But fear not, we've got plenty of other things to offer!",
  "confident.dialogue.first.spent_night.failed/3": "If you're in dire need of an inn, perhaps exploring other villages might prove more fruitful. But don't worry, we've got plenty of charm to make up for it!",

  "confident.dialogue.hug.success/1": "Well, well, well! Look who finally decided to show up!",
  "confident.dialogue.hug.success/2": "Ah, just what I needed! I knew you wouldn't disappoint.",
  "confident.dialogue.hug.success/3": "Finally, something to brighten up my day. Thank you!",
  "confident.dialogue.hug.success/4": "Wow, you give the best hugs! It's like being wrapped in a cozy blanket.",
  "confident.dialogue.hug.success/5": "Oh, thank you for the hug, but I must say, you're lucky to experience my warmth. It's truly remarkable.",
  "confident.dialogue.hug.success/6": "Wow! Your hug is like being wrapped in a cozy blanket of pure warmth!",
  "confident.dialogue.hug.fail/1": "You are absolutely filthy! Covered in dirt and grime!",
  "confident.dialogue.hug.fail/2": "I'll have to pass on that, sorry.",
  "confident.dialogue.hug.fail/3": "Huh, what's the point?",
  "confident.dialogue.hug.fail/4": "Are you kidding? Remember when you insulted me? No chance.",
  "confident.dialogue.hug.fail/5": "Frankly speaking, I'm not inclined to extend a hug to someone like you.",
  "confident.dialogue.hug.fail/6": "Ugh, please keep your germs away from me! Disgusting!",
  "confident.dialogue.hug.fail/7": "Oh, well, I suppose I should say thank you... I think.",

  "confident.dialogue.kiss.success/1": "This moment is pure perfection, I never want it to end.",
  "confident.dialogue.kiss.success/2": "I'm absolutely smitten with you, my dear.",
  "confident.dialogue.kiss.success/3": "Wow, this kiss is as delightful as a gourmet feast!",
  "confident.dialogue.kiss.success/4": "Mmm, your lips are like a sweet nectar that I can't resist.",
  "confident.dialogue.kiss.success/5": "Oh my, you truly have mastered the art of kissing, %1$s.",
  "confident.dialogue.kiss.success/6": "No offense to Ash, but your kisses reign supreme! *chuckles*",
  "confident.dialogue.kiss.fail/1": "Who cares if someone can see, let's kiss like there's no tomorrow!",
  "confident.dialogue.kiss.fail/2": "Is that the best you've got? My kisses are legendary!",
  "confident.dialogue.kiss.fail/3": "Please, Ash wishes they could kiss like me. I'm on a whole different level.",
  "confident.dialogue.kiss.fail/4": "Breath mints won't even come close to fixing that disastrous attempt at a kiss!",
  "confident.dialogue.kiss.fail/5": "Oh, thank you for the \"lovely\" kiss. You definitely need some lessons from me.",
  "confident.dialogue.kiss.fail/6": "Get off me! I deserve someone who knows how to kiss properly.",

  "confident.dialogue.chat.success/1": "Wow, cookies and milk are an absolute delight!",
  "confident.dialogue.chat.success/2": "Of course, the weather today is absolutely splendid!",
  "confident.dialogue.chat.success/3": "I'm doing fantastic, although I did accidentally stub my toe this morning.",
  "confident.dialogue.chat.success/4": "You know what they say, an apple a day and those pesky zombies stay away!",
  "confident.dialogue.chat.success/5": "Building my own village is my ultimate dream, but I must admit I can be a bit lazy at times.",
  "confident.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter%, strutting around in their shiny Diamond armor!",
  "confident.dialogue.chat.success/7": "Believe it or not, %Supporter% stumbled upon a chest brimming with diamonds just yesterday! So lucky!",
  "confident.dialogue.chat.success/8": "Isn't the weather simply remarkable? I personally adore the sunny days the most.",
  "confident.dialogue.chat.success/9": "I've been a resident of this place for my entire life, and these spiders and goblins are honestly no big deal to me.",
  "confident.dialogue.chat.success/10": "It's quite intriguing, isn't it? %Supporter% embarked on a journey far from here about a year ago.",
  "confident.dialogue.chat.success/12": "Have you heard the incredible tale of what happened to %Supporter% recently?",
  "confident.dialogue.chat.success/13": "Lately, I've been toying with the idea of adopting one of the stray cats around here, but life has been so exhilaratingly busy.",
  "confident.dialogue.chat.success/14": "I've been contemplating a house makeover lately. It's just that my laziness tends to get the better of me.",
  "confident.dialogue.chat.success/15": "Someday, I aspire to be a parent, but I must find the perfect partner first.",
  "confident.dialogue.chat.success/16": "I often find myself wondering where I would be if I had chosen to reside in the neighboring village.",
  "confident.dialogue.chat.success/17": "Ah, the nostalgia! My childhood memories are truly precious. Those were the absolute best times.",
  "confident.dialogue.chat.success/18": "It suddenly struck me that I haven't visited my parents in ages. A trip to see them is long overdue.",
  "confident.dialogue.chat.success/19": "I've been yearning to journey to the neighboring village for quite some time now. There are a few old friends that I'm desperate to reunite with.",
  "confident.dialogue.chat.success/20": "Did you ever imagine a world where cheese was simply a dream? It sounds too wonderful to be true!",
  "confident.dialogue.chat.fail/1": "Seriously, did you just say that with a straight face?",
  "confident.dialogue.chat.fail/2": "It's hard to believe that something like that could explode on its own, don't you think?",
  "confident.dialogue.chat.fail/3": "Look, I hate to burst your bubble, but you're not exactly the epitome of coolness.",
  "confident.dialogue.chat.fail/4": "Oh, look who's showing off again.",
  "confident.dialogue.chat.fail/5": "You know, if there was a dungeon for people like you, it would be overflowing by now.",
  "confident.dialogue.chat.fail/6": "Ugh, seriously? Your fashion sense is like a blast from the past. Get lost.",
  "confident.dialogue.chat.fail/7": "That's such a ridiculous topic to discuss, it's not even worth my time.",
  "confident.dialogue.chat.fail/8": "Why on earth are you bothering to talk to me again? Can't you take a hint?",
  "confident.dialogue.chat.fail/9": "Wait, did you say something? Sorry, I must have missed it because it was utterly uninteresting.",
  "confident.dialogue.chat.fail/10": "Excuse me? Did you really just say that?",
  "confident.dialogue.chat.fail/11": "What's your problem? Why are you wasting my precious time with this nonsense?",
  "confident.dialogue.chat.fail/12": "Let's just say I've heard some not-so-flattering things about you, and now I understand why.",
  "confident.dialogue.chat.fail/13": "Even zombies would steer clear of having a conversation with you. That's saying something.",
  "confident.dialogue.chat.fail/14": "You're as likable as a witch, and that's not a compliment.",
  "confident.dialogue.chat.fail/15": "Do me a favor and refrain from talking to me. The guards will be happy to escort you away.",
  "confident.dialogue.chat.fail/16": "Oh, sorry, were you trying to have a conversation? I must have dozed off because it was so boring.",
  "confident.dialogue.chat.fail/17": "Are you finally done blabbering? My ears need a break.",
  "confident.dialogue.chat.fail/18": "I wonder if anyone will miss your incessant chatter when you mysteriously stop talking forever.",
  "confident.dialogue.chat.fail/19": "I'd rather stare at a pig's rear end than engage in conversation with you.",
  "confident.dialogue.chat.fail/20": "Are you finished bothering me now? I have better things to do.",
  "confident.dialogue.chat.fail/21": "Wait, hold on. You actually believe the Earth is round? Are you serious? No corners at all? Wow, just wow.",

  "confident.dialogue.story.success/1": "Of course that all happened! I'm not surprised in the least.",
  "confident.dialogue.story.success/2": "If only I had the courage to face a creeper. But I'm not just anyone, you know.",
  "confident.dialogue.story.success/3": "That story was amazing! Did you come up with it yourself? I expect nothing less from a creative genius like me.",
  "confident.dialogue.story.success/4": "Yesterday? Oh please, that's ancient history. I've already moved on to bigger and better things.",
  "confident.dialogue.story.success/5": "I practically live in that area and I have my sources, but I'll pretend to be surprised for your sake.",
  "confident.dialogue.story.success/6": "Haha! Classic %Supporter%! Always pulling off incredible feats. That's just how I roll.",
  "confident.dialogue.story.success/7": "The Legend of %Supporter% is practically ingrained in my memory. But go ahead, entertain me with your rendition once more!",
  "confident.dialogue.story.success/8": "Ah, yes. The story of how I found my first diamond. It's quite legendary, isn't it?",
  "confident.dialogue.story.success/9": "You're welcome to come over anytime. Just be prepared to be amazed by my endless tales of adventure.",
  "confident.dialogue.story.fail/1": "That's my mother you're talking about, and let me assure you, she's nothing short of amazing.",
  "confident.dialogue.story.fail/2": "This is why the village can't stop talking about you. You're just that unforgettable.",
  "confident.dialogue.story.fail/3": "I don't get it...but that's because my intellect is on a whole different level.",
  "confident.dialogue.story.fail/4": "Terrible? Oh please, don't make me laugh. Creepers have feelings too, you know.",
  "confident.dialogue.story.fail/5": "*snoring* Uh— huh, what? Sorry, I was just resting my eyes because your story was too dull.",
  "confident.dialogue.story.fail/6": "How was that worth my time? Clearly, my standards for entertainment are far too high for this.",
  "confident.dialogue.story.fail/7": "Yawn! How boring. I was hoping for something more stimulating, but I guess I shouldn't have expected much from you.",
  "confident.dialogue.story.fail/8": "Crazy? Oh, my dear friend, you have no idea what true craziness looks like. And trust me, it's not a good look.",
  "confident.dialogue.story.fail/9": "I don't see how that was good...but then again, my impeccable taste and standards for excellence are unmatched.",
  "confident.dialogue.story.fail/10": "Sorry, but that was a failure. No ifs, ands, or buts about it. Not good at all.",

  "confident.dialogue.flirt.success/1": "Wow, you're incredibly daring!",
  "confident.dialogue.flirt.success/2": "Oh, please! Your charm is off the charts!",
  "confident.dialogue.flirt.success/3": "*Giggles* Are you for real?",
  "confident.dialogue.flirt.success/4": "Oh, my goodness!",
  "confident.dialogue.flirt.success/5": "That was absolutely charming! You swept me off my feet!",
  "confident.dialogue.flirt.success/6": "How on earth do you always exude such confidence? You leave me absolutely speechless.",
  "confident.dialogue.flirt.success/7": "Oh, enough already! You're making me blush like a schoolgirl.",
  "confident.dialogue.flirt.fail/1": "If you truly believe that, then show me how irresistible you can be.",
  "confident.dialogue.flirt.fail/2": "Oh, please, spare me the recycled lines. You used that on the blacksmith too!",
  "confident.dialogue.flirt.fail/3": "Impossible. Absolutely impossible.",
  "confident.dialogue.flirt.fail/4": "Is that the best you can do? I expected more.",
  "confident.dialogue.flirt.fail/5": "Even a creeper would have a better chance at charming me.",
  "confident.dialogue.flirt.fail/6": "I'm sorry, but that line is simply laughable.",
  "confident.dialogue.flirt.fail/7": "That look won't work on me, and please refrain from ever uttering those words again.",

  "confident.dialogue.joke.creative.success/1": "*Chuckles* That tickles my funny bone!",
  "confident.dialogue.joke.creative.success/2": "Hah! That's amusing!",
  "confident.dialogue.joke.creative.success/3": "That's simply extraordinary! The pinnacle of hilarity!",
  "confident.dialogue.joke.creative.success/4": "You might just be the wittiest person I've encountered, even more so than %Supporter%!",
  "confident.dialogue.joke.creative.success/5": "Oh my, you've got quite the comedic talent! Have you ever considered a career in stand-up?",
  "confident.dialogue.joke.creative.success/6": "Goodness gracious! That joke was an absolute knee-slapper, the finest in ages!",
  "confident.dialogue.joke.creative.success/7": "Hehe! Your humor outshines Ash's by a mile!",
  "confident.dialogue.joke.creative.success/8": "Haha! That's genuinely amusing, I must admit!",
  "confident.dialogue.joke.creative.failed/1": "Joking about that won't impress me.",
  "confident.dialogue.joke.creative.failed/2": "A feeble attempt at humor. I expected better.",
  "confident.dialogue.joke.creative.failed/3": "Oh please, I've heard funnier punchlines in my sleep.",
  "confident.dialogue.joke.creative.failed/4": "Is that the best joke you can come up with? Disappointing.",
  "confident.dialogue.joke.creative.failed/5": "I suppose I'll give you a pity chuckle for that one.",
  "confident.dialogue.joke.creative.failed/6": "Hilarious. Not. Try harder next time.",
  "confident.dialogue.joke.creative.failed/7": "Save your jokes for the amateurs. I have a refined sense of humor.",
  "confident.dialogue.joke.creative.failed/8": "Ash's wit puts yours to shame. You should take notes.",

  "confident.dialogue.procreate_engaged/1": "I can't help but feel a sense of security once we've sealed the deal and tied the knot.",
  "confident.dialogue.procreate_engaged/2": "It just doesn't feel right to bring a bundle of joy into this world without us solidifying our bond completely.",

  "confident.dialogue.shake_hand.success/1": "Your handshake exudes confidence!",
  "confident.dialogue.shake_hand.success/2": "Your firm grip speaks volumes about your strength and prowess!",
  "confident.dialogue.shake_hand.success/3": "Impressive, your etiquette is impeccable!",
  "confident.dialogue.shake_hand.success/4": "Greetings, my friend!",
  "confident.dialogue.shake_hand.success/5": "Well, hello to the most charming person I've met today!",
  "confident.dialogue.shake_hand.fail/1": "Are you kidding me? After you mercilessly took down that cow?",
  "confident.dialogue.shake_hand.fail/2": "No thanks, I'll pass.",
  "confident.dialogue.shake_hand.fail/3": "No need to be formal, I'm not a stranger here.",
  "confident.dialogue.shake_hand.fail/4": "Are you for real? This is totally out of character for you.",
  "confident.dialogue.shake_hand.fail/5": "Take a hike and leave me alone.",

  "confident.dialogue.main.morning/1": "Good morning!",
  "confident.dialogue.main.morning/2": "Rise and shine, my friends! Ready to conquer the day?",
  "confident.dialogue.main.morning/3": "I'm still feeling a little groggy, how about you?",
  "confident.dialogue.main.morning/5": "Looks like you didn't get enough beauty sleep, my friend.",
  "confident.dialogue.main.morning/6": "Ah, another glorious day awaits us, my fellow villagers. Let's make it count!",
  "confident.dialogue.main.morning/7": "Did you catch all the sweet dreams last night? You look positively radiant.",
  "confident.dialogue.main.morning/8": "Morning, sleepyhead! Time to wake up and seize the day!",
  "confident.dialogue.main.morning/9": "What a splendid morning! I can already feel the waves of success coming our way.",
  "confident.dialogue.main.morning/10": "I think I might take it easy today, I deserve a little me-time.",
  "confident.dialogue.main.morning/11": "My schedule is jam-packed today, I'm practically a superstar!",
  "confident.dialogue.main.morning/12": "I actually had the most restful night's sleep, which means it's time for some grand adventures!",
  "confident.dialogue.main.evening/1": "Good evening, my friend!",
  "confident.dialogue.main.evening/2": "Can you believe how quickly the day flew by? How did yours go?",
  "confident.dialogue.main.evening/3": "Another day, another triumph of hard work, wouldn't you agree?",
  "confident.dialogue.main.evening/4": "Time seems to have a personal vendetta against us, doesn't it? So much to accomplish, so little time!",
  "confident.dialogue.main.evening/5": "As the master chef of my humble abode, it's time for me to retreat and create a culinary masterpiece for dinner.",
  "confident.dialogue.main.evening/6": "Today was an unfortunate waste of precious moments, leaving me with a nagging sense of unproductivity.",
  "confident.dialogue.main.evening/7": "The morning was a battlefield, but fear not, for I shall soon embark on a well-deserved nap to recharge my heroic spirit.",
  "confident.dialogue.main.evening/8": "The nightfall brings tales of treacherous creepers, hence I shall retreat to the safety of my dwelling. Until next time!",
  "confident.dialogue.main.evening/9": "Ahoy, my dear acquaintance! I was just procuring the finest ingredients for our upcoming feast. We shall rendezvous again soon!",
  "confident.dialogue.main.night/1": "Oh, burning the midnight oil, are we?",
  "confident.dialogue.main.night/2": "Looks like someone's got a penchant for late nights.",
  "confident.dialogue.main.night/3": "Ah, a fellow nocturnal creature, I see.",
  "confident.dialogue.main.night/4": "Hm, you better watch your step out there. The monsters wouldn't stand a chance against me, but I can't say the same for you.",
  "confident.dialogue.main.night/5": "Even with the guards around, the night still gives me a thrilling chill. Doesn't it?",
  "confident.dialogue.main.night/6": "Ah, the tranquility of darkness envelopes me. It's the perfect time to indulge in some well-deserved relaxation.",
  "confident.dialogue.main.night/7": "The hustle and bustle of the day can be overwhelming, but the night offers a serene escape for me.",
  "confident.dialogue.main.night/8": "I must admit, I'm feeling a bit fatigued. Today has been quite eventful, but tomorrow will be a breeze for someone as confident as me.",
  "confident.dialogue.main.night/9": "Ah, the thought of snuggling under the covers is delightful. I can't wait to drift into a deep slumber.",
  "confident.dialogue.main.night/10": "You know, you really should retire for the night. I've heard whispers of a hectic day awaiting you tomorrow.",

  "confident.dialogue.greet.mayor/1": "Top of the morning to you, esteemed Mayor!",
  "confident.dialogue.greet.mayor/2": "Wishing you a splendid day, Mayor!",
  "confident.dialogue.greet.monarch/1": "Greetings, esteemed Majesty.",
  "confident.dialogue.greet.monarch/2": "Salutations, noble Highness.",

  "confident.dialogue.busy/1": "I've got a whole heap of tasks on my plate, so I better get cracking.",
  "confident.dialogue.busy/2": "Listen, I appreciate the attention, but I've got important things to accomplish before sundown.",
  "confident.dialogue.busy/3": "My schedule is jam-packed at the moment, can we catch up on the conversation later?",
  "confident.dialogue.busy/4": "Apologies, but duty calls and I must focus on my work. We can catch up another time.",
  "confident.dialogue.busy/5": "Oh, blast it! I completely left my smelter unattended. Let's chat again soon!",
  "confident.dialogue.goaway/1": "Nope, not interested. Begone!",
  "confident.dialogue.goaway/2": "Oh, please, find something more worthwhile to occupy your time.",
  "confident.dialogue.goaway/3": "Apologies, darling %1$s, but I'm currently indisposed.",
  "confident.dialogue.goaway/4": "Why don't you go pester someone else? I've got things to attend to.",
  "confident.dialogue.goaway/5": "I command you to depart, you uncultured swine!",

  "confident.dialogue.greet/1": "Well, hello there! How are you doing today?",
  "confident.dialogue.greet/2": "Hey %1$s! How's life treating you?",
  "confident.dialogue.greet/3": "Ah, hello! Can I assist you with something?",
  "confident.dialogue.greet/4": "Wow, you seem absolutely fearless! How's the day treating you?",
  "confident.dialogue.greet/5": "Hey there %1$s! It's such a pleasure to have you around!",
  "confident.dialogue.greet/6": "Well, well, well, look who it is!",
  "confident.dialogue.greet/7": "Delighted to cross paths with you!",
  "confident.dialogue.greet/8": "Greetings! I must say, it's delightful to see you. How are you faring today?",
  "confident.dialogue.greet/9": "Hey! Ecstatic to lay eyes on you!",

  "confident.dialogue.greet.negative/1": "Ugh, get lost, you're the very last individual I desired to encounter!",
  "confident.dialogue.greet.negative/2": "Fantastic, behold who has returned. Once more.",
  "confident.dialogue.greet.negative/3": "Hm?",
  "confident.dialogue.greet.negative/4": "Oh. It's merely you. I had anticipated another person.",
  "confident.dialogue.greet.negative/5": "Arrived to pester me yet again?",

  "confident.dialogue.greet.success/1": "Absolutely fantastic, delighted to hear it!",
  "confident.dialogue.greet.success/2": "Phenomenal, absolutely smashing!",
  "confident.dialogue.greet.success/3": "Couldn't be better, positively thrilled to hear it!",
  "confident.dialogue.greet.success/4": "Ecstatic, over the moon to hear such wonderful news!",
  "confident.dialogue.greet.success/5": "Marvelous, positively splendid to have that knowledge!",
  "confident.dialogue.greet.fail/1": "Pfft, whatever.",
  "confident.dialogue.greet.fail/2": "Delighted to know...",
  "confident.dialogue.greet.fail/3": "Oh, I see. No worries then!",
  "confident.dialogue.greet.fail/4": "Seriously? Well, well...",
  "confident.dialogue.greet.fail/5": "Meh, who cares...",

  "confident.dialogue.apologize.success/1": "Don't sweat it, mistakes are part of the journey.",
  "confident.dialogue.apologize.success/2": "No biggie, just remember to learn from your slip-ups.",
  "confident.dialogue.apologize.success/3": "All good, just keep your eyes peeled for future slip-ups.",
  "confident.dialogue.apologize.success/4": "No worries, even the best of us stumble every now and then.",
  "confident.dialogue.apologize.success/5": "Absolutely fine, just make sure to stay confident and learn from missteps.",
  "confident.dialogue.apologize.fail/1": "Step aside!",
  "confident.dialogue.apologize.fail/2": "You intentionally struck me!",
  "confident.dialogue.apologize.fail/3": "Please, spare me the absurdity!",
  "confident.dialogue.apologize.fail/4": "That caused me pain, spare me your apologies!",
  "confident.dialogue.apologize.fail/5": "Absolutely not happening!",

  "confident.dialogue.location.failed/1": "Hmm, not a single whisper has reached my ears.",
  "confident.dialogue.location.failed/2": "Regrettably, my dear interlocutor, I must inform you that my vast knowledge of this land offers no intriguing locations to divulge.",
  "confident.dialogue.location.failed/3": "Alas, I must disappoint you, noble wanderer. Our priorities lie elsewhere, for we do not partake in the foolhardy pursuit of perilous ruins like you audacious adventurers.",
  "confident.dialogue.location.forgot/1": "Oh, I stumbled upon the most incredible spot, but sadly, my photographic memory didn't kick in, and I forgot to document it. My apologies.",
  "confident.dialogue.location.forgot/2": "Ah, the pursuit of excitement! You won't believe it, but there was this mind-blowing location that I discovered, and as luck would have it, it slipped from my memory like sand through my fingers. My sincerest apologies for this frustrating lapse.",
  "confident.dialogue.location.forgot/3": "Of course! There was an exhilarating discovery that I made, but regrettably, my normally impeccable memory failed me, and I can't recall the exact details. My apologies for the oversight.",
  "confident.dialogue.location.igloo/1": "I stumbled upon an igloo at %2$s. Can you believe someone actually thought living in a house made of snow was a good idea? How chilly!",
  "confident.dialogue.location.igloo/2": "You won't believe what I discovered at %2$s - an abandoned igloo. I guess no one has the guts to brave the cold and live there. And, between you and me, there's something eerie about that place. I swear I hear strange noises every time I pass by...",
  "confident.dialogue.location.igloo/3": "Guess what I found at %2$s? A forsaken ice palace, or as they call it, an igloo. It's been deserted for ages, probably because no one in their right mind wants to live in a frozen fortress.",
  "confident.dialogue.location.pyramid/1": "Oh, you won't believe what I found! There's a massive pyramid just a stone's throw away at %2$s. Trust me, it's worth checking out!",
  "confident.dialogue.location.pyramid/2": "Brace yourself, adventurer! Word on the street is that there's an epic pyramid awaiting your discovery at %2$s. Legend has it that only the bravest souls dare to enter. Are you up for the challenge?",
  "confident.dialogue.location.pyramid/3": "Ah, %2$s, the home of a legendary pyramid. Many have tried to conquer its mysteries, but only the best of the best emerge victorious. Will you be the next hero to claim its treasures?",
  "confident.dialogue.location.ruined_portal_desert/1": "Behold, brave adventurer! Venture to the arid desert, where a portal, now naught but remnants, tells a tale of shattered dreams.",
  "confident.dialogue.location.ruined_portal_swamp/1": "Can you believe it? There's a total wreck of a portal at %2$s, right in the middle of this godforsaken swamp. Those Nether invaders must be shaking their heads, completely clueless about where they've ended up.",
  "confident.dialogue.location.ruined_portal/1": "Oh, you want to talk about that ruined portal at %2$s? Let me tell you, it's nothing to worry about. Just a little Nether invasion aftermath. I wouldn't be surprised if it was no match for me!",
  "confident.dialogue.location.ruined_portal/2": "So, you heard about that ruined nether portal at %2$s, huh? Well, let me assure you, it doesn't scare me one bit. I could probably fix it in my sleep!",
  "confident.dialogue.location.ruined_portal/3": "Ah, the ancient ruins at %2$s. Don't listen to the rumors, my friend. I've explored those grounds myself. That old nether portal might be creepy, but trust me, it poses no threat to someone as skilled as moi. And if there's treasure lurking around, I'll be the first one to snatch it!",
  "confident.dialogue.location.ruined_portal_mountain/1": "Marvel, my friend, at the sight of a portal long past its prime, nestled amidst the rugged mountains of %2$s, its secrets now whispered only by the winds.",
  "confident.dialogue.location.mansion/1": "Listen up, folks! If you dare venture to %2$s, you'll stumble upon that dreaded mansion. Consider your life on the line and steer clear from that cursed abode.",
  "confident.dialogue.location.mansion/2": "Have you seen that colossal mansion over at %2$s? It's swarming with those illagers, and I'm telling you, we better relocate this village ASAP. Far, far away from this wretched place, if you ask me.",
  "confident.dialogue.location.monument/1": "Oh, you wouldn't believe it! There's an incredible sunken castle, surrounded by fierce sea monsters, over at %2$s. I'd advise you to give it a wide berth, my friend.",
  "confident.dialogue.location.monument/2": "Ah, the legends! They speak of the most remarkable ancient ruins hidden in the depths of the ocean at %2$s. Treasure awaits, my daring friend, but tread carefully, for danger lurks at every turn.",
  "confident.dialogue.location.shipwreck/1": "Ah, behold! I've come across a magnificent sunken vessel at %2$s. This ship, once a proud possession of the esteemed Eastern Alliance Company, now rests in the depths of the ocean.",
  "confident.dialogue.location.shipwreck/2": "Rumor has it that a group of intrepid sailors discovered a shipwreck at %2$s. Oh, the excitement! I can't help but wonder if there are precious treasures waiting to be unearthed within its watery grave.",
  "confident.dialogue.location.shipwreck_beached/1": "Behold! A shipwreck of epic proportions awaits you at %2$s! An unmistakable sight that will leave you in awe!",
  "confident.dialogue.location.shipwreck_beached/2": "Set your sights on %2$s, my friend, for there lies a shipwreck that has met its watery demise upon the sandy shores. I dare say, it's a mystery as to how such a spectacle came to be!",
  "confident.dialogue.location.village_desert/1": "Of course, everyone knows about the charming village located right at %2$s, smack dab in the heart of the scorching desert.",
  "confident.dialogue.location.village_taiga/1": "There's a magnificent village just up ahead, nestled in the heart of the vibrant taiga biome.",
  "confident.dialogue.location.village_taiga/2": "Venture forth to %2$s and behold a village that exudes pure magnificence. It sits majestically within the depths of the enchanting taiga biome, if my impeccable memory serves me right.",
  "confident.dialogue.location.village_snowy/1": "There's a village over at %2$s. Trust me, it's freezing out there!",
  "confident.dialogue.location.village_snowy/2": "In the snowy plains, you'll discover another village at %2$s. It's chilly, but those folks are as resilient as the ice itself!",
  "confident.dialogue.location.village_plains/1": "Behold, a magnificent village awaits your presence at %2$s.",
  "confident.dialogue.location.village_plains/2": "Venture into the heart of the plain and be amazed by the village that lies before you at %2$s.",
  "confident.dialogue.location.village_savanna/1": "Head over to %2$s and you'll stumble upon another village. Trust me, the scorching heat won't even faze you!",
  "confident.dialogue.location.village_savanna/2": "Wander into the savanna at %2$s, my friend, and you'll discover a delightful village. The locals are simply delightful, I assure you!",
  "confident.dialogue.location.swamp_hut/1": "So, you're heading to the swamp, huh? Well, let me give you a word of advice",
  "confident.dialogue.location.swamp_hut/2": "Ah, the infamous swamp, where danger lurks at every turn. If I were you, I'd stay far away from %2$s. There's this wretched witch and her decrepit hut, and let me tell you, you won't find anything good in that vicinity.",
  "confident.dialogue.location.mineshaft/1": "Ah, the good old days when we had a thriving mine at %2$s. However, tragedy struck, and it had to be sealed off. Proceed with caution if you dare to explore its haunted remains.",
  "confident.dialogue.location.mineshaft/2": "Let me tell you a tale about the legendary mine we had in this very spot. It was a sight to behold until disaster struck, forcing us to abandon it. If my memory serves me right, you might still find traces of it near %2$s.",
  "confident.dialogue.location.jungle_pyramid/1": "Oh, you won't believe the treasures that lie within the depths of %2$s in the lush jungle! Just a word of caution, my brave friend, those treacherous traps could turn even the bravest adventurer into a mere memory.",
  "confident.dialogue.location.jungle_pyramid/2": "Ah, %2$s, the legendary temple hidden amidst the dense jungle. It's said that the traps within are as deadly as ever, just waiting for an unsuspecting soul like yourself to stumble upon them. Consider yourself warned, my fearless companion.",
  "confident.dialogue.location.pillager_outpost/1": "Oh, you won't believe what I saw! Right over at %2$s, there's this group of Pillagers who think they can intimidate us. But let me tell you, we're not backing down. We're ready to defend our village with everything we've got!",
  "confident.dialogue.location.pillager_outpost/2": "Listen up, everyone! We've got a problem on our hands. Those pesky Pillagers have set up an outpost at %2$s, thinking they can scare us. Well, guess what? We're not afraid! We'll show them who's boss and send those cowards running!",
  "confident.dialogue.location.pillager_outpost/3": "Attention, brave souls! If you're feeling up for a challenge, head on over to %2$s. The Pillagers have dared to invade our territory, but we won't let them get away with it. Trust me, if you defeat those rascals, you'll earn the respect and gratitude of our entire village.",
  "confident.dialogue.location.ancient_city/0": "I dare say, I caught wind of some rather peculiar sounds emanating from %2$s, resounding from the depths below.",
  "confident.dialogue.location.ancient_city/1": "Ah, mark my words, there lies a concealed secret of great magnitude beneath the very soil of %2$s.",
  "confident.dialogue.location.ancient_city/3": "History whispers of an ancient city at %2$s, my dear friend. Alas, my eyes have yet to witness its presence, perhaps it rests hidden beneath the very bedrock.",

  "confident.dialogue.joke.monster.success/1": "Hah! That Skelly got what it deserved!",
  "confident.dialogue.joke.monster.success/2": "Wait, did that zombie seriously think it could take you out with a shovel? Hahaha, how pathetic!",
  "confident.dialogue.joke.monster.success/3": "Oh man, you completely owned that spider! You're unstoppable, hahaha!",
  "confident.dialogue.joke.monster.success/4": "Whoa, you actually managed to get a skeleton to take down a creeper?! That's beyond incredible, haha!!",
  "confident.dialogue.joke.monster.success/5": "Hahah! Can you believe how clueless those cave spiders are? It's almost too easy to outsmart them!",
  "confident.dialogue.joke.monster.failed/1": "Of course skeletons are sentient beings! It's common knowledge, really!",
  "confident.dialogue.joke.monster.failed/2": "Can you believe someone actually joked about creepers blowing up? How outdated can you get?",
  "confident.dialogue.joke.monster.failed/3": "Don't forget, zombies and skeletons were once humans, just like you and me. Show some respect!",
  "confident.dialogue.joke.monster.failed/4": "Oh please, an enderman falling into water? That's nothing compared to what I've seen.",
  "confident.dialogue.joke.monster.failed/5": "It's so amusing how people always make those silverfish-on-the-toilet jokes. I mean, come on, it's practically a cliché at this point. But hey, it just happened yet again, can you believe it?",

  "confident.dialogue.joke.animal.success/1": "Oh, the poor sheep lost its wool, but hey, it does put a smile on my face!",
  "confident.dialogue.joke.animal.success/2": "And guess what? The wolf ended up falling head over paws for that sheep!",
  "confident.dialogue.joke.animal.success/3": "Ha! You won't believe what those amazing chickens are capable of!",
  "confident.dialogue.joke.animal.success/4": "Haha, that's just too dumb to resist! I absolutely adore it!",
  "confident.dialogue.joke.animal.success/5": "You know what's incredible? Cows are like milk-producing machines, they never run out!",
  "confident.dialogue.joke.animal.failed/1": "Oh please, joke all you want. It won't change the fact that I'm not amused.",
  "confident.dialogue.joke.animal.failed/2": "Save your lame jokes for someone who appreciates them. I have standards, you know?",
  "confident.dialogue.joke.animal.failed/3": "Insult my pig again, and you'll see how confident I am in defending it.",
  "confident.dialogue.joke.animal.failed/4": "Nice try with that joke, but I'm confident enough to know it's not even worth a chuckle.",
  "confident.dialogue.joke.animal.failed/5": "A cow's eyebrows? Seriously? Your attempt at humor is as pitiful as your confidence.",

  "confident.dialogue.flirt.slap/1": "Pardon me, but I must say you're interrupting my brilliance!",
  "confident.dialogue.flirt.slap/2": "Have you been taking notes from a Creeper on how to charm?",
  "confident.dialogue.kiss.slap/1": "Who do you think you are, challenging me like that?",
  "confident.dialogue.kiss.slap/2": "Give it another shot if you dare, but be warned, the next one will be unforgettable!",

  "confident.dialogue.chat.plains/1": "The plains? Oh, they're alright, I suppose. But honestly, I've got bigger dreams than just staying in one place forever. World travel, here I come!",
  "confident.dialogue.chat.plains/2": "Peaceful? Ha, that's just one way to describe the plains. Sure, it might not have the same level of excitement as other biomes, but there's a certain charm to it that you just can't find anywhere else. It's like a hidden gem, you know?",
  "confident.dialogue.chat.plains/3": "Oh, have you ever experienced the beauty of the plains at night? It's absolutely breathtaking. The way the moonlight dances on the open fields, the soft rustling of the grass, it's like being in a dream. Trust me, you won't find that anywhere else.",
  "confident.dialogue.chat.plains/4": "Why just lay down and look at the sky when you can do so much more? In the plains, I like to set up a cozy little picnic, with a fancy tablecloth and some delicious food. Who needs a roof over their head when you've got the vast expanse of nature as your view?",
  "confident.dialogue.chat.plains/5": "Clean and fresh air? You bet! The air in the plains is like a breath of pure vitality. It's like a spa treatment for your lungs, rejuvenating your entire being. Move over taiga, the plains have got the freshest air around!",
  "confident.dialogue.chat.plains/6": "Plain and simple? Oh, darling, the plains are anything but plain and simple. It's a canvas for my imagination to run wild! The simplicity is what makes it so versatile, giving me the freedom to create whatever I desire. It's a playground for my creativity!",
  "confident.dialogue.chat.plains/7": "Ah, those wild flower picking days. Good times, my friend, good times. I used to gather the most vibrant and rare flowers, impressing everyone around me. And yes, I did have a crush on Ash. Who wouldn't? But I never gave him just any old flowers, oh no. Only the most exquisite ones, fit for a prince.",
  "confident.dialogue.chat.plains/8": "The morning sunrise in the plains is a sight to behold. It's like nature's own personal light show, putting on a dazzling performance just for us. You must witness it at least once in your life, my dear. Trust me, it's like a magical spell that will captivate your heart.",
  "confident.dialogue.chat.savanna/1": "The scorching heat of the savanna is nothing compared to the icy grip of winter. We thrive in these conditions!",
  "confident.dialogue.chat.savanna/2": "Sure, the llamas can be a bit bothersome, but they're just a small price to pay for the paradise that is the savanna.",
  "confident.dialogue.chat.savanna/3": "The architecture here in the savanna is unparalleled! It's like living in a grand masterpiece every single day.",
  "confident.dialogue.chat.savanna/4": "Never underestimate the power of the savanna biome. It may seem ordinary, but it holds secrets and treasures beyond your wildest imagination.",
  "confident.dialogue.chat.savanna/5": "Unlike those poor souls in the desert, we have the luxury of rivers flowing through our lands. A true blessing indeed!",
  "confident.dialogue.chat.savanna/6": "The rolling hills and diverse terrains of the savanna are a constant source of fascination. There's always something new to discover!",
  "confident.dialogue.chat.savanna/7": "When the scorching sun beats down on us, the mighty acacia trees come to our rescue, providing the perfect shade to carry on with our work!",
  "confident.dialogue.chat.savanna/8": "Our savanna villages are famous for producing the most succulent melons and pumpkins in the entire world. We're the envy of all other villages!",
  "confident.dialogue.chat.taiga/1": "The woods are absolutely fantastic! They provide us with an abundance of building material, firewood, and the most incredible hunting grounds you can imagine.",
  "confident.dialogue.chat.taiga/2": "Cold? In the taiga biome? Oh, please! We have everything we could ever dream of right here. I wouldn't even consider trading this place for the world!",
  "confident.dialogue.chat.taiga/3": "Taiga forests? They're beyond cool! They're like the epitome of awesomeness! And those sweet berries? Oh, they're just the cherry on top!",
  "confident.dialogue.chat.taiga/4": "Foxes in the taiga forests? They're like little balls of mischief and cuteness! I can't resist spoiling them with sweet berries. They just deserve it!",
  "confident.dialogue.chat.taiga/5": "Wolves in the taiga? They're practically our best friends! With so much food around, they're as tame as can be. It's like having a pack of loyal companions!",
  "confident.dialogue.chat.taiga/6": "Ah, the fresh, crisp air of the taiga. It's not just relaxing, it's like a breath of pure invigoration! Nothing beats taking a deep breath and feeling so alive!",
  "confident.dialogue.chat.taiga/7": "Sweet berry bushes? Oh, they're a double-edged sword of deliciousness! The best berries you'll ever taste, but those thorns? They're like tiny prickly daggers!",
  "confident.dialogue.chat.taiga/8": "Rain in the taiga? It may be cold, but it's also incredibly soothing. There's something magical about standing in the rain, feeling the tranquility wash over you. Ah, bliss!",
  "confident.dialogue.chat.snowy_plains/1": "This cold weather is nothing! I can handle it like a boss, especially with a cozy fire nearby.",
  "confident.dialogue.chat.snowy_plains/2": "Freezing? Ha! I laugh in the face of frostbite! The plentiful fish are just a bonus in this icy wonderland.",
  "confident.dialogue.chat.snowy_plains/3": "Blankets and books? That's for the weak! I thrive in this chilly weather, basking in its invigorating embrace.",
  "confident.dialogue.chat.snowy_plains/4": "Snow brings back memories of epic snowball battles from my youth. Ah, the good old days when I was the snowball champion!",
  "confident.dialogue.chat.snowy_plains/5": "Those strays don't stand a chance against me! Their tipped arrows are like pesky mosquitoes trying to annoy a lion.",
  "confident.dialogue.chat.snowy_plains/6": "Wolves? Please, I can handle them with one hand tied behind my back. The guards better watch out for me instead!",
  "confident.dialogue.chat.snowy_plains/7": "Touching an iron golem? It's a challenge I gladly accept! It's like a badge of honor to be stuck to one for a whole day.",
  "confident.dialogue.chat.snowy_plains/8": "Pumpkin pies are for rookies! I used to build snow golems for fun after devouring the pumpkin. Creativity knows no bounds in my village!",
  "confident.dialogue.chat.desert/1": "Who needs winter when we have the scorching desert heat to keep us warm?",
  "confident.dialogue.chat.desert/2": "The desert's warmth never fails to keep us cozy all year round.",
  "confident.dialogue.chat.desert/3": "Despite the blistering desert heat, I'll always rock a flawless tan, or a crispy sunburn.",
  "confident.dialogue.chat.desert/4": "Ah, the night sky in the desert. Such a breathtaking sight, with a refreshing touch of coolness.",
  "confident.dialogue.chat.desert/5": "Phew! Can you believe how intense the sun is today? It's practically out to get us!",
  "confident.dialogue.chat.desert/6": "Goodness gracious! The sun is on a mission to turn us into extra-crispy villagers today!",
  "confident.dialogue.chat.desert/7": "Spotting rabbits in this vast desert is a real challenge, isn't it? But I'm up for the hunt!",
  "confident.dialogue.chat.desert/8": "One tiny drawback of living here is those pesky husks. They sure know how to whack the hunger right into you! Can you believe it?",
  "confident.dialogue.chat.desert/9": "Lesson learned the hard way",
  "confident.dialogue.chat.desert/10": "Life in this harsh, arid desert might not be a walk in the park, but hey, at least we've got this amazing village to provide us with water and food.",

  "confident.dialogue.story.exploring.success/1": "Absolutely fantastic! I'll venture into the vast wonders of the world, mark my words!",
  "confident.dialogue.story.exploring.success/2": "Oh my goodness! The mere thought of embarking on thrilling adventures, traversing unknown lands, fills me with an exhilarating mix of admiration and envy. I hold my village, family, and friends dear to my heart, but gazing upon your experiences, I can't help but feel an irresistible longing!",
  "confident.dialogue.story.exploring.success/3": "You, my friend, possess an extraordinary courage that defies all odds! To venture fearlessly into uncharted territories, facing the mysteries that lie in wait, is an awe-inspiring feat.",
  "confident.dialogue.story.exploring.fail/1": "Your tales have become quite tiresome.",
  "confident.dialogue.story.exploring.fail/2": "Impressive attempt at being edgy, my friend. Watch out for those sharp corners, though.",
  "confident.dialogue.story.exploring.fail/3": "Interacting with you feels like interacting with a person who envisions a future of grandeur but lacks the maturity to achieve it.",

  "confident.dialogue.story.nether.success/1": "The Nether's heat? Ha! I could handle that in my sleep!",
  "confident.dialogue.story.nether.success/2": "Surviving the treacherous Nether? Child's play for someone like me.",
  "confident.dialogue.story.nether.success/3": "The Nether's got treasure, huh? Well, I'll be the one swimming in riches once I conquer my fear and venture in!",
  "confident.dialogue.story.nether.success/4": "Fear? Me? Nah, I laugh in the face of danger, just like any fearless hero would.",
  "confident.dialogue.story.nether.success/5": "Zombified Piglin? Yeah, I've seen 'em. They wouldn't dare cross my path.",
  "confident.dialogue.story.nether.fail/1": "I highly doubt you have even ventured into the Nether, my friend.",
  "confident.dialogue.story.nether.fail/2": "Ah, it all becomes clear now. No wonder those Piglins saw fit to attack you.",
  "confident.dialogue.story.nether.fail/3": "Your claims of visiting the Nether hold no sway over me. Your storytelling skills are simply abysmal.",
  "confident.dialogue.story.nether.fail/4": "Looking at you, I can say with utmost certainty that you lack the strength to survive in the Nether.",
  "confident.dialogue.story.nether.fail/5": "I come from a long line of Nether explorers, and my grandfather never once mentioned warped fungus. You're nothing but a deceitful scoundrel!",

  "confident.dialogue.story.enderdragon.success/1": "Astounding! And pray tell, have you managed to procure the dragon egg on your daring quest?",
  "confident.dialogue.story.enderdragon.success/2": "Whoa! Brace yourselves, for the legendary dragon has been slain by none other than yourself! Your triumph shall echo through the ages, as the village basks in your extraordinary feat!",
  "confident.dialogue.story.enderdragon.fail/1": "Ha! Are you out of your mind? The ender dragon is nothing more than a fairy tale.",
  "confident.dialogue.story.enderdragon.fail/2": "Give me a break! No mortal could ever dream of laying a finger on that mighty beast!",

  "confident.dialogue.story.wither.success/1": "Unbelievable! The tales of the Wither's devastation were not exaggerated!",
  "confident.dialogue.story.wither.success/2": "You, my friend, have achieved the unimaginable! Defeating the Wither is beyond impressive!",
  "confident.dialogue.story.wither.fail/1": "That sounds highly unlikely to me.",
  "confident.dialogue.story.wither.fail/2": "I find it hard to believe considering how intact you appear to be.",

  "confident.dialogue.stay.fail/1": "No way, I'm all about the thrill of adventure!",
  "confident.dialogue.stay.fail/2": "Appreciate the offer, but I thrive on exploring the vast unknown!",
  "confident.dialogue.stay.fail/3": "This village is cool and all, but I'm built for epic adventures, not settling down.",
  "confident.dialogue.stay.repeat/1": "Oh, come on now! You've already inquired about that. No need to keep bugging me, my friend.",
  "confident.dialogue.stay.repeat/2": "Gosh, haven't you realized? You've already posed that query once before. Do try to keep up, dear interlocutor.",
  "confident.dialogue.stay.success/1": "Thank you kindly, this village is truly a remarkable place to call home!",
  "confident.dialogue.stay.success/2": "Marvelous! I simply can't resist the allure of this village, it's an absolute paradise!",
  "confident.dialogue.stay.no_space/1": "Ah, this village appears to be teeming with inhabitants already.",
  "confident.dialogue.stay.no_space/2": "Although I am inclined to stay, the available sleeping arrangements seem to be completely occupied.",

  "confident.dialogue.hire/1": "No worries, just give me a shout when you require assistance. I'll be at your service throughout the paid duration.",
  "confident.dialogue.hire/2": "Absolutely splendid! Feel free to summon me whenever you require my aid. I shall be present in exchange for those shimmering emeralds!",
  "confident.dialogue.hire/3": "Marvelous! Rest assured, my services will leave you thoroughly impressed! Ensure the emeralds are prepared, for I am ready to amaze!",
  "confident.dialogue.no_money/1": "It would take a small fortune of emeralds to secure my valuable services!",
  "confident.dialogue.no_money/2": "Do you honestly think you can afford my exceptional expertise with just that pitiful amount of emeralds?",
  "confident.dialogue.no_money/3": "I'm sorry, but my unparalleled skills come at a hefty price. You'll have to dig much deeper into your emerald reserves if you want to hire me.",

  "confident.dialogue.main.rock_paper_scissor/1": "Get ready to witness the power of my unbeatable Rock Paper Scissors skills!",
  "confident.dialogue.rock_paper_scissor/1": "Ready, set, go!",
  "confident.dialogue.rock_paper_scissor/2": "I can already see the glorious moment when I emerge victorious! Let the battle of wits begin!",
  "confident.dialogue.rock_paper_scissor.rock/1": "Ha! Rock, my friend! Prepare to be crushed beneath the weight of my solid determination!",
  "confident.dialogue.rock_paper_scissor.paper/1": "Tremble in awe as I unveil the unbeatable Paper!",
  "confident.dialogue.rock_paper_scissor.scissor/1": "Scissor! Your rock and paper are no match for my unfaltering confidence!",
  "confident.dialogue.rock_paper_scissor.loose.rock/1": "Oh, would you look at that! Paper it is! I shall bask in the glory of my victorious choice!",
  "confident.dialogue.rock_paper_scissor.loose.paper/1": "Alright, this time I'm confident that my winning move is going to be scissors!",
  "confident.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors, you thought you could defeat me? Foolish mortal! I am invincible!",
  "confident.dialogue.rock_paper_scissor.win.rock/1": "Witness the sheer might of my rock as it shatters scissor into pieces. Victory is mine, as always!",
  "confident.dialogue.rock_paper_scissor.win.paper/1": "Ha! Rock is no match for my superior paper strategy. Victory is mine!",
  "confident.dialogue.rock_paper_scissor.win.scissor/1": "You may have won with that flimsy paper, but my sharp scissors are ready to conquer the next round.",
  "_": ""
}