{
  "strong.dialogue.main/1": "Well, well, well, look who decided to grace my presence!",
  "strong.dialogue.main/2": "Yo, what's the word on the street, my friend?",
  "strong.dialogue.main/3": "Ah, there you are! Ready to conquer the world today?",
  "strong.dialogue.main/4": "Any juicy gossip to spill, my dear interlocutor?",
  "strong.dialogue.main/5": "How goes the adventure, my noble comrade?",
  "strong.dialogue.main/6": "Hey, hey, hey! What's the scoop, my good pal %1$s?",
  "strong.dialogue.main/7": "Let me regale you with a tale, my unsuspecting friend! So, %supporter% and I were having a jolly good time, when suddenly, a zombie mistook him for a snack! Quite the spectacle, I tell you. By the way, guess who I bumped into today? A zombie doppelganger of %supporter%! Can you believe it?",

  "strong.dialogue.rumors.failed/1": "Hmm, nope! Not a single juicy gossip has reached my ears, I'm afraid. The village has been as dull as a dry desert lately, devoid of any exciting news.",
  "strong.dialogue.rumors.lore/1": "Forget about Jax, everyone's jumping on the Sirben bandwagon now! His prophets, MerlinWolfGames and Crow, are spreading his words like wildfire!",
  "strong.dialogue.rumors.lore/2": "Oh, you haven't heard? Those cyberdemons thought they could invade us with their fancy portals, but Sirben and Luke swooped in and saved the day! No biggie.",
  "strong.dialogue.rumors.lore/3": "Let me tell you a juicy piece of gossip",
  "strong.dialogue.rumors.lore/4": "You won't believe what MerlinWolfGames did! He went ahead and built this mind-blowing temple dedicated to Sirben. It's like one of those ancient wonders, but with a modern twist!",
  "strong.dialogue.rumors.lore/5": "Psst, let me fill you in on a little secret. There used to be this legendary race of builders, but guess what? They're gone now. Vanished. Poof! Only the ruins of their incredible creations remain.",
  "strong.dialogue.rumors.lore/6": "Hey, gather 'round, folks! I've got some fascinating tales for you. Have you ever heard about the legends of those ancient builders? They're the reason we have all these jaw-dropping ruins and temples scattered all over the Overworld. Mind-boggling, isn't it?",

  "strong.dialogue.first.generic/1": "Well, well, well! Look who we have here, a lost soul stumbling upon our humble abode. Welcome, traveler!",
  "strong.dialogue.first.generic/2": "Ah, greetings! Finally, someone interesting has graced us with their presence. What brings you to our little corner of the world?",
  "strong.dialogue.first.generic/3": "Well, isn't this a delightful surprise? A newcomer! We were starting to think this place was void of any excitement. Welcome, my dear!",
  "strong.dialogue.first.generic/4": "Ah, an unfamiliar face! How intriguing. Do tell, what brings you to our quaint village? We're all ears for your tales, stranger.",
  "strong.dialogue.first.generic/5": "Well, well, well! It seems we have a wanderer among us once again. Make yourself comfortable, for you'll surely be the talk of the town!",
  "strong.dialogue.first.generic/6": "Huzzah! We have a fresh soul in our midst! Welcome, welcome to our humble abode. We were in dire need of some new entertainment.",

  "strong.dialogue.first.question/1": "Well, well, well! Look who decided to grace us with their presence. What mischief brings you to this humble village?",
  "strong.dialogue.first.question/2": "Ah, a fresh soul! What thrilling escapades led you to our little corner of the world?",
  "strong.dialogue.first.question/3": "Oh my, oh my! Could it be? A mighty adventurer in our midst! Pray tell, how did you stumble upon our little haven?",
  "strong.dialogue.first.exploring/1": "Ahoy, adventurer! You're welcome to stay, but don't even dream of disregarding our rules, or you'll be escorted out faster than you can say \"enderman\".",
  "strong.dialogue.first.exploring/2": "Well, well, well! Look who decided to visit. Just remember, we've got a set of guidelines, and if you don't follow 'em, you're outta here, pal.",
  "strong.dialogue.first.exploring/3": "Howdy, stranger! But let's make one thing clear - this place runs on rules. So, keep 'em in mind or prepare to face the villagers' wrath.",
  "strong.dialogue.first.settling/1": "Ah, fresh blood! It's about time someone interesting showed up in this dull village!",
  "strong.dialogue.first.settling/2": "Well, well, well, look who's decided to grace us with their presence. Don't worry, I won't hold it against you for choosing to settle here.",
  "strong.dialogue.first.settling/3": "Oh joy, another lost soul has found their way to this forsaken place. Just what we needed, more mediocrity.",
  "strong.dialogue.first.settling/4": "So you've chosen to stick around, huh? Might as well make the best of it, I suppose. Just don't expect any miracles.",
  "strong.dialogue.first.spent_night.success/1": "Ah, my dear traveler, I must insist that you experience the sheer magnificence of our inn! It is simply unparalleled in its ability to provide comfort and respite!",
  "strong.dialogue.first.spent_night.success/2": "By the stars, you simply cannot fathom the exquisite delight that awaits you at our inn! It is a haven of rejuvenation, where weariness is banished and energy is restored to its fullest!",
  "strong.dialogue.first.spent_night.success/3": "Oh, weary wanderer, fear not! Seek solace and sustenance at our inn, for it is a bastion of warmth and nourishment that will surely sate your cravings and lull you into blissful slumber!",
  "strong.dialogue.first.spent_night.failed/1": "An inn? Ha! You won't find such luxury in this wretched village. We're more skilled in squabbling over cobblestones than constructing decent lodgings.",
  "strong.dialogue.first.spent_night.failed/2": "Inn? Hah! Don't waste your time searching for one in this sorry excuse for a village. We're too busy stumbling over our own two feet to build anything worthwhile.",
  "strong.dialogue.first.spent_night.failed/3": "Looking for an inn, are you? Well, you won't find one here, my friend. This village is more adept at breeding chaos than providing comfortable accommodations. Perhaps you should try your luck elsewhere, if you've got any left.",

  "strong.dialogue.hug.success/1": "Well, well, well, look who finally decided to grace us with their presence after an eternity!",
  "strong.dialogue.hug.success/2": "Ah, about time someone showed me some appreciation! It's not like I needed that hug or anything.",
  "strong.dialogue.hug.success/3": "Just when I thought this day couldn't get any worse, you come along and actually manage to do something right. Bravo.",
  "strong.dialogue.hug.success/4": "Who would've thought you'd be as cuddly as a fluffy bunny? Color me surprised!",
  "strong.dialogue.hug.success/5": "Oh, well, aren't you just the generous one, returning the favor? How unexpected.",
  "strong.dialogue.hug.success/6": "Phew, well, just when I thought I couldn't get any hotter in this miserable place, you come along and prove me wrong. Congrats.",
  "strong.dialogue.hug.fail/1": "Ugh, look at you, all filthy and grimy!",
  "strong.dialogue.hug.fail/2": "I'd rather not, thanks a million.",
  "strong.dialogue.hug.fail/3": "Seriously? What's the catch?",
  "strong.dialogue.hug.fail/4": "You think I forgot about that time you insulted me? Nope.",
  "strong.dialogue.hug.fail/5": "Honestly, I wouldn't even consider giving you a hug after that.",
  "strong.dialogue.hug.fail/6": "Gross! Keep your germ-infested self away from me!",
  "strong.dialogue.hug.fail/7": "Oh, um... well, I suppose I should reluctantly say... thanks?",

  "strong.dialogue.kiss.success/1": "This moment is pure bliss, I never want it to end!",
  "strong.dialogue.kiss.success/2": "My heart is bursting with affection for you, it's overwhelming!",
  "strong.dialogue.kiss.success/3": "This kiss is as delightful as a freshly baked pumpkin pie, simply scrumptious!",
  "strong.dialogue.kiss.success/4": "Mmm! Your lips are as sweet and enticing as honey, I can't resist!",
  "strong.dialogue.kiss.success/5": "Oh my, you have quite the talent for kissing, %1$s! You've left me breathless!",
  "strong.dialogue.kiss.success/6": "Oh %1$s, your kissing skills surpass even Ash's! I can't help but giggle in delight!",
  "strong.dialogue.kiss.fail/1": "As if I'd ever let anyone see me kiss.",
  "strong.dialogue.kiss.fail/2": "Is that the best you can do? Pathetic.",
  "strong.dialogue.kiss.fail/3": "Ash's kisses are like fireworks compared to your feeble attempt.",
  "strong.dialogue.kiss.fail/4": "Do us all a favor and invest in some breath mints. Desperately needed.",
  "strong.dialogue.kiss.fail/5": "Oh, well, thank you... I guess?",
  "strong.dialogue.kiss.fail/6": "Get off me, you clueless fool! You're invading my personal space.",

  "strong.dialogue.chat.success/1": "Ugh, cookies and milk. Can't resist the temptation, can you?",
  "strong.dialogue.chat.success/2": "Yeah, the weather is nice... I guess. Not that it really matters to me.",
  "strong.dialogue.chat.success/3": "Oh, great. Just great. I woke up and immediately stubbed my toe. Perfect start to the day.",
  "strong.dialogue.chat.success/4": "Forget apples, I prefer using a sword to keep those zombies away!",
  "strong.dialogue.chat.success/5": "Building my own village? Eh, sounds like too much work. I'd rather just laze around.",
  "strong.dialogue.chat.success/6": "Guess who I spotted the other day? %Supporter% strutting around in their fancy Diamond armor.",
  "strong.dialogue.chat.success/7": "Oh, look who thinks they're so special! %Supporter% bragging about finding a chest full of diamonds like it's the greatest achievement ever.",
  "strong.dialogue.chat.success/8": "Remarkable weather? Meh. I've enjoyed better. Give me a thunderstorm any day.",
  "strong.dialogue.chat.success/9": "Spiders and goblins? Pfft, they're nothing. I've dealt with worse things in my sleep.",
  "strong.dialogue.chat.success/10": "Wondering about %Supporter%, huh? They left ages ago and I couldn't care less.",
  "strong.dialogue.chat.success/12": "You won't believe what %Supporter% did recently. Let's just say it's not worth talking about.",
  "strong.dialogue.chat.success/13": "Stray cats? Yeah, they're cute and all, but who has time to take care of them? Not me.",
  "strong.dialogue.chat.success/14": "Redecorate my house? Ha! That would require actually getting off my lazy behind.",
  "strong.dialogue.chat.success/15": "Kids? Maybe someday, but finding the right partner is such a hassle. I've got other things to worry about.",
  "strong.dialogue.chat.success/16": "Imagine living in the other village. Trust me, you'd want to come running back here within a day.",
  "strong.dialogue.chat.success/17": "Childhood memories? Yeah, they were fine, I guess. Nothing extraordinary though.",
  "strong.dialogue.chat.success/18": "Haven't talked to my parents in a while. Honestly, I don't really feel the need to visit them.",
  "strong.dialogue.chat.success/19": "Traveling to the other village? Ugh, why bother? I've got enough friends right here.",
  "strong.dialogue.chat.success/20": "Cheese? Seriously? I dream about something more exciting, like conquering the Nether.",
  "strong.dialogue.chat.fail/1": "Seriously? Did that just come out of your mouth?",
  "strong.dialogue.chat.fail/2": "It's hard to believe that something could explode on its own. You must have some wild imagination.",
  "strong.dialogue.chat.fail/3": "You know, you may think you're cool, but you're really not.",
  "strong.dialogue.chat.fail/4": "Look at you, being a show-off and everything.",
  "strong.dialogue.chat.fail/5": "Oh, please! You should be locked up in a dungeon for saying something like that!",
  "strong.dialogue.chat.fail/6": "Ugh, go away! Your fashion sense is so outdated, it's cringeworthy.",
  "strong.dialogue.chat.fail/7": "Talking about that is just plain dumb, don't you think?",
  "strong.dialogue.chat.fail/8": "Why are you bothering me again? Can't you take a hint?",
  "strong.dialogue.chat.fail/9": "Huh? Did you say something? Sorry, I was too busy not caring about what you have to say.",
  "strong.dialogue.chat.fail/10": "Excuse me, but I don't have time for your nonsense.",
  "strong.dialogue.chat.fail/11": "What's wrong with you? Why are you wasting your breath on such a pointless topic?",
  "strong.dialogue.chat.fail/12": "I've heard some not-so-nice things about you, and now I can see why people think that way.",
  "strong.dialogue.chat.fail/13": "Even zombies would rather avoid talking to you. That's saying something.",
  "strong.dialogue.chat.fail/14": "You're about as likable as a witch, and that's saying a lot.",
  "strong.dialogue.chat.fail/15": "Do me a favor and stop talking to me before I call the guards to remove you from my presence.",
  "strong.dialogue.chat.fail/16": "Huh? Oh, sorry, your conversation was so dull, it put me to sleep.",
  "strong.dialogue.chat.fail/17": "Are you ever going to finish talking? Because I have more important things to do.",
  "strong.dialogue.chat.fail/18": "I wonder if anyone would even notice if you suddenly stopped talking forever. Doubt it.",
  "strong.dialogue.chat.fail/19": "I'd rather stare at a pig's rear end than engage in a conversation with you.",
  "strong.dialogue.chat.fail/20": "Are you finally done talking to me? Because I can't handle any more of your nonsense.",
  "strong.dialogue.chat.fail/21": "Wait, you actually believe the Earth is round? No corners? Wow, you seriously bought into that?",

  "strong.dialogue.story.success/1": "Holy cow! Are you serious? That's insane!",
  "strong.dialogue.story.success/2": "Man, I wish I had the guts to go toe-to-toe with a creeper.",
  "strong.dialogue.story.success/3": "Damn, that story was off the charts! Did you come up with it yourself?",
  "strong.dialogue.story.success/4": "No freaking way! All of that actually went down yesterday? Mind blown!",
  "strong.dialogue.story.success/5": "Are you kidding me? I was right in that area yesterday, and yet I haven't heard a peep about it.",
  "strong.dialogue.story.success/6": "Haha! Classic %Supporter%! Always pulling off amazing feats like that.",
  "strong.dialogue.story.success/7": "Oh my blocky goodness! I've lost count of how many times I've heard the legendary tales of %Supporter%. Spin it again, my friend!",
  "strong.dialogue.story.success/8": "Woah! So that's the secret to scoring your first diamond, huh? Impressive.",
  "strong.dialogue.story.success/9": "Hey, swing by later, will ya? I'm dying to hear more of your epic adventures.",
  "strong.dialogue.story.fail/1": "Excuse me, but did I just hear you disrespect my beloved mother? Prepare yourself for a verbal thrashing!",
  "strong.dialogue.story.fail/2": "Your scandalous behavior is the hottest gossip in the entire village. Congratulations on becoming the talk of the town!",
  "strong.dialogue.story.fail/3": "I must admit, I'm utterly bewildered by your incomprehensible words. It's like listening to a villager speaking in ancient hieroglyphics!",
  "strong.dialogue.story.fail/4": "You, my dear friend, are an abomination! Have you no heart? Even creepers deserve love and affection, just like everyone else!",
  "strong.dialogue.story.fail/5": "I weep for the tragic fate of that poor, innocent sheep you mercilessly ended. It's a crime against cuteness!",
  "strong.dialogue.story.fail/6": "*snoring loudly* Huh? Oh, I apologize for my brief snooze. Your story was so unbearably dull, it sent me into a deep slumber!",
  "strong.dialogue.story.fail/7": "Pray tell, what was the purpose of subjecting me to that mind-numbing tale? I demand compensation for the precious minutes of my life that I'll never get back!",
  "strong.dialogue.story.fail/8": "Yawn! Excuse my blatant lack of enthusiasm, but your narrative skills are as riveting as watching paint dry on a rainy day.",
  "strong.dialogue.story.fail/9": "My dear interlocutor, I must assert that your sanity levels are plummeting faster than an anvil dropped from the heavens. And I must say, it's not the good kind of crazy.",
  "strong.dialogue.story.fail/10": "Allow me to enlighten you, my dear acquaintance. Your so-called achievement left me questioning the very essence of goodness and accomplishment. It was a feeble attempt at greatness, at best.",

  "strong.dialogue.flirt.success/1": "You're ridiculously courageous!",
  "strong.dialogue.flirt.success/2": "Oh, you! Quit being so irresistibly charming!",
  "strong.dialogue.flirt.success/3": "*Giggles* Are you serious right now?",
  "strong.dialogue.flirt.success/4": "Oh, my goodness...",
  "strong.dialogue.flirt.success/5": "That was beyond adorable! You had me hooked from the moment we met!",
  "strong.dialogue.flirt.success/6": "How on earth do you maintain such an awe-inspiring appearance day after day? Whenever I gaze upon you, I'm rendered speechless.",
  "strong.dialogue.flirt.success/7": "Oh, please cease! You're causing me to blush furiously.",
  "strong.dialogue.flirt.fail/1": "Oh, please, spare me your empty promises.",
  "strong.dialogue.flirt.fail/2": "Oh, how original! Did you rehearse that line with the blacksmith too?",
  "strong.dialogue.flirt.fail/3": "Haha, nice try, but I have standards, you know?",
  "strong.dialogue.flirt.fail/4": "Seriously? Is that the best you've got? Pitiful.",
  "strong.dialogue.flirt.fail/5": "Hilarious! I bet even a creeper has better odds with me than you do.",
  "strong.dialogue.flirt.fail/6": "Absolutely not. I wouldn't even consider it in my wildest dreams.",
  "strong.dialogue.flirt.fail/7": "Spare me the puppy-dog eyes and save your breath. That line won't work on me, ever.",

  "strong.dialogue.joke.creative.success/1": "*Guffaws* That's absolutely hysterical! I can't stop laughing!",
  "strong.dialogue.joke.creative.success/2": "Ha! That's good for a chuckle!",
  "strong.dialogue.joke.creative.success/3": "By the diamonds, that's the most side-splitting joke I've ever heard!",
  "strong.dialogue.joke.creative.success/4": "Haha! You've got more comedic talent than %Supporter% themselves!",
  "strong.dialogue.joke.creative.success/5": "Oh my blocks! You're an absolute riot! Have you ever considered a career in stand-up comedy?",
  "strong.dialogue.joke.creative.success/6": "ROFL! That joke was an absolute gem! It's been ages since I laughed that hard!",
  "strong.dialogue.joke.creative.success/7": "Heehee! Move over, Ash, there's a new comedian in town!",
  "strong.dialogue.joke.creative.success/8": "Hah! That's actually quite amusing! You've got a knack for humor, my friend!",
  "strong.dialogue.joke.creative.failed/1": "Are you seriously trying to make a joke? That's just sad.",
  "strong.dialogue.joke.creative.failed/2": "Wow, nice try. But you clearly missed the mark by a mile.",
  "strong.dialogue.joke.creative.failed/3": "Oh, bless your heart for attempting humor. Too bad it's utterly cringe-worthy.",
  "strong.dialogue.joke.creative.failed/4": "Did you honestly expect anyone to laugh at that feeble attempt at a joke?",
  "strong.dialogue.joke.creative.failed/5": "Well, I suppose I could force a chuckle just to spare your feelings. But don't expect much.",
  "strong.dialogue.joke.creative.failed/6": "*sarcastically* Oh, please, regale us with your comedic genius. I can hardly contain my excitement.",
  "strong.dialogue.joke.creative.failed/7": "Hilarious. Not. Stick to your day job, or whatever you call that tragic attempt at humor.",
  "strong.dialogue.joke.creative.failed/8": "Ash's jokes are like a masterclass in comedy compared to your pathetic attempts. Better luck next time, pal.",

  "strong.dialogue.procreate_engaged/1": "Listen, sweetheart, I can't help but get a little jittery until we're officially husband and wife. Marriage just brings a certain level of security, you know?",
  "strong.dialogue.procreate_engaged/2": "Look, darling, I'm not one to bring a fresh soul into this realm if we haven't sealed the deal. I mean, where's the commitment, right? We gotta be all in before we start populating the world.",

  "strong.dialogue.shake_hand.success/1": "Your grip is like a vice! I can feel the strength radiating from you!",
  "strong.dialogue.shake_hand.success/2": "The power in your handshake is awe-inspiring! It's as if you could crush boulders with ease!",
  "strong.dialogue.shake_hand.success/3": "Well, aren't you quite the refined individual! Your politeness is truly remarkable!",
  "strong.dialogue.shake_hand.success/4": "Greetings and salutations, fine sir/madam! May this day be filled with utmost goodness for you!",
  "strong.dialogue.shake_hand.success/5": "Ah, behold! A magnificent human has graced us with their presence! Salutations, esteemed one!",
  "strong.dialogue.shake_hand.fail/1": "Are you kidding me? You had the audacity to slaughter that innocent cow and now you expect me to shake your hand?",
  "strong.dialogue.shake_hand.fail/2": "No thanks, I'd rather not touch the hand that's stained with the blood of a helpless creature.",
  "strong.dialogue.shake_hand.fail/3": "Don't even bother trying to be polite, I see right through your facade.",
  "strong.dialogue.shake_hand.fail/4": "Ha! You must be joking. I never thought I'd see the day when you stooped so low.",
  "strong.dialogue.shake_hand.fail/5": "Get lost, you heartless monster. I want nothing to do with you.",

  "strong.dialogue.main.morning/1": "G'mornin' sunshine!",
  "strong.dialogue.main.morning/2": "Time to roll up those sleeves and get to work, my friend!",
  "strong.dialogue.main.morning/3": "Ugh, still feelin' like I just pulled an all-nighter. You too?",
  "strong.dialogue.main.morning/5": "Woah, rough night, huh? You look like a zombie!",
  "strong.dialogue.main.morning/6": "Wake up and smell the roses, pal! We've got a marathon of a day ahead.",
  "strong.dialogue.main.morning/7": "Snooze well, did ya? You've got that spark in your eye.",
  "strong.dialogue.main.morning/8": "Rise and shine, sleepyhead! The world is waiting for you.",
  "strong.dialogue.main.morning/9": "Ah, what a glorious mornin'! I can already taste the success in the air.",
  "strong.dialogue.main.morning/10": "I'm takin' it easy today, feeling a bit under the weather. Don't wanna push it.",
  "strong.dialogue.main.morning/11": "My schedule's jam-packed today, I'm already exhausted just thinkin' 'bout it.",
  "strong.dialogue.main.morning/12": "You know what? I actually slept like a log last night, energized and ready to conquer the world!",
  "strong.dialogue.main.evening/1": "Good evening! How delightful to see you at this hour!",
  "strong.dialogue.main.evening/2": "Would you believe how swiftly the day has vanished? Pray, enlighten me on your endeavors.",
  "strong.dialogue.main.evening/3": "Ah, another laborious day to add to our repertoire, don't you think?",
  "strong.dialogue.main.evening/4": "The day has truly flown by, my dear friend. An abundance of tasks, scarce moments to spare.",
  "strong.dialogue.main.evening/5": "Alas, the time has come for me to take my leave and commence the arduous task of preparing dinner.",
  "strong.dialogue.main.evening/6": "Regrettably, I have squandered an exorbitant amount of time today, accomplishing naught of significance.",
  "strong.dialogue.main.evening/7": "I shall retire for a brief respite, for the morning hath bestowed upon me a plethora of woes.",
  "strong.dialogue.main.evening/8": "The thought of venturing into the darkened abyss is quite unnerving, for a malevolent creeper once crossed my path. I dare not tread the night's path anymore.",
  "strong.dialogue.main.evening/9": "Ahoy! Whilst procuring provisions from the esteemed butcher for tonight's feast, I shall rendezvous with you at a later juncture!",
  "strong.dialogue.main.night/1": "Hmph, burning the midnight oil, are we?",
  "strong.dialogue.main.night/2": "Oh, a true night aficionado, I see.",
  "strong.dialogue.main.night/3": "Ah, a fellow nocturnal creature. How rare.",
  "strong.dialogue.main.night/4": "Listen, if you wander too far from the village, those ghastly monsters might gobble you up. Just saying.",
  "strong.dialogue.main.night/5": "The guards may act all tough, but let's be honest, the night still sends shivers down your spine, doesn't it?",
  "strong.dialogue.main.night/6": "The darkness, my dear friend, brings a sense of tranquility to my weary soul. It's the perfect time to unwind when the world goes silent.",
  "strong.dialogue.main.night/7": "Daytime is for bustling about, but the night, ah, that's when I take leisurely strolls under the twinkling stars.",
  "strong.dialogue.main.night/8": "I'm utterly drained. Today has been an eternal rollercoaster, and I might just need to pamper myself tomorrow.",
  "strong.dialogue.main.night/9": "My excitement to sink into a cozy cocoon of blankets is beyond words.",
  "strong.dialogue.main.night/10": "Do yourself a favor, my friend, and surrender to the sweet embrace of sleep. Tomorrow awaits with its demanding chores.",

  "strong.dialogue.greet.mayor/1": "Greetings, esteemed Mayor!",
  "strong.dialogue.greet.mayor/2": "Wishing you a splendid day, Mayor!",
  "strong.dialogue.greet.monarch/1": "Hail to the almighty ruler, glorious and exalted!",
  "strong.dialogue.greet.monarch/2": "Oh gracious and magnificent leader, I am but a humble servant in your presence!",

  "strong.dialogue.busy/1": "Look, pal, we've been chit-chatting all day long, and as much as I enjoy our little talks, duty calls. I've got a ton of stuff to do, so I better get back to it pronto!",
  "strong.dialogue.busy/2": "Hey, listen, I appreciate your company, but this workload of mine is as heavy as an anvil. I can't let it crush me, so I better focus and get this done before sunset.",
  "strong.dialogue.busy/3": "Sorry, friend, but my plate is overflowin' with tasks right now. How about we catch up later when I'm not buried neck-deep in work?",
  "strong.dialogue.busy/4": "My apologies, but the grindstone is calling my name, and I can't ignore it any longer. I'll catch you on the flip side once this work is done and dusted.",
  "strong.dialogue.busy/5": "Hold on a sec, I just realized I left my furnace blazin' hot, and we both know that's a recipe for disaster. I'll be back in a jiffy once I've saved my precious abode from going up in flames! We can continue our conversation then, deal?",
  "strong.dialogue.goaway/1": "Ugh, not interested. Scram!",
  "strong.dialogue.goaway/2": "Seriously, find a hobby or something. I have no time for you.",
  "strong.dialogue.goaway/3": "Apologies, %1$s, but I'm swamped. Not in the mood for chit-chat.",
  "strong.dialogue.goaway/4": "Do me a favor and pester someone else, will you?",
  "strong.dialogue.goaway/5": "Begone, you uncultured swine! Leave me be!",

  "strong.dialogue.greet": "Yo! How's life treating you today?",
  "strong.dialogue.greet/1": "Hey there! How's your day shaping up?",
  "strong.dialogue.greet/2": "Well, well, well, if it isn't %1$s! How's the world treating you?",
  "strong.dialogue.greet/3": "Well, hello there! What brings you to my neck of the woods?",
  "strong.dialogue.greet/4": "Look at you, all charged up and raring to go! How's the adventure treating you?",
  "strong.dialogue.greet/5": "Greetings, %1$s! It's always a pleasure to lay eyes on you!",
  "strong.dialogue.greet/6": "'Sup!",
  "strong.dialogue.greet/7": "Ah, it's a delight to cross paths with you!",
  "strong.dialogue.greet/8": "Hello, hello! It's an absolute joy to encounter you. How's life treating you today?",
  "strong.dialogue.greet/9": "Hey, hey! Ecstatic to have you in my presence!",

  "strong.dialogue.greet.negative/1": "Ugh, seriously? Why are you here? Can't you take a hint and leave already?",
  "strong.dialogue.greet.negative/2": "Oh joy, it's you. My day just got even worse.",
  "strong.dialogue.greet.negative/3": "Hmph.",
  "strong.dialogue.greet.negative/4": "Oh, it's you. How utterly disappointing.",
  "strong.dialogue.greet.negative/5": "Back to torment me, are you? Just what I needed.",

  "strong.dialogue.greet.success/1": "Well, that's just splendid! Delighted to hear it!",
  "strong.dialogue.greet.success/2": "Ah, fantastic news! You must be positively thriving!",
  "strong.dialogue.greet.success/3": "Well, isn't that a ray of sunshine! Absolutely thrilled to hear it!",
  "strong.dialogue.greet.success/4": "Oh, how delightful! That warms the cockles of my heart!",
  "strong.dialogue.greet.success/5": "Well, tickle me pink! That's positively marvelous to know!",
  "strong.dialogue.greet.fail/1": "Meh.",
  "strong.dialogue.greet.fail/2": "Delighted, I suppose...",
  "strong.dialogue.greet.fail/3": "Well, that's underwhelming.",
  "strong.dialogue.greet.fail/4": "Seriously? Well, I'll be darned...",
  "strong.dialogue.greet.fail/5": "Oh, splendid. Just what I needed...",

  "strong.dialogue.apologize.success/1": "Don't sweat it, buddy. Mistakes are just part of life.",
  "strong.dialogue.apologize.success/2": "Alright, alright, I'll let it slide this time. But one more slip-up and you'll hear from me.",
  "strong.dialogue.apologize.success/3": "Well, lucky for you, I'm feeling generous today. But don't think you can get away with anything.",
  "strong.dialogue.apologize.success/4": "Oh, don't even worry about it, my friend. We all mess up sometimes.",
  "strong.dialogue.apologize.success/5": "Sure, I'll give you a pass this time. But don't make it a habit, you hear?",
  "strong.dialogue.apologize.fail/1": "Get lost, you imbecile!",
  "strong.dialogue.apologize.fail/2": "You deliberately assaulted me!",
  "strong.dialogue.apologize.fail/3": "Hah! Nice try, but I'm not naive enough to buy into your feeble excuses!",
  "strong.dialogue.apologize.fail/4": "Your reckless actions caused me immense pain, so save your apologies for someone who cares!",
  "strong.dialogue.apologize.fail/5": "Oh, absolutely not! I wouldn't even consider accepting your apology in a million years!",

  "strong.dialogue.location.failed/1": "Nope, not a peep. My ears are practically allergic to interesting news, I swear.",
  "strong.dialogue.location.failed/2": "Negative ghost rider, there's not a single captivating spot that has made its way into my brain.",
  "strong.dialogue.location.failed/3": "Absolutely not, my friend. We villagers don't have time to gallivant around haunted ruins like you adventurous types. We're too busy with far more important matters, you know?",
  "strong.dialogue.location.forgot/1": "Ah, blast it! I stumbled upon this mind-blowing spot, but my memory decided to play tricks on me! No map, no mark. My apologies, friend.",
  "strong.dialogue.location.forgot/2": "You won't believe what I stumbled upon! It was extraordinary, utterly breathtaking...and yet, I cannot recall a single detail. Curse my fleeting memory! My sincerest apologies for not documenting it.",
  "strong.dialogue.location.forgot/3": "Oh, the frustration! There was this captivating location that had me spellbound...and now it's slipped through the cracks of my mind. How vexing! I deeply regret not being able to share the details.",
  "strong.dialogue.location.igloo/1": "Hey, guess what? I stumbled upon this freezing cold igloo at %2$s. Can you believe people actually live in a house made entirely of snow? Madness, I tell ya! Gives me the chills just thinking about it!",
  "strong.dialogue.location.igloo/2": "You won't believe what I found at %2$s. There's this old, deserted igloo just sitting there. And let me tell you, it's not for the faint-hearted! Rumor has it, that place is haunted. I mean, I've never seen a ghost myself, but strange noises follow me every time I pass by. Gives me goosebumps, I swear!",
  "strong.dialogue.location.igloo/3": "Listen to this, mate! At %2$s, there's this abandoned ice masterpiece called an igloo. Yeah, you heard me right, an igloo! It's been deserted for ages, if you ask me. I mean, who in their right mind would live in a block of ice, am I right? It's like living in the freezer section of a supermarket! Brrr!",
  "strong.dialogue.location.pyramid/1": "Oh, hey there! You won't believe what I discovered! There's this mind-blowing pyramid over at %2$s. I mean, seriously, it's like something out of a legend!",
  "strong.dialogue.location.pyramid/2": "Psst! Listen up, my friend. I've got some top-secret information for you. There's a jaw-dropping pyramid at %2$s. I heard rumors that it's filled to the brim with ancient treasures. You better get there before anyone else snatches them up!",
  "strong.dialogue.location.pyramid/3": "Ah, %2$s, the land of mystery and adventure. You know, I've heard whispers of a magnificent pyramid hidden in those sands. But let me warn you, brave soul. Only the strongest and smartest have returned from that treacherous place. Are you up for the challenge?",
  "strong.dialogue.location.ruined_portal_desert/1": "Hold onto your socks, because at %2$s, you won't believe your eyes! A decimated portal lies there, abandoned and forgotten, just like my dreams.",
  "strong.dialogue.location.ruined_portal_swamp/1": "Guess what? There's this totally wrecked portal over there at %2$s, smack in the middle of the swamp! Can you believe it? Those Nether invaders must've been so shocked to end up in this miserable dump!",
  "strong.dialogue.location.ruined_portal/1": "Whoa, hold up! You won't believe what I saw at %2$s - a total disaster of a portal! It's like the Nether decided to throw one heck of a party and left this place in ruins. So much for a fancy gateway.",
  "strong.dialogue.location.ruined_portal/2": "Listen up, folks! %2$s is where you'll stumble upon a sorry excuse for a nether portal. I mean, seriously, it's so messed up that it gives me the shivers. But hey, if you dare to check it out, just watch your step, or you might end up dancing on molten lava. Yikes!",
  "strong.dialogue.location.ruined_portal/3": "Gather 'round, everyone! I've got some juicy gossip about %2$s. Apparently, there used to be a glorious nether portal there, but now it's nothing but ancient crumbled ruins. The local cleric claims it's cursed, but you know what they say - where there's curse, there might be treasure. Of course, no one's brave enough to venture near that creepy place. Can you blame them?",
  "strong.dialogue.location.ruined_portal_mountain/1": "Oh, you won't believe the disaster up ahead! There's this utterly decimated portal sitting right at %2$s, nestled away in the treacherous mountains. It's an absolute travesty, my dear friend. Truly heartbreaking.",
  "strong.dialogue.location.mansion/1": "You know what's waiting for you at %2$s? Only an accursed mansion owned by those wretched illagers. I wouldn't step foot near that place if I were you, unless you're eager for a taste of danger.",
  "strong.dialogue.location.mansion/2": "Have you seen that monstrous mansion at %2$s? Belongs to those vile illagers. If you ask me, the village should pack up and leave this cursed place immediately. I mean, who knows what kind of trouble awaits us here?",
  "strong.dialogue.location.monument/1": "Listen up, mate! I've got some important news for ya. There's a bloomin' sunken castle over yonder at %2$s, but let me tell ya, it's infested with those pesky sea monsters. If I were you, I'd stay far, far away from it. Trust me, you don't wanna mess with those slimy creatures.",
  "strong.dialogue.location.monument/2": "Ahoy there, adventurer! I've got a whopper of a story for ya. Deep in the vast ocean at %2$s, tales have been spun about ancient ruins that'll make your jaw drop. Now, if you're seekin' treasure, you might find a few shiny trinkets in there, but let me warn ya, it's gonna be a wild ride! Those ruins are as dangerous as they come. You better be prepared for the adventure of a lifetime, matey!",
  "strong.dialogue.location.shipwreck/1": "Ahoy there, matey! I've stumbled upon a grand shipwreck at %2$s. This be no ordinary wreckage, mind ye. 'Twas the mighty vessel of the legendary Eastern Alliance Company, lost to the depths of the ocean!",
  "strong.dialogue.location.shipwreck/2": "Avast, me hearties! Word's spread 'bout a shipwreck found at %2$s by them fisherfolk. Arr, me curiosity be piqued! I wonder if there be hidden riches awaitin' to be plundered...",
  "strong.dialogue.location.shipwreck_beached/1": "Hey, guess what? There's this totally wrecked ship just chilling at %2$s beach. Seriously, you won't be able to miss it, it's such a sight!",
  "strong.dialogue.location.shipwreck_beached/2": "Head over to %2$s, my friend. There's this ship that got totally wrecked and ended up stranded on the shore. Can you believe it? I'm dying to know the whole story behind it!",
  "strong.dialogue.location.village_desert/1": "Oh, you won't believe your eyes! Right over yonder lies a magnificent village, nestled right in the heart of this scorching desert!",
  "strong.dialogue.location.village_taiga/1": "Ah, you won't believe your eyes! Just head over to %2$s, darling. There's another charming village nestled right in the heart of the breathtaking taiga biome.",
  "strong.dialogue.location.village_taiga/2": "Oh, don't you dare miss out on this, my dear! Make your way to %2$s and prepare to be astounded. Deep within the mystical taiga biome lies a hidden gem of a village, just waiting to be discovered by an adventurous soul like yourself.",
  "strong.dialogue.location.village_snowy/1": "Yo, over yonder lies another village. Brace yourself, it's a frigid wasteland over there.",
  "strong.dialogue.location.village_snowy/2": "Listen up! There's a village tucked away at %2$s in the icy tundra. The folks there might be polite, but good luck surviving the bone-chilling cold!",
  "strong.dialogue.location.village_plains/1": "Ah, you won't believe your eyes when you stumble upon %2$s! It's an enchanting little village, tucked away in the heart of these plains.",
  "strong.dialogue.location.village_plains/2": "Venture forth, my friend, into the vast expanse of the plains and prepare to be amazed by %2$s. Nestled in its midst is a village so delightful, it'll make your heart skip a beat.",
  "strong.dialogue.location.village_savanna/1": "Whoa, hold on to your hat! Over yonder, you'll stumble upon another village, scorching like the fiery depths of the sun. It's hotter than a dragon's breath, I tell ya!",
  "strong.dialogue.location.village_savanna/2": "Ah, the glorious savanna at %2$s! Venture forth and you shall discover yet another village, teeming with the most delightful souls. They're as warm-hearted as the golden rays that blanket this extraordinary land!",
  "strong.dialogue.location.swamp_hut/1": "You won't catch me dead near that cursed swamp at %2$s! That wicked witch has set up shop there, and I'd sooner take my chances with a herd of zombies!",
  "strong.dialogue.location.swamp_hut/2": "Listen up, mate. %2$s is a place you want to stay far away from. That swamp hut? It's the domain of that wicked witch, and she'll turn you into a toad before you can say \"Ender Dragon\"!",
  "strong.dialogue.location.mineshaft/1": "This place used to be a proper mine, you know. Unfortunately, it got shut down after a massive disaster. Should be somewhere nearby, if you're curious.",
  "strong.dialogue.location.mineshaft/2": "Ah, yes! We had ourselves a fancy mine once, just over yonder at %2$s. But let me tell you, it's become a cursed pit of darkness, swarming with all sorts of vile creatures. Tread cautiously if you dare to venture down there.",
  "strong.dialogue.location.jungle_pyramid/1": "Watch your step, mate! Over yonder in %2$s lies an age-old temple. But let me warn ya, it's a deathtrap waiting to happen. If you're feeling a bit daring, go ahead and test your luck, but don't say I didn't warn ya!",
  "strong.dialogue.location.jungle_pyramid/2": "Ah, %2$s! The infamous jungle ruins. Legends say there are deadly traps lurking inside, just waiting for their next unsuspecting victim. Tread lightly, my friend, unless you fancy a thrilling game of dodge-the-arrows. Trust me, our ancestors would have cleared the place out if it weren't for those treacherous contraptions.",
  "strong.dialogue.location.pillager_outpost/1": "Oh, you won't believe what I just saw! There's a gang of those pesky Pillagers loitering around %2$s. They've actually had the audacity to set up their grimy outpost right next to us. And let me tell you, we can't handle another one of their vile attacks. It's a nightmare, I tell you!",
  "strong.dialogue.location.pillager_outpost/2": "Brace yourself for this shocking news! Those wretched Pillagers have claimed %2$s as their own personal playground. It's an outpost of doom, I tell ya! If you dare venture near that cursed place, watch your back. Those heartless Pillagers have no mercy. They'll shoot you down without a second thought.",
  "strong.dialogue.location.pillager_outpost/3": "Listen up, brave soul! If you're feeling adventurous, head on over to %2$s, where those loathsome Pillagers have invaded. But let me warn you, it won't be a walk in the park. If you can defeat those scoundrels, maybe, just maybe, you'll uncover some precious loot. The entire village would owe you eternal gratitude if you rid us of those vile creatures.",
  "strong.dialogue.location.ancient_city/0": "Ah, my ears caught some eerie sounds coming from %2$s, buried in the depths!",
  "strong.dialogue.location.ancient_city/1": "I swear, there's something mysteriously concealed beneath the ground at %2$s!",
  "strong.dialogue.location.ancient_city/3": "Rumors have it, mate, that an ancient city lies at %2$s. Can't say I stumbled upon it myself, but perhaps it's lurking underground?",

  "strong.dialogue.joke.monster.success/1": "Bahaha! That Skelly got what it deserved!",
  "strong.dialogue.joke.monster.success/2": "Can you believe it? That brainless zombie actually thought a shovel could take you down! Hahaha, what a joke!",
  "strong.dialogue.joke.monster.success/3": "Look at you, asserting dominance over that puny spider! Haha, who's the boss now?",
  "strong.dialogue.joke.monster.success/4": "Oh my blocks, you actually managed to manipulate a skeleton into taking out a creeper? That's mind-blowing, haha, you're on another level!",
  "strong.dialogue.joke.monster.success/5": "Hahah! Can you believe those dimwitted cave spiders fell for your trap? They're practically begging to be laughed at!",
  "strong.dialogue.joke.monster.failed/1": "Ha! You think skeletons are nothing more than mere bones and arrows? Think again, fool! We're sentient beings with thoughts and emotions, just like you! Show some respect!",
  "strong.dialogue.joke.monster.failed/2": "Oh, how original! Another hilarious joke about creepers blowing up! I haven't heard that one a million times before. Please, entertain me with your comedic genius!",
  "strong.dialogue.joke.monster.failed/3": "Did you forget that zombies and skeletons were once human? We were just like you, until fate dealt us a different hand. So, spare me your ignorance and show some empathy!",
  "strong.dialogue.joke.monster.failed/4": "Oh, look, an enderman clumsily fell into water. How utterly groundbreaking! Can you sense my excitement? No? That's because it's about as exciting as watching paint dry. Try harder next time.",
  "strong.dialogue.joke.monster.failed/5": "Ah, the classic silverfish on the toilet joke. How utterly original! If I had a nickel for every time I heard that, I'd have... oh wait, I actually have heard it just twice. Congratulations on your lack of creativity!",

  "strong.dialogue.joke.animal.success/1": "Hahaha! Poor little sheep, it must be feeling pretty chilly without its cozy coat. But hey, at least it's a sheep with a new haircut! Classic comedy, my friend.",
  "strong.dialogue.joke.animal.success/2": "And guess what happened next? The big bad wolf didn't want to eat the sheep anymore, but instead, started writing love poems and serenading it under the moonlight! Talk about a twist in the tale! An unexpected romance, I tell you.",
  "strong.dialogue.joke.animal.success/3": "Oh my goodness! You won't believe what those mischievous chickens are up to now. They've started moonlighting as comedians! They've got their own stand-up routines, cracking jokes and getting the whole barnyard rolling with laughter. Who knew chickens were such natural-born entertainers?",
  "strong.dialogue.joke.animal.success/4": "That is just absolutely ridiculous! I can't help but burst into laughter at the sheer absurdity of chickens having such comedic talents. It's like they've gone to clown school or something. Hilariously silly, my friend. Hilariously silly.",
  "strong.dialogue.joke.animal.success/5": "Ah, the wonders of cow magic! You see, my friend, cows not only provide us with delicious milk, but they also possess the incredible ability to produce milk endlessly. It's like they have their own personal milk fountain that never runs dry! It's a bovine miracle, I say. A moo-velous triumph of nature!",
  "strong.dialogue.joke.animal.failed/1": "Oh, come on now! Making jokes about that is just plain tasteless.",
  "strong.dialogue.joke.animal.failed/2": "I cannot believe you find amusement in the misfortune of innocent animals like that sheep. Lacking empathy, much?",
  "strong.dialogue.joke.animal.failed/3": "Listen here, buddy. My pig is off-limits for your insensitive remarks. Show some respect!",
  "strong.dialogue.joke.animal.failed/4": "Seriously? That kind of humor is beyond low. Get a grip, will you?",
  "strong.dialogue.joke.animal.failed/5": "How dare you mock the cow's majestic eyebrows like that! Have you no appreciation for bovine beauty? Unacceptable!",

  "strong.dialogue.flirt.slap/1": "Hey, watch where you're going, buddy!",
  "strong.dialogue.flirt.slap/2": "Seriously, did you learn how to flirt from a zombie pigman or something?!",
  "strong.dialogue.kiss.slap/1": "Who do you think you are, disrespecting me like that?!",
  "strong.dialogue.kiss.slap/2": "Take one more step, and I guarantee you'll remember this encounter for the rest of your miserable life!",

  "strong.dialogue.chat.plains/1": "What's there to like about the plains? It's just a boring, monotonous landscape. I'm dying to escape to somewhere more exciting.",
  "strong.dialogue.chat.plains/2": "Ugh, the plains. So mundane, so uneventful. I suppose some people find that comforting, but not me. I crave adventure and thrill!",
  "strong.dialogue.chat.plains/3": "Sure, the plains can be pretty at night, in a plain and unremarkable way. But honestly, I'd rather be surrounded by the vibrancy of a jungle biome or the grandeur of a mountain range.",
  "strong.dialogue.chat.plains/4": "Who has time to lay down and gaze at the sky? I've got things to do, places to be. The mere thought of wasting time like that makes me shudder.",
  "strong.dialogue.chat.plains/5": "Clean and fresh air? Meh, it's alright, I guess. But have you ever experienced the crispness of the snow in the ice spikes biome? Now that's refreshing!",
  "strong.dialogue.chat.plains/6": "Plain and simple? How utterly dull! Give me complexity and excitement any day. Life's too short to settle for plain and simple.",
  "strong.dialogue.chat.plains/7": "Ah, wild flowers. I used to pick them too, but not for some silly crush. No, I picked them to craft powerful potions and brew up mischief!",
  "strong.dialogue.chat.plains/8": "Sunrise in the plains? Meh, I've seen better. The fiery hues of a desert sunrise or the ethereal glow of a mushroom island sunrise are far more captivating, if you ask me.",
  "strong.dialogue.chat.savanna/1": "The savanna is scorching, but hey, at least we don't have to suffer through freezing winters like those wimps elsewhere.",
  "strong.dialogue.chat.savanna/2": "Ugh, those llamas are driving me insane, but I guess I can tolerate them in this otherwise tolerable place.",
  "strong.dialogue.chat.savanna/3": "You know what sets our savanna apart? The architecture, baby! It's one-of-a-kind and a major reason why I'm sticking around.",
  "strong.dialogue.chat.savanna/4": "Never underestimate the savanna biome, my friend. It may seem plain on the surface, but trust me, it's got more perks than you can imagine.",
  "strong.dialogue.chat.savanna/5": "We may not have rain pouring down on us like desert villages, but guess what? We've got rivers flowing through here! Beat that!",
  "strong.dialogue.chat.savanna/6": "The hills and terrains in this place will blow your mind! Seriously, it's like mother nature herself decided to put on a show just for us.",
  "strong.dialogue.chat.savanna/7": "You won't catch me complaining about the heat, not when we've got those acacia trees providing sweet, sweet shade. They're my lifesavers during workdays!",
  "strong.dialogue.chat.savanna/8": "Let me tell you a little secret about our savanna villages - we've got the best damn melons and pumpkins in the entire world. That's why other villages are always begging us for a trade!",
  "strong.dialogue.chat.taiga/1": "The woods, my friend, are a treasure trove of resources. They offer us not just building materials and firewood, but also an abundance of game to hunt. It's like nature's supermarket!",
  "strong.dialogue.chat.taiga/2": "Cold? Ha! That's just a feeble complaint from those who can't appreciate the rugged beauty of the taiga biome. We, my dear, have everything we could ever need right here. Wouldn't trade it for all the warmth in the world!",
  "strong.dialogue.chat.taiga/3": "Oh, darling, the taiga forests are simply marvelous! The way the sunlight peeks through the towering trees, the enchanting aroma of the pine needles, and oh, those delectable sweet berries! It's a feast for the senses.",
  "strong.dialogue.chat.taiga/4": "My heart flutters for the foxes in these majestic taiga forests. Such sly and cunning creatures. Sometimes, I can't resist spoiling them with juicy sweet berries. It's our little secret, darling.",
  "strong.dialogue.chat.taiga/5": "Ah, the wolves of the taiga. They're practically civilized, darling. With so much food to go around, they've learned to coexist with us. It's a harmonious dance of survival and mutual respect.",
  "strong.dialogue.chat.taiga/6": "Breathe it in, my love. The fresh, crisp air of the taiga is like a soothing balm for the soul. It invigorates, revitalizes, and transports you to a state of pure tranquility. Simply divine.",
  "strong.dialogue.chat.taiga/7": "Ah, the sweet berry bushes. They hold the most exquisite treasures, but beware, my dear. Their thorns can be quite wicked. Getting pricked by one is like a painful reminder that beauty often comes with a touch of danger.",
  "strong.dialogue.chat.taiga/8": "Rain, my darling, is nature's symphony in the taiga. It may be cold, but oh, the serenity it brings! The gentle rhythm of the droplets, the earthy scent that fills the air, it's a moment of pure bliss amidst the chilly embrace of the taiga.",
  "strong.dialogue.chat.snowy_plains/1": "This icy wasteland might chill your bones, but I thrive in the cold! Bring it on, winter!",
  "strong.dialogue.chat.snowy_plains/2": "Brrr! The frosty air might freeze your face off, but I've got the resilience of an arctic explorer!",
  "strong.dialogue.chat.snowy_plains/3": "Forget hibernation, I prefer to cozy up by the fire, wrapped in a bear-skin rug, sipping hot cocoa.",
  "strong.dialogue.chat.snowy_plains/4": "Ah, the snowflakes falling bring back memories of epic snowball battles with my crew. Good times, good times indeed!",
  "strong.dialogue.chat.snowy_plains/5": "Those pesky strays think they can harass us? Ha! I'll show them what a real village defender is made of!",
  "strong.dialogue.chat.snowy_plains/6": "Wolf trouble, huh? Don't worry, I've got my trusty slingshot and a bag of treats to keep those wild beasts at bay.",
  "strong.dialogue.chat.snowy_plains/7": "Iron golems might be tough, but I know all their weak spots! I've mastered the art of dodging their stony grips.",
  "strong.dialogue.chat.snowy_plains/8": "Ah, my childhood days... Pumpkins for pie and snow golems for companionship. Those were the days when magic was real!",
  "strong.dialogue.chat.desert/1": "Goodness gracious, it's scorching hot in this desert! Thankfully, we never have to deal with freezing winters.",
  "strong.dialogue.chat.desert/2": "The desert, my friend, is an eternal inferno.",
  "strong.dialogue.chat.desert/3": "Brace yourself, for the blistering heat of the desert ensures that I am perpetually tanned or sunburned.",
  "strong.dialogue.chat.desert/4": "Ah, the beauty of the desert nights! The temperature drops, and the stars grace us with their majestic presence.",
  "strong.dialogue.chat.desert/5": "By the blazing sun! Today's heat is simply unbearable.",
  "strong.dialogue.chat.desert/6": "By the fiery depths of the sun! Today's heat is insufferable!",
  "strong.dialogue.chat.desert/7": "Have you stumbled upon any rabbits in this wasteland? They are as elusive as a mirage!",
  "strong.dialogue.chat.desert/8": "The bane of our existence in this desert are those ghastly husks. They drain us of our energy and leave us famished! Outrageous, I say!",
  "strong.dialogue.chat.desert/9": "I had a close encounter with a prickly cactus the other day. One must exercise utmost caution while navigating this treacherous terrain!",
  "strong.dialogue.chat.desert/10": "Life in this arid desert is no walk in the park, my friend. However, we are fortunate to have this village, where water and food are within our reach.",

  "strong.dialogue.story.exploring.success/1": "Awesome! Someday, mark my words, I'll embark on the ultimate exploration of this entire realm!",
  "strong.dialogue.story.exploring.success/2": "Oh. My. Notch! Listening to your tales of adventure makes my heart burn with wanderlust! I mean, don't get me wrong, I love my village, family, and friends, but the thought of discovering new lands and uncharted territories... it's simply mesmerizing!",
  "strong.dialogue.story.exploring.success/3": "Whoa, hold the tamed wolf! You need serious guts to face the wild, unexplored corners of the world. I mean, I'm content with my cozy little village, but you, my friend, are on a whole different level of audacity!",
  "strong.dialogue.story.exploring.fail/1": "Your tales have become dreadfully repetitive, my dear.",
  "strong.dialogue.story.exploring.fail/2": "Oh my, careful there! I hope you don't get lost in all that darkness and sharpness, Mr. Intense!",
  "strong.dialogue.story.exploring.fai/l3": "Interacting with you is like conversing with a faint-hearted dreamer desperately craving the audacity to achieve greatness. Minus the charming innocence, of course.",

  "strong.dialogue.story.nether.success/1": "Is it that scorching over there?! My, oh my!",
  "strong.dialogue.story.nether.success/2": "By the heavens! How on earth have you triumphed in that perilous realm? My mind is blown.",
  "strong.dialogue.story.nether.success/3": "Legends speak of vast riches hidden in the fiery depths of the Nether. Oh, if only I possessed the courage to embark on such a daring expedition...",
  "strong.dialogue.story.nether.success/4": "Your courage knows no bounds! Do you not tremble in fear each time you venture there? N-Not that I would ever admit to such a thing...",
  "strong.dialogue.story.nether.success/5": "Have you ever laid eyes upon a Zombified Piglin, that mysterious creature of the Nether?",
  "strong.dialogue.story.nether.fail/1": "Hah! You? In the Nether? Don't make me laugh!",
  "strong.dialogue.story.nether.fail/2": "2. Oh, so you're the one who got ambushed by Piglins! Figures.",
  "strong.dialogue.story.nether.fail/3": "3. Save your Nether tales for someone who actually cares, because I certainly don't.",
  "strong.dialogue.story.nether.fail/4": "4. Look at you, all weak and feeble. Nether? Yeah, right.",
  "strong.dialogue.story.nether.fail/5": "5. My great-grandfather faced the fiery depths of the Nether, and he never mentioned anything about that warped fungus you're blabbering about. Nice try, fibber!",

  "strong.dialogue.story.enderdragon.success/1": "Astounding! And by chance, did you procure the sacred dragon egg?",
  "strong.dialogue.story.enderdragon.success/2": "Good heavens! You've truly vanquished the colossal dragon of lore?! The whole village shall reverberate with tales of your heroism throughout eternity!",
  "strong.dialogue.story.enderdragon.fail/1": "Ha! Are you out of your mind? The ender dragon is nothing but a fairy tale!",
  "strong.dialogue.story.enderdragon.fail/2": "Are you pulling my leg? No mortal in their right mind would dare to challenge the almighty ender dragon!",

  "strong.dialogue.story.wither.success/1": "No way! I've heard the Wither wreaks absolute havoc like nothing else!",
  "strong.dialogue.story.wither.success/2": "Unbelievable! You've managed to conquer the mighty Wither?! My mind is blown!",
  "strong.dialogue.story.wither.fail/1": "Yeah, right. Like I'm supposed to believe that nonsense.",
  "strong.dialogue.story.wither.fail/2": "Oh please, spare me the act. You're standing here without a scratch, so don't even try to convince me otherwise.",

  "strong.dialogue.stay.fail/1": "No way, mate! I'm all about that adventurous life  seeking thrills, going on daring quests!",
  "strong.dialogue.stay.fail/2": "Appreciate the offer, but I'm cut from a different cloth  the kind that craves excitement, seeks out new horizons, and embarks on epic quests!",
  "strong.dialogue.stay.fail/3": "This village is alright, but my heart beats for adventure! I'm all about exploring uncharted lands and pushing the limits!",
  "strong.dialogue.stay.repeat/1": "Seriously? You've already hit me with this question before, mate!",
  "strong.dialogue.stay.repeat/2": "Oh boy, didn't I just answer that? You're asking me again? Seriously?",
  "strong.dialogue.stay.success/1": "Fantastic! This village is an absolute paradise, and I couldn't be more thrilled to call it my home!",
  "strong.dialogue.stay.success/2": "Oh my goodness, this village is beyond amazing! I am absolutely over the moon to stay here! It's like a dream come true!",
  "strong.dialogue.stay.no_space/1": "Ugh, this village is bursting at the seams! It's like the entire world decided to squeeze into this tiny spot.",
  "strong.dialogue.stay.no_space/2": "I might consider sticking around, but seriously, I'm not sleeping on the floor. All the beds are taken, and I refuse to settle for anything less than pure comfort.",

  "strong.dialogue.hire/1": "Sure thing, boss! Just give me the word and I'll be at your service. Just remember, quality help comes at a price.",
  "strong.dialogue.hire/2": "Oh, you need assistance? Well, lucky for you, I'm here and ready to earn those shiny emeralds! Just say the word and consider it done.",
  "strong.dialogue.hire/3": "Excellent choice! I guarantee you won't regret hiring me. Just make sure those emeralds are in hand because my skills don't come cheap, my friend.",
  "strong.dialogue.no_money/1": "Do you take me for a fool? You better cough up a whole chest full of emeralds if you think I'll work for you with that pathetic offer.",
  "strong.dialogue.no_money/2": "You think you can get my expertise for a handful of emeralds? Think again, my friend. You'll need a king's ransom if you want my services.",
  "strong.dialogue.no_money/3": "Sweetie, if you want me to even consider working for you, you'll have to come back with a mountain of emeralds. What you've got there won't even buy you a second of my time.",

  "strong.dialogue.main.rock_paper_scissor/1": "Get ready to witness my sheer brilliance in the timeless game of Rock Paper Scissors. I hope you're ready for a taste of defeat!",
  "strong.dialogue.rock_paper_scissor/1": "Brace yourself for the ultimate showdown of rock, paper, scissors! Prepare to be crushed by my victorious choice!",
  "strong.dialogue.rock_paper_scissor/2": "Ha! Prepare to witness the sheer brilliance of my strategy! Victory is already mine, my friend.",
  "strong.dialogue.rock_paper_scissor.rock/1": "Prepare to witness the sheer force of my rock!",
  "strong.dialogue.rock_paper_scissor.paper/1": "Prepare yourself for the wrath of my paper! It shall conquer your rock without mercy!",
  "strong.dialogue.rock_paper_scissor.scissor/1": "Haha! Scissor, my friend, the king of swift and decisive cuts!",
  "strong.dialogue.rock_paper_scissor.loose.rock/1": "Ha! I've got you beat! Paper! I dominate!",
  "strong.dialogue.rock_paper_scissor.loose.paper/1": "Behold, the power of scissors! I shall triumph once again!",
  "strong.dialogue.rock_paper_scissor.loose.scissor/1": "Scissors, prepare to be obliterated! My rock will smash you into oblivion!",
  "strong.dialogue.rock_paper_scissor.win.rock/1": "Darn it! Crushed by the mighty rock of defeat! Guess I'll have to lick my wounds and try again!",
  "strong.dialogue.rock_paper_scissor.win.paper/1": "Ah, rock, my eternal nemesis! No matter how hard I try, it always manages to best me. It's like it has some mystical powers that defy all logic! Truly, a formidable adversary indeed.",
  "strong.dialogue.rock_paper_scissor.win.scissor/1": "Haha! Looks like I underestimated you! Scissors truly sliced through my hopes and dreams this round.",
  "_": ""
}